{
  "3": {
    "<pad>": 0,
    "</s>": 1,
    "<s>": 2,
    "unk": 3,
    "<dontcare>": 4,
    "<none>": 5,
    "i": 6,
    "would": 7,
    "like": 8,
    "to": 9,
    "visit": 10,
    "a": 11,
    "museum": 12,
    "in": 13,
    "town": 14,
    ".": 15,
    "what": 16,
    "can": 17,
    "you": 18,
    "suggest": 19,
    "?": 20,
    "yes": 21,
    "no": 22,
    "dontcare": 23,
    "i would": 24,
    "would like": 25,
    "like to": 26,
    "to visit": 27,
    "visit a": 28,
    "a museum": 29,
    "museum in": 30,
    "in town": 31,
    "town what": 32,
    "what can": 33,
    "can you": 34,
    "you suggest": 35,
    "i would like": 36,
    "would like to": 37,
    "like to visit": 38,
    "to visit a": 39,
    "visit a museum": 40,
    "a museum in": 41,
    "museum in town": 42,
    "in town what": 43,
    "town what can": 44,
    "what can you": 45,
    "can you suggest": 46,
    "have": 47,
    "preferences": 48,
    "for": 49,
    "area": 50,
    ",": 51,
    "just": 52,
    "couple": 53,
    "i have": 54,
    "have no": 55,
    "no preferences": 56,
    "preferences for": 57,
    "for area": 58,
    "area can": 59,
    "you just": 60,
    "just suggest": 61,
    "suggest a": 62,
    "a couple": 63,
    "i have no": 64,
    "have no preferences": 65,
    "no preferences for": 66,
    "preferences for area": 67,
    "for area can": 68,
    "area can you": 69,
    "can you just": 70,
    "you just suggest": 71,
    "just suggest a": 72,
    "suggest a couple": 73,
    "give": 74,
    "me": 75,
    "the": 76,
    "address": 77,
    "scott": 78,
    "polar": 79,
    "you give": 80,
    "give me": 81,
    "me the": 82,
    "the address": 83,
    "address for": 84,
    "for the": 85,
    "the scott": 86,
    "scott polar": 87,
    "polar museum": 88,
    "can you give": 89,
    "you give me": 90,
    "give me the": 91,
    "me the address": 92,
    "the address for": 93,
    "address for the": 94,
    "for the scott": 95,
    "the scott polar": 96,
    "scott polar museum": 97,
    "that": 98,
    "is": 99,
    "all": 100,
    "help": 101,
    "need": 102,
    "today": 103,
    "thanks": 104,
    "that is": 105,
    "is all": 106,
    "all the": 107,
    "the help": 108,
    "help i": 109,
    "i need": 110,
    "need today": 111,
    "today thanks": 112,
    "thanks for": 113,
    "that is all": 114,
    "is all the": 115,
    "all the help": 116,
    "the help i": 117,
    "help i need": 118,
    "i need today": 119,
    "need today thanks": 120,
    "today thanks for": 121,
    "thanks for the": 122,
    "for the help": 123,
    "am": 124,
    "looking": 125,
    "i am": 126,
    "am looking": 127,
    "looking for": 128,
    "for a": 129,
    "museum to": 130,
    "i am looking": 131,
    "am looking for": 132,
    "looking for a": 133,
    "for a museum": 134,
    "a museum to": 135,
    "museum to visit": 136,
    "recommend": 137,
    "no what": 138,
    "you recommend": 139,
    "no what can": 140,
    "can you recommend": 141,
    "well": 142,
    "price": 143,
    "great": 144,
    "there": 145,
    "postcode": 146,
    "well the": 147,
    "the price": 148,
    "price is": 149,
    "is great": 150,
    "great what": 151,
    "what is": 152,
    "is there": 153,
    "there postcode": 154,
    "well the price": 155,
    "the price is": 156,
    "price is great": 157,
    "is great what": 158,
    "great what is": 159,
    "what is there": 160,
    "is there postcode": 161,
    "been": 162,
    "very": 163,
    "helpful": 164,
    "thank": 165,
    "no you": 166,
    "you have": 167,
    "have been": 168,
    "been very": 169,
    "very helpful": 170,
    "helpful thank": 171,
    "thank you": 172,
    "no you have": 173,
    "you have been": 174,
    "have been very": 175,
    "been very helpful": 176,
    "very helpful thank": 177,
    "helpful thank you": 178,
    "do": 179,
    "any": 180,
    "details": 181,
    "jesus": 182,
    "green": 183,
    "outdoor": 184,
    "pool": 185,
    "do you": 186,
    "have any": 187,
    "any details": 188,
    "details for": 189,
    "for jesus": 190,
    "jesus green": 191,
    "green outdoor": 192,
    "outdoor pool": 193,
    "do you have": 194,
    "you have any": 195,
    "have any details": 196,
    "any details for": 197,
    "details for jesus": 198,
    "for jesus green": 199,
    "jesus green outdoor": 200,
    "green outdoor pool": 201,
    "attraction": 202,
    "type": 203,
    "phone": 204,
    "number": 205,
    "and": 206,
    "entrance": 207,
    "fee": 208,
    "please": 209,
    "like the": 210,
    "the attraction": 211,
    "attraction type": 212,
    "type phone": 213,
    "phone number": 214,
    "number and": 215,
    "and entrance": 216,
    "entrance fee": 217,
    "fee please": 218,
    "would like the": 219,
    "like the attraction": 220,
    "the attraction type": 221,
    "attraction type phone": 222,
    "type phone number": 223,
    "phone number and": 224,
    "number and entrance": 225,
    "and entrance fee": 226,
    "entrance fee please": 227,
    "alright": 228,
    "alright that": 229,
    "all thank": 230,
    "alright that is": 231,
    "is all thank": 232,
    "all thank you": 233,
    "getting": 234,
    "ready": 235,
    "go": 236,
    "off": 237,
    "college": 238,
    "thought": 239,
    "while": 240,
    "was": 241,
    "maybe": 242,
    "could": 243,
    "1": 244,
    "am getting": 245,
    "getting ready": 246,
    "ready to": 247,
    "to go": 248,
    "go off": 249,
    "off to": 250,
    "to college": 251,
    "college i": 252,
    "i thought": 253,
    "thought while": 254,
    "while i": 255,
    "i was": 256,
    "was in": 257,
    "town maybe": 258,
    "maybe i": 259,
    "i could": 260,
    "could visit": 261,
    "visit 1": 262,
    "i am getting": 263,
    "am getting ready": 264,
    "getting ready to": 265,
    "ready to go": 266,
    "to go off": 267,
    "go off to": 268,
    "off to college": 269,
    "to college i": 270,
    "college i thought": 271,
    "i thought while": 272,
    "thought while i": 273,
    "while i was": 274,
    "i was in": 275,
    "was in town": 276,
    "in town maybe": 277,
    "town maybe i": 278,
    "maybe i could": 279,
    "i could visit": 280,
    "could visit 1": 281,
    "think": 282,
    "centre": 283,
    "i think": 284,
    "think i": 285,
    "visit the": 286,
    "the centre": 287,
    "i think i": 288,
    "think i would": 289,
    "to visit the": 290,
    "visit the centre": 291,
    "!": 292,
    "great can": 293,
    "can i": 294,
    "have the": 295,
    "address please": 296,
    "great can i": 297,
    "can i have": 298,
    "i have the": 299,
    "have the address": 300,
    "the address please": 301,
    "much": 302,
    "great thank": 303,
    "you very": 304,
    "very much": 305,
    "much that": 306,
    "all i": 307,
    "great thank you": 308,
    "thank you very": 309,
    "you very much": 310,
    "very much that": 311,
    "much that is": 312,
    "is all i": 313,
    "all i need": 314,
    "place": 315,
    "fun": 316,
    "are": 317,
    "nightclubs": 318,
    "west": 319,
    "a place": 320,
    "place to": 321,
    "go in": 322,
    "town to": 323,
    "to have": 324,
    "have fun": 325,
    "fun are": 326,
    "are there": 327,
    "there any": 328,
    "any nightclubs": 329,
    "nightclubs in": 330,
    "in the": 331,
    "the west": 332,
    "for a place": 333,
    "a place to": 334,
    "place to go": 335,
    "to go in": 336,
    "go in town": 337,
    "in town to": 338,
    "town to have": 339,
    "to have fun": 340,
    "have fun are": 341,
    "fun are there": 342,
    "are there any": 343,
    "there any nightclubs": 344,
    "any nightclubs in": 345,
    "nightclubs in the": 346,
    "in the west": 347,
    "how": 348,
    "about": 349,
    "how about": 350,
    "about a": 351,
    "a college": 352,
    "college in": 353,
    "how about a": 354,
    "about a college": 355,
    "a college in": 356,
    "college in the": 357,
    "of": 358,
    "is the": 359,
    "address of": 360,
    "of that": 361,
    "that college": 362,
    "what is the": 363,
    "is the address": 364,
    "the address of": 365,
    "address of that": 366,
    "of that college": 367,
    "be": 368,
    "it": 369,
    "no that": 370,
    "that would": 371,
    "would be": 372,
    "be it": 373,
    "it thanks": 374,
    "no that would": 375,
    "that would be": 376,
    "would be it": 377,
    "be it thanks": 378,
    "hello": 379,
    "some": 380,
    "entertainment": 381,
    "hello i": 382,
    "for some": 383,
    "some entertainment": 384,
    "hello i am": 385,
    "looking for some": 386,
    "for some entertainment": 387,
    "nothing": 388,
    "particular": 389,
    "nothing in": 390,
    "in particular": 391,
    "particular what": 392,
    "what do": 393,
    "nothing in particular": 394,
    "in particular what": 395,
    "particular what do": 396,
    "what do you": 397,
    "do you recommend": 398,
    "awesome": 399,
    "their": 400,
    "awesome could": 401,
    "could you": 402,
    "you please": 403,
    "please give": 404,
    "me their": 405,
    "their phone": 406,
    "awesome could you": 407,
    "could you please": 408,
    "you please give": 409,
    "please give me": 410,
    "give me their": 411,
    "me their phone": 412,
    "their phone number": 413,
    "goodbye": 414,
    "no i": 415,
    "think that": 416,
    "is it": 417,
    "it for": 418,
    "for today": 419,
    "today thank": 420,
    "you goodbye": 421,
    "no i think": 422,
    "i think that": 423,
    "think that is": 424,
    "that is it": 425,
    "is it for": 426,
    "it for today": 427,
    "for today thank": 428,
    "today thank you": 429,
    "thank you goodbye": 430,
    "college can": 431,
    "you help": 432,
    "help me": 433,
    "for a college": 434,
    "a college can": 435,
    "college can you": 436,
    "can you help": 437,
    "you help me": 438,
    "any in": 439,
    "have any in": 440,
    "any in the": 441,
    "in the centre": 442,
    "sure": 443,
    "which": 444,
    "sure which": 445,
    "which 1": 446,
    "1 do": 447,
    "sure which 1": 448,
    "which 1 do": 449,
    "1 do you": 450,
    "the phone": 451,
    "and postcode": 452,
    "postcode for": 453,
    "for that": 454,
    "that 1": 455,
    "is the phone": 456,
    "the phone number": 457,
    "number and postcode": 458,
    "and postcode for": 459,
    "postcode for that": 460,
    "for that 1": 461,
    "get": 462,
    "complete": 463,
    "could i": 464,
    "i get": 465,
    "get the": 466,
    "the complete": 467,
    "complete address": 468,
    "could i get": 469,
    "i get the": 470,
    "get the complete": 471,
    "the complete address": 472,
    "complete address please": 473,
    "helped": 474,
    "have helped": 475,
    "helped me": 476,
    "me thank": 477,
    "you have helped": 478,
    "have helped me": 479,
    "helped me thank": 480,
    "me thank you": 481,
    "tell": 482,
    "cambridge": 483,
    "university": 484,
    "botanic": 485,
    "gardens": 486,
    "you tell": 487,
    "tell me": 488,
    "me about": 489,
    "about the": 490,
    "the cambridge": 491,
    "cambridge university": 492,
    "university botanic": 493,
    "botanic gardens": 494,
    "can you tell": 495,
    "you tell me": 496,
    "tell me about": 497,
    "me about the": 498,
    "about the cambridge": 499,
    "the cambridge university": 500,
    "cambridge university botanic": 501,
    "university botanic gardens": 502,
    "-s": 503,
    "any place": 504,
    "place -s": 505,
    "-s to": 506,
    "the town": 507,
    "town centre": 508,
    "there any place": 509,
    "any place -s": 510,
    "place -s to": 511,
    "-s to go": 512,
    "go in the": 513,
    "in the town": 514,
    "the town centre": 515,
    "not": 516,
    "especially": 517,
    "kicking": 518,
    "around": 519,
    "few": 520,
    "hour": 521,
    "something": 522,
    "not especially": 523,
    "especially just": 524,
    "just kicking": 525,
    "kicking around": 526,
    "around the": 527,
    "centre for": 528,
    "a few": 529,
    "few hour": 530,
    "hour -s": 531,
    "-s and": 532,
    "and looking": 533,
    "for something": 534,
    "something to": 535,
    "to do": 536,
    "not especially just": 537,
    "especially just kicking": 538,
    "just kicking around": 539,
    "kicking around the": 540,
    "around the town": 541,
    "town centre for": 542,
    "centre for a": 543,
    "for a few": 544,
    "a few hour": 545,
    "few hour -s": 546,
    "hour -s and": 547,
    "-s and looking": 548,
    "and looking for": 549,
    "looking for something": 550,
    "for something to": 551,
    "something to do": 552,
    "want": 553,
    "sort": 554,
    "i just": 555,
    "just want": 556,
    "want something": 557,
    "do in": 558,
    "centre of": 559,
    "of town": 560,
    "town can": 561,
    "me what": 562,
    "what sort": 563,
    "sort of": 564,
    "of place": 565,
    "-s there": 566,
    "there are": 567,
    "i just want": 568,
    "just want something": 569,
    "want something to": 570,
    "to do in": 571,
    "do in the": 572,
    "the centre of": 573,
    "centre of town": 574,
    "of town can": 575,
    "town can you": 576,
    "tell me what": 577,
    "me what sort": 578,
    "what sort of": 579,
    "sort of place": 580,
    "of place -s": 581,
    "place -s there": 582,
    "-s there are": 583,
    "nightclub": 584,
    "recommend a": 585,
    "a nightclub": 586,
    "you recommend a": 587,
    "recommend a nightclub": 588,
    "its": 589,
    "contact": 590,
    "yes please": 591,
    "please what": 592,
    "is its": 593,
    "its entrance": 594,
    "fee contact": 595,
    "contact number": 596,
    "yes please what": 597,
    "please what is": 598,
    "what is its": 599,
    "is its entrance": 600,
    "its entrance fee": 601,
    "entrance fee contact": 602,
    "fee contact number": 603,
    "contact number and": 604,
    "adios": 605,
    "it adios": 606,
    "no that is": 607,
    "is it adios": 608,
    "your": 609,
    "for your": 610,
    "your help": 611,
    "thanks for your": 612,
    "for your help": 613,
    "architectural": 614,
    "interest": 615,
    "there place": 616,
    "-s in": 617,
    "of architectural": 618,
    "architectural interest": 619,
    "are there place": 620,
    "there place -s": 621,
    "place -s in": 622,
    "-s in town": 623,
    "in town centre": 624,
    "town centre of": 625,
    "centre of architectural": 626,
    "of architectural interest": 627,
    "surprise": 628,
    "fees": 629,
    "surprise me": 630,
    "what are": 631,
    "are the": 632,
    "the entrance": 633,
    "entrance fees": 634,
    "surprise me what": 635,
    "me what are": 636,
    "what are the": 637,
    "are the entrance": 638,
    "the entrance fees": 639,
    "sounds": 640,
    "so": 641,
    "that sounds": 642,
    "sounds great": 643,
    "great thanks": 644,
    "thanks so": 645,
    "so much": 646,
    "much for": 647,
    "that sounds great": 648,
    "sounds great thanks": 649,
    "great thanks so": 650,
    "thanks so much": 651,
    "so much for": 652,
    "much for your": 653,
    "needed": 654,
    "no thank": 655,
    "you that": 656,
    "i needed": 657,
    "no thank you": 658,
    "thank you that": 659,
    "you that is": 660,
    "all i needed": 661,
    "an": 662,
    "called": 663,
    "williams": 664,
    "art": 665,
    "antiques": 666,
    "for an": 667,
    "an attraction": 668,
    "attraction called": 669,
    "called williams": 670,
    "williams art": 671,
    "art and": 672,
    "and antiques": 673,
    "looking for an": 674,
    "for an attraction": 675,
    "an attraction called": 676,
    "attraction called williams": 677,
    "called williams art": 678,
    "williams art and": 679,
    "art and antiques": 680,
    "just the": 681,
    "the area": 682,
    "area and": 683,
    "postcode please": 684,
    "thank you just": 685,
    "you just the": 686,
    "just the area": 687,
    "the area and": 688,
    "area and postcode": 689,
    "and postcode please": 690,
    "needed thank": 691,
    "i needed thank": 692,
    "needed thank you": 693,
    "find": 694,
    "fitzwilliam": 695,
    "me find": 696,
    "find the": 697,
    "the fitzwilliam": 698,
    "fitzwilliam museum": 699,
    "help me find": 700,
    "me find the": 701,
    "find the fitzwilliam": 702,
    "the fitzwilliam museum": 703,
    "address attraction": 704,
    "type and": 705,
    "and area": 706,
    "area please": 707,
    "can i get": 708,
    "get the address": 709,
    "the address attraction": 710,
    "address attraction type": 711,
    "attraction type and": 712,
    "type and area": 713,
    "and area please": 714,
    "'ve": 715,
    "helping": 716,
    "you 've": 717,
    "'ve been": 718,
    "been great": 719,
    "you for": 720,
    "for helping": 721,
    "no you 've": 722,
    "you 've been": 723,
    "'ve been great": 724,
    "been great thank": 725,
    "thank you for": 726,
    "you for helping": 727,
    "specific": 728,
    "no specific": 729,
    "specific area": 730,
    "recommend 1": 731,
    "1 for": 732,
    "for me": 733,
    "no specific area": 734,
    "specific area can": 735,
    "you recommend 1": 736,
    "recommend 1 for": 737,
    "1 for me": 738,
    "yes give": 739,
    "number please": 740,
    "yes give me": 741,
    "me the phone": 742,
    "phone number please": 743,
    "information": 744,
    "day": 745,
    "thanks that": 746,
    "the information": 747,
    "information i": 748,
    "needed have": 749,
    "have a": 750,
    "a great": 751,
    "great day": 752,
    "thanks that is": 753,
    "all the information": 754,
    "the information i": 755,
    "information i needed": 756,
    "i needed have": 757,
    "needed have a": 758,
    "have a great": 759,
    "a great day": 760,
    "hey": 761,
    "swimming": 762,
    "here": 763,
    "city": 764,
    "hey there": 765,
    "there can": 766,
    "find a": 767,
    "a swimming": 768,
    "swimming pool": 769,
    "pool here": 770,
    "here in": 771,
    "the city": 772,
    "hey there can": 773,
    "there can you": 774,
    "me find a": 775,
    "find a swimming": 776,
    "a swimming pool": 777,
    "swimming pool here": 778,
    "pool here in": 779,
    "here in the": 780,
    "in the city": 781,
    "really": 782,
    "will": 783,
    "provide": 784,
    "not really": 785,
    "really no": 786,
    "no any": 787,
    "any area": 788,
    "area will": 789,
    "will do": 790,
    "do can": 791,
    "1 and": 792,
    "and provide": 793,
    "provide me": 794,
    "not really no": 795,
    "really no any": 796,
    "no any area": 797,
    "any area will": 798,
    "area will do": 799,
    "will do can": 800,
    "do can you": 801,
    "recommend 1 and": 802,
    "1 and provide": 803,
    "and provide me": 804,
    "provide me the": 805,
    "actually": 806,
    "good": 807,
    "no actually": 808,
    "actually that": 809,
    "is just": 810,
    "needed thanks": 811,
    "thanks and": 812,
    "and have": 813,
    "a good": 814,
    "good day": 815,
    "no actually that": 816,
    "actually that is": 817,
    "that is just": 818,
    "is just the": 819,
    "just the information": 820,
    "i needed thanks": 821,
    "needed thanks and": 822,
    "thanks and have": 823,
    "and have a": 824,
    "have a good": 825,
    "a good day": 826,
    "colleges": 827,
    "side": 828,
    "what colleges": 829,
    "colleges are": 830,
    "are in": 831,
    "west side": 832,
    "side of": 833,
    "me what colleges": 834,
    "what colleges are": 835,
    "colleges are in": 836,
    "are in the": 837,
    "the west side": 838,
    "west side of": 839,
    "side of town": 840,
    "numbers": 841,
    "these": 842,
    "phone numbers": 843,
    "numbers for": 844,
    "for these": 845,
    "these colleges": 846,
    "are the phone": 847,
    "the phone numbers": 848,
    "phone numbers for": 849,
    "numbers for these": 850,
    "for these colleges": 851,
    "is it thanks": 852,
    "trying": 853,
    "neat": 854,
    "able": 855,
    "whats": 856,
    "available": 857,
    "out": 858,
    "am trying": 859,
    "trying to": 860,
    "to find": 861,
    "a really": 862,
    "really neat": 863,
    "neat museum": 864,
    "visit would": 865,
    "would you": 866,
    "you be": 867,
    "be able": 868,
    "able to": 869,
    "to tell": 870,
    "me whats": 871,
    "whats available": 872,
    "available out": 873,
    "out there": 874,
    "i am trying": 875,
    "am trying to": 876,
    "trying to find": 877,
    "to find a": 878,
    "find a really": 879,
    "a really neat": 880,
    "really neat museum": 881,
    "neat museum to": 882,
    "to visit would": 883,
    "visit would you": 884,
    "would you be": 885,
    "you be able": 886,
    "be able to": 887,
    "able to tell": 888,
    "to tell me": 889,
    "tell me whats": 890,
    "me whats available": 891,
    "whats available out": 892,
    "available out there": 893,
    "them": 894,
    "are any": 895,
    "any of": 896,
    "of them": 897,
    "them in": 898,
    "are any of": 899,
    "any of them": 900,
    "of them in": 901,
    "them in the": 902,
    "perfect": 903,
    "be perfect": 904,
    "perfect can": 905,
    "would be perfect": 906,
    "be perfect can": 907,
    "perfect can i": 908,
    "get the phone": 909,
    "no not": 910,
    "not today": 911,
    "thanks goodbye": 912,
    "no not today": 913,
    "not today thanks": 914,
    "today thanks goodbye": 915,
    "go can": 916,
    "to go can": 917,
    "go can you": 918,
    "types": 919,
    "what attraction": 920,
    "attraction types": 921,
    "types do": 922,
    "have in": 923,
    "what attraction types": 924,
    "attraction types do": 925,
    "types do you": 926,
    "you have in": 927,
    "have in the": 928,
    "sure can": 929,
    "1 to": 930,
    "to me": 931,
    "me and": 932,
    "and give": 933,
    "address and": 934,
    "and type": 935,
    "sure can you": 936,
    "recommend 1 to": 937,
    "1 to me": 938,
    "to me and": 939,
    "me and give": 940,
    "and give me": 941,
    "the address and": 942,
    "address and type": 943,
    "for all": 944,
    "all of": 945,
    "of your": 946,
    "you for all": 947,
    "for all of": 948,
    "all of your": 949,
    "of your help": 950,
    "with": 951,
    "helped with": 952,
    "with what": 953,
    "what i": 954,
    "have helped with": 955,
    "helped with what": 956,
    "with what i": 957,
    "what i needed": 958,
    "hi": 959,
    "somewhere": 960,
    "hi i": 961,
    "for somewhere": 962,
    "somewhere to": 963,
    "centre area": 964,
    "hi i am": 965,
    "looking for somewhere": 966,
    "for somewhere to": 967,
    "somewhere to go": 968,
    "the centre area": 969,
    "love": 970,
    "tour": 971,
    "if": 972,
    "would love": 973,
    "love to": 974,
    "to maybe": 975,
    "maybe tour": 976,
    "tour a": 977,
    "college if": 978,
    "if i": 979,
    "i can": 980,
    "i would love": 981,
    "would love to": 982,
    "love to maybe": 983,
    "to maybe tour": 984,
    "maybe tour a": 985,
    "tour a college": 986,
    "a college if": 987,
    "college if i": 988,
    "if i can": 989,
    "yes and": 990,
    "and do": 991,
    "and phone": 992,
    "yes and do": 993,
    "and do you": 994,
    "you have the": 995,
    "address and phone": 996,
    "and phone number": 997,
    "you you": 998,
    "helpful have": 999,
    "thank you you": 1000,
    "you you have": 1001,
    "very helpful have": 1002,
    "helpful have a": 1003,
    "to help": 1004,
    "me with": 1005,
    "with a": 1006,
    "a particular": 1007,
    "particular attraction": 1008,
    "able to help": 1009,
    "to help me": 1010,
    "help me with": 1011,
    "me with a": 1012,
    "with a particular": 1013,
    "a particular attraction": 1014,
    "people": 1015,
    "'s": 1016,
    "portraits": 1017,
    "exhibition": 1018,
    "at": 1019,
    "girton": 1020,
    "address postcode": 1021,
    "postcode and": 1022,
    "and attraction": 1023,
    "type for": 1024,
    "for people": 1025,
    "people 's": 1026,
    "'s portraits": 1027,
    "portraits exhibition": 1028,
    "exhibition at": 1029,
    "at girton": 1030,
    "girton college": 1031,
    "college thank": 1032,
    "looking for the": 1033,
    "for the address": 1034,
    "the address postcode": 1035,
    "address postcode and": 1036,
    "postcode and attraction": 1037,
    "and attraction type": 1038,
    "attraction type for": 1039,
    "type for people": 1040,
    "for people 's": 1041,
    "people 's portraits": 1042,
    "'s portraits exhibition": 1043,
    "portraits exhibition at": 1044,
    "exhibition at girton": 1045,
    "at girton college": 1046,
    "girton college thank": 1047,
    "college thank you": 1048,
    "is the area": 1049,
    "bye": 1050,
    "yes that": 1051,
    "that will": 1052,
    "will be": 1053,
    "be all": 1054,
    "all thanks": 1055,
    "help bye": 1056,
    "yes that will": 1057,
    "that will be": 1058,
    "will be all": 1059,
    "be all thanks": 1060,
    "all thanks for": 1061,
    "your help bye": 1062,
    "include": 1063,
    "i want": 1064,
    "want a": 1065,
    "museum please": 1066,
    "please please": 1067,
    "please include": 1068,
    "include address": 1069,
    "i want a": 1070,
    "want a museum": 1071,
    "a museum please": 1072,
    "museum please please": 1073,
    "please please include": 1074,
    "please include address": 1075,
    "include address postcode": 1076,
    "postcode and area": 1077,
    "all your": 1078,
    "help that": 1079,
    "needed goodbye": 1080,
    "great thanks for": 1081,
    "thanks for all": 1082,
    "for all your": 1083,
    "all your help": 1084,
    "your help that": 1085,
    "help that is": 1086,
    "i needed goodbye": 1087,
    "on": 1088,
    "club": 1089,
    "salsa": 1090,
    "like information": 1091,
    "information on": 1092,
    "on club": 1093,
    "club salsa": 1094,
    "hello i would": 1095,
    "would like information": 1096,
    "like information on": 1097,
    "information on club": 1098,
    "on club salsa": 1099,
    "let": 1100,
    "you let": 1101,
    "let me": 1102,
    "me have": 1103,
    "have their": 1104,
    "their postcode": 1105,
    "can you let": 1106,
    "you let me": 1107,
    "let me have": 1108,
    "me have their": 1109,
    "have their postcode": 1110,
    "please help": 1111,
    "can you please": 1112,
    "you please help": 1113,
    "please help me": 1114,
    "find a place": 1115,
    "sports": 1116,
    "like a": 1117,
    "a sports": 1118,
    "sports place": 1119,
    "place in": 1120,
    "centre please": 1121,
    "would like a": 1122,
    "like a sports": 1123,
    "a sports place": 1124,
    "sports place in": 1125,
    "place in the": 1126,
    "the centre please": 1127,
    "okay": 1128,
    "cinemas": 1129,
    "okay are": 1130,
    "any cinemas": 1131,
    "cinemas in": 1132,
    "okay are there": 1133,
    "there any cinemas": 1134,
    "any cinemas in": 1135,
    "cinemas in the": 1136,
    "work": 1137,
    "okay that": 1138,
    "will work": 1139,
    "work can": 1140,
    "please tell": 1141,
    "number postcode": 1142,
    "and the": 1143,
    "okay that will": 1144,
    "that will work": 1145,
    "will work can": 1146,
    "work can you": 1147,
    "you please tell": 1148,
    "please tell me": 1149,
    "tell me their": 1150,
    "phone number postcode": 1151,
    "number postcode and": 1152,
    "postcode and the": 1153,
    "and the entrance": 1154,
    "the entrance fee": 1155,
    "worries": 1156,
    "'ll": 1157,
    "call": 1158,
    "no worries": 1159,
    "worries i": 1160,
    "i 'll": 1161,
    "'ll give": 1162,
    "give them": 1163,
    "them a": 1164,
    "a call": 1165,
    "call and": 1166,
    "and find": 1167,
    "find out": 1168,
    "out thanks": 1169,
    "help goodbye": 1170,
    "no worries i": 1171,
    "worries i 'll": 1172,
    "i 'll give": 1173,
    "'ll give them": 1174,
    "give them a": 1175,
    "them a call": 1176,
    "a call and": 1177,
    "call and find": 1178,
    "and find out": 1179,
    "find out thanks": 1180,
    "out thanks so": 1181,
    "much for all": 1182,
    "your help goodbye": 1183,
    "want to": 1184,
    "town please": 1185,
    "i want to": 1186,
    "want to find": 1187,
    "find a museum": 1188,
    "museum in the": 1189,
    "of town please": 1190,
    "may": 1191,
    "please may": 1192,
    "may have": 1193,
    "have i": 1194,
    "have phone": 1195,
    "yes please may": 1196,
    "please may have": 1197,
    "may have i": 1198,
    "have i have": 1199,
    "i have phone": 1200,
    "have phone number": 1201,
    "nope": 1202,
    "nope that": 1203,
    "it thank": 1204,
    "nope that is": 1205,
    "is it thank": 1206,
    "it thank you": 1207,
    "theatre": 1208,
    "a theatre": 1209,
    "theatre can": 1210,
    "for a theatre": 1211,
    "a theatre can": 1212,
    "theatre can you": 1213,
    "does": 1214,
    "matter": 1215,
    "choose": 1216,
    "favorite": 1217,
    "area does": 1218,
    "does not": 1219,
    "not matter": 1220,
    "matter please": 1221,
    "please choose": 1222,
    "choose your": 1223,
    "your favorite": 1224,
    "favorite and": 1225,
    "and tell": 1226,
    "and address": 1227,
    "address if": 1228,
    "if you": 1229,
    "you could": 1230,
    "area does not": 1231,
    "does not matter": 1232,
    "not matter please": 1233,
    "matter please choose": 1234,
    "please choose your": 1235,
    "choose your favorite": 1236,
    "your favorite and": 1237,
    "favorite and tell": 1238,
    "and tell me": 1239,
    "tell me the": 1240,
    "me the area": 1241,
    "and postcode and": 1242,
    "postcode and address": 1243,
    "and address if": 1244,
    "address if you": 1245,
    "if you could": 1246,
    "thats": 1247,
    "you thats": 1248,
    "thats all": 1249,
    "thank you thats": 1250,
    "you thats all": 1251,
    "south": 1252,
    "yes i": 1253,
    "the south": 1254,
    "yes i am": 1255,
    "in the south": 1256,
    "museums": 1257,
    "recommend any": 1258,
    "any good": 1259,
    "good museums": 1260,
    "museums there": 1261,
    "you recommend any": 1262,
    "recommend any good": 1263,
    "any good museums": 1264,
    "good museums there": 1265,
    "is their": 1266,
    "what is their": 1267,
    "is their phone": 1268,
    "the postcode": 1269,
    "me the postcode": 1270,
    "needed today": 1271,
    "i needed today": 1272,
    "needed today thanks": 1273,
    "attractions": 1274,
    "what attractions": 1275,
    "attractions are": 1276,
    "what attractions are": 1277,
    "attractions are in": 1278,
    "different": 1279,
    "what different": 1280,
    "different attraction": 1281,
    "types are": 1282,
    "there in": 1283,
    "what different attraction": 1284,
    "different attraction types": 1285,
    "attraction types are": 1286,
    "types are there": 1287,
    "are there in": 1288,
    "there in the": 1289,
    "what museum": 1290,
    "museum would": 1291,
    "what museum would": 1292,
    "museum would you": 1293,
    "would you recommend": 1294,
    "as": 1295,
    "is very": 1296,
    "helpful could": 1297,
    "postcode as": 1298,
    "as well": 1299,
    "well please": 1300,
    "so much that": 1301,
    "that is very": 1302,
    "is very helpful": 1303,
    "very helpful could": 1304,
    "helpful could i": 1305,
    "get the postcode": 1306,
    "the postcode as": 1307,
    "postcode as well": 1308,
    "as well please": 1309,
    "set": 1310,
    "much i": 1311,
    "am all": 1312,
    "all set": 1313,
    "set goodbye": 1314,
    "so much i": 1315,
    "much i am": 1316,
    "i am all": 1317,
    "am all set": 1318,
    "all set goodbye": 1319,
    "info": 1320,
    "kettle": 1321,
    "yard": 1322,
    "some info": 1323,
    "info on": 1324,
    "on an": 1325,
    "called kettle": 1326,
    "kettle 's": 1327,
    "'s yard": 1328,
    "for some info": 1329,
    "some info on": 1330,
    "info on an": 1331,
    "on an attraction": 1332,
    "attraction called kettle": 1333,
    "called kettle 's": 1334,
    "kettle 's yard": 1335,
    "know": 1336,
    "all that": 1337,
    "that i": 1338,
    "needed to": 1339,
    "to know": 1340,
    "is all that": 1341,
    "all that i": 1342,
    "that i needed": 1343,
    "i needed to": 1344,
    "needed to know": 1345,
    "trinity": 1346,
    "need information": 1347,
    "on trinity": 1348,
    "trinity college": 1349,
    "i need information": 1350,
    "need information on": 1351,
    "information on trinity": 1352,
    "on trinity college": 1353,
    "need to": 1354,
    "know the": 1355,
    "i need to": 1356,
    "need to know": 1357,
    "to know the": 1358,
    "know the attraction": 1359,
    "type and address": 1360,
    "need today thank": 1361,
    "too": 1362,
    "thanks you": 1363,
    "you too": 1364,
    "too goodbye": 1365,
    "thanks you too": 1366,
    "you too goodbye": 1367,
    "downing": 1368,
    "yes hello": 1369,
    "called downing": 1370,
    "downing college": 1371,
    "yes hello i": 1372,
    "for a particular": 1373,
    "particular attraction called": 1374,
    "attraction called downing": 1375,
    "called downing college": 1376,
    "you so": 1377,
    "thank you so": 1378,
    "you so much": 1379,
    "that was": 1380,
    "was all": 1381,
    "all goodbye": 1382,
    "no that was": 1383,
    "that was all": 1384,
    "was all goodbye": 1385,
    "corn": 1386,
    "exchange": 1387,
    "on the": 1388,
    "cambridge corn": 1389,
    "corn exchange": 1390,
    "information on the": 1391,
    "on the cambridge": 1392,
    "the cambridge corn": 1393,
    "cambridge corn exchange": 1394,
    "no thanks": 1395,
    "thanks i": 1396,
    "just need": 1397,
    "need their": 1398,
    "no thanks i": 1399,
    "thanks i just": 1400,
    "i just need": 1401,
    "just need their": 1402,
    "need their phone": 1403,
    "spot": 1404,
    "an entertainment": 1405,
    "entertainment spot": 1406,
    "spot in": 1407,
    "for an entertainment": 1408,
    "an entertainment spot": 1409,
    "entertainment spot in": 1410,
    "spot in town": 1411,
    "nice": 1412,
    "no just": 1413,
    "just tell": 1414,
    "me 1": 1415,
    "1 you": 1416,
    "you think": 1417,
    "think is": 1418,
    "is nice": 1419,
    "no just tell": 1420,
    "just tell me": 1421,
    "tell me 1": 1422,
    "me 1 you": 1423,
    "1 you think": 1424,
    "you think is": 1425,
    "think is nice": 1426,
    "also": 1427,
    "may i": 1428,
    "i also": 1429,
    "also get": 1430,
    "postcode the": 1431,
    "may i also": 1432,
    "i also get": 1433,
    "also get the": 1434,
    "the postcode the": 1435,
    "postcode the address": 1436,
    "address and the": 1437,
    "all for": 1438,
    "is all for": 1439,
    "all for today": 1440,
    "saint": 1441,
    "mary": 1442,
    "church": 1443,
    "hi can": 1444,
    "me i": 1445,
    "for information": 1446,
    "on great": 1447,
    "great saint": 1448,
    "saint mary": 1449,
    "mary 's": 1450,
    "'s church": 1451,
    "hi can you": 1452,
    "help me i": 1453,
    "me i am": 1454,
    "looking for information": 1455,
    "for information on": 1456,
    "information on great": 1457,
    "on great saint": 1458,
    "great saint mary": 1459,
    "saint mary 's": 1460,
    "mary 's church": 1461,
    "now": 1462,
    "thanks very": 1463,
    "need for": 1464,
    "for now": 1465,
    "now goodbye": 1466,
    "thanks very much": 1467,
    "i need for": 1468,
    "need for now": 1469,
    "for now goodbye": 1470,
    "architecture": 1471,
    "my": 1472,
    "options": 1473,
    "some architecture": 1474,
    "architecture to": 1475,
    "visit what": 1476,
    "are my": 1477,
    "my options": 1478,
    "for some architecture": 1479,
    "some architecture to": 1480,
    "architecture to visit": 1481,
    "to visit what": 1482,
    "visit what are": 1483,
    "what are my": 1484,
    "are my options": 1485,
    "saints": 1486,
    "about all": 1487,
    "all saints": 1488,
    "saints and": 1489,
    "and could": 1490,
    "a postcode": 1491,
    "how about all": 1492,
    "about all saints": 1493,
    "all saints and": 1494,
    "saints and could": 1495,
    "and could i": 1496,
    "could i have": 1497,
    "i have a": 1498,
    "have a postcode": 1499,
    "a postcode please": 1500,
    "should": 1501,
    "that should": 1502,
    "should be": 1503,
    "that should be": 1504,
    "should be all": 1505,
    "facility": 1506,
    "sports facility": 1507,
    "facility in": 1508,
    "for a sports": 1509,
    "a sports facility": 1510,
    "sports facility in": 1511,
    "facility in the": 1512,
    "instead": 1513,
    "museum instead": 1514,
    "about a museum": 1515,
    "a museum instead": 1516,
    "sounds good": 1517,
    "good what": 1518,
    "that sounds good": 1519,
    "sounds good what": 1520,
    "good what is": 1521,
    "and how": 1522,
    "how much": 1523,
    "much is": 1524,
    "it to": 1525,
    "to get": 1526,
    "get in": 1527,
    "is their postcode": 1528,
    "their postcode and": 1529,
    "postcode and how": 1530,
    "and how much": 1531,
    "how much is": 1532,
    "much is it": 1533,
    "is it to": 1534,
    "it to get": 1535,
    "to get in": 1536,
    "hanging": 1537,
    "tomorrow": 1538,
    "due": 1539,
    "appointment": 1540,
    "most": 1541,
    "am hanging": 1542,
    "hanging around": 1543,
    "around town": 1544,
    "town tomorrow": 1545,
    "tomorrow due": 1546,
    "due to": 1547,
    "to an": 1548,
    "an appointment": 1549,
    "appointment and": 1550,
    "and want": 1551,
    "do something": 1552,
    "something fun": 1553,
    "fun while": 1554,
    "am there": 1555,
    "there i": 1556,
    "'ll be": 1557,
    "be on": 1558,
    "centre most": 1559,
    "most of": 1560,
    "of the": 1561,
    "the day": 1562,
    "i am hanging": 1563,
    "am hanging around": 1564,
    "hanging around town": 1565,
    "around town tomorrow": 1566,
    "town tomorrow due": 1567,
    "tomorrow due to": 1568,
    "due to an": 1569,
    "to an appointment": 1570,
    "an appointment and": 1571,
    "appointment and want": 1572,
    "and want to": 1573,
    "want to do": 1574,
    "to do something": 1575,
    "do something fun": 1576,
    "something fun while": 1577,
    "fun while i": 1578,
    "while i am": 1579,
    "i am there": 1580,
    "am there i": 1581,
    "there i 'll": 1582,
    "i 'll be": 1583,
    "'ll be on": 1584,
    "be on the": 1585,
    "on the town": 1586,
    "town centre most": 1587,
    "centre most of": 1588,
    "most of the": 1589,
    "of the day": 1590,
    "either": 1591,
    "or": 1592,
    "fine": 1593,
    "either or": 1594,
    "or would": 1595,
    "be fine": 1596,
    "either or would": 1597,
    "or would be": 1598,
    "would be fine": 1599,
    "open": 1600,
    "anything": 1601,
    "pick": 1602,
    "am open": 1603,
    "open to": 1604,
    "to anything": 1605,
    "anything can": 1606,
    "just pick": 1607,
    "pick a": 1608,
    "a church": 1609,
    "church and": 1610,
    "i am open": 1611,
    "am open to": 1612,
    "open to anything": 1613,
    "to anything can": 1614,
    "anything can you": 1615,
    "you just pick": 1616,
    "just pick a": 1617,
    "pick a church": 1618,
    "a church and": 1619,
    "church and give": 1620,
    "address and entrance": 1621,
    "need thanks": 1622,
    "i need thanks": 1623,
    "spots": 1624,
    "any entertainment": 1625,
    "entertainment spots": 1626,
    "spots in": 1627,
    "there any entertainment": 1628,
    "any entertainment spots": 1629,
    "entertainment spots in": 1630,
    "spots in the": 1631,
    "any colleges": 1632,
    "colleges in": 1633,
    "have any colleges": 1634,
    "any colleges in": 1635,
    "colleges in the": 1636,
    "sounds perfect": 1637,
    "their address": 1638,
    "that sounds perfect": 1639,
    "sounds perfect can": 1640,
    "perfect can you": 1641,
    "me their address": 1642,
    "their address and": 1643,
    "address and postcode": 1644,
    "again": 1645,
    "it is": 1646,
    "is thanks": 1647,
    "thanks again": 1648,
    "it is thanks": 1649,
    "is thanks again": 1650,
    "looking for people": 1651,
    "girton college can": 1652,
    "yes i would": 1653,
    "like the area": 1654,
    "area and the": 1655,
    "and the postcode": 1656,
    "need for today": 1657,
    "for today thanks": 1658,
    "to tour": 1659,
    "is available": 1660,
    "want to tour": 1661,
    "to tour a": 1662,
    "of town what": 1663,
    "town what is": 1664,
    "what is available": 1665,
    "issue": 1666,
    "fee is": 1667,
    "is not": 1668,
    "not an": 1669,
    "an issue": 1670,
    "entrance fee is": 1671,
    "fee is not": 1672,
    "is not an": 1673,
    "not an issue": 1674,
    "have the postcode": 1675,
    "the postcode and": 1676,
    "and address for": 1677,
    "address for that": 1678,
    "for that college": 1679,
    "preferably": 1680,
    "near": 1681,
    "attractions do": 1682,
    "town preferably": 1683,
    "preferably near": 1684,
    "near the": 1685,
    "what attractions do": 1686,
    "attractions do you": 1687,
    "have in town": 1688,
    "in town preferably": 1689,
    "town preferably near": 1690,
    "preferably near the": 1691,
    "near the centre": 1692,
    "centre and": 1693,
    "recommend a college": 1694,
    "the centre and": 1695,
    "centre and tell": 1696,
    "me the entrance": 1697,
    "which is": 1698,
    "is your": 1699,
    "and what": 1700,
    "which is your": 1701,
    "is your favorite": 1702,
    "favorite and what": 1703,
    "and what is": 1704,
    "great that": 1705,
    "need thank": 1706,
    "great that is": 1707,
    "i need thank": 1708,
    "need thank you": 1709,
    "recommendations": 1710,
    "a entertainment": 1711,
    "entertainment attraction": 1712,
    "attraction to": 1713,
    "visit do": 1714,
    "any recommendations": 1715,
    "for a entertainment": 1716,
    "a entertainment attraction": 1717,
    "entertainment attraction to": 1718,
    "attraction to visit": 1719,
    "to visit do": 1720,
    "visit do you": 1721,
    "have any recommendations": 1722,
    "doe": 1723,
    "area doe": 1724,
    "doe not": 1725,
    "matter just": 1726,
    "just some": 1727,
    "the area doe": 1728,
    "area doe not": 1729,
    "doe not matter": 1730,
    "not matter just": 1731,
    "matter just some": 1732,
    "just some entertainment": 1733,
    "good could": 1734,
    "sounds good could": 1735,
    "good could you": 1736,
    "could you give": 1737,
    "their address please": 1738,
    "also need": 1739,
    "yes i also": 1740,
    "i also need": 1741,
    "also need their": 1742,
    "need their postcode": 1743,
    "postcode and phone": 1744,
    "yes thank": 1745,
    "yes thank you": 1746,
    "concert": 1747,
    "hall": 1748,
    "east": 1749,
    "part": 1750,
    "a concert": 1751,
    "concert hall": 1752,
    "hall in": 1753,
    "the east": 1754,
    "east part": 1755,
    "part of": 1756,
    "find a concert": 1757,
    "a concert hall": 1758,
    "concert hall in": 1759,
    "hall in the": 1760,
    "in the east": 1761,
    "the east part": 1762,
    "east part of": 1763,
    "part of town": 1764,
    "about an": 1765,
    "attraction instead": 1766,
    "how about an": 1767,
    "about an entertainment": 1768,
    "an entertainment attraction": 1769,
    "entertainment attraction instead": 1770,
    "and can": 1771,
    "of 1": 1772,
    "1 of": 1773,
    "of attraction": 1774,
    "yes and can": 1775,
    "and can i": 1776,
    "have the phone": 1777,
    "number and address": 1778,
    "and address of": 1779,
    "address of 1": 1780,
    "of 1 of": 1781,
    "1 of attraction": 1782,
    "go on": 1783,
    "thanks i am": 1784,
    "to go on": 1785,
    "go on the": 1786,
    "on the south": 1787,
    "number for": 1788,
    "phone number for": 1789,
    "number for that": 1790,
    "no thanks so": 1791,
    "find a college": 1792,
    "best": 1793,
    "by": 1794,
    "the best": 1795,
    "best college": 1796,
    "how can": 1797,
    "i contact": 1798,
    "contact them": 1799,
    "them by": 1800,
    "by phone": 1801,
    "which is the": 1802,
    "is the best": 1803,
    "the best college": 1804,
    "best college in": 1805,
    "centre and how": 1806,
    "and how can": 1807,
    "how can i": 1808,
    "can i contact": 1809,
    "i contact them": 1810,
    "contact them by": 1811,
    "them by phone": 1812,
    "please recommend": 1813,
    "1 in": 1814,
    "and i": 1815,
    "would also": 1816,
    "also like": 1817,
    "please recommend 1": 1818,
    "recommend 1 in": 1819,
    "1 in the": 1820,
    "centre and i": 1821,
    "and i would": 1822,
    "i would also": 1823,
    "would also like": 1824,
    "also like the": 1825,
    "like the phone": 1826,
    "i please": 1827,
    "please get": 1828,
    "get their": 1829,
    "sounds great can": 1830,
    "can i please": 1831,
    "i please get": 1832,
    "please get their": 1833,
    "get their phone": 1834,
    "would be all": 1835,
    "be all thank": 1836,
    "boating": 1837,
    "activities": 1838,
    "for boating": 1839,
    "boating activities": 1840,
    "activities in": 1841,
    "looking for boating": 1842,
    "for boating activities": 1843,
    "boating activities in": 1844,
    "activities in town": 1845,
    "preference": 1846,
    "i do": 1847,
    "do not": 1848,
    "not have": 1849,
    "a preference": 1850,
    "i do not": 1851,
    "do not have": 1852,
    "not have a": 1853,
    "have a preference": 1854,
    "riverboat": 1855,
    "georgina": 1856,
    "yes can": 1857,
    "the riverboat": 1858,
    "riverboat georgina": 1859,
    "georgina please": 1860,
    "yes can you": 1861,
    "the postcode for": 1862,
    "postcode for the": 1863,
    "for the riverboat": 1864,
    "the riverboat georgina": 1865,
    "riverboat georgina please": 1866,
    "that 'll": 1867,
    "'ll do": 1868,
    "do it": 1869,
    "no that 'll": 1870,
    "that 'll do": 1871,
    "'ll do it": 1872,
    "do it for": 1873,
    "today thanks very": 1874,
    "very much for": 1875,
    "care": 1876,
    "mind": 1877,
    "doing": 1878,
    "walking": 1879,
    "not care": 1880,
    "care which": 1881,
    "which part": 1882,
    "town it": 1883,
    "is in": 1884,
    "in i": 1885,
    "not mind": 1886,
    "mind doing": 1887,
    "doing some": 1888,
    "some walking": 1889,
    "do not care": 1890,
    "not care which": 1891,
    "care which part": 1892,
    "which part of": 1893,
    "of town it": 1894,
    "town it is": 1895,
    "it is in": 1896,
    "is in i": 1897,
    "in i do": 1898,
    "do not mind": 1899,
    "not mind doing": 1900,
    "mind doing some": 1901,
    "doing some walking": 1902,
    "interesting": 1903,
    "post": 1904,
    "code": 1905,
    "sounds interesting": 1906,
    "interesting what": 1907,
    "the post": 1908,
    "post code": 1909,
    "that sounds interesting": 1910,
    "sounds interesting what": 1911,
    "interesting what is": 1912,
    "is the post": 1913,
    "the post code": 1914,
    "that 'll be": 1915,
    "'ll be all": 1916,
    "number type": 1917,
    "and fee": 1918,
    "fee for": 1919,
    "favorite place": 1920,
    "particular what is": 1921,
    "phone number type": 1922,
    "number type and": 1923,
    "type and fee": 1924,
    "and fee for": 1925,
    "fee for your": 1926,
    "for your favorite": 1927,
    "your favorite place": 1928,
    "to be": 1929,
    "be in": 1930,
    "the attraction to": 1931,
    "attraction to be": 1932,
    "to be in": 1933,
    "be in the": 1934,
    "anything that": 1935,
    "is good": 1936,
    "good just": 1937,
    "just recommend": 1938,
    "anything that is": 1939,
    "that is good": 1940,
    "is good just": 1941,
    "good just recommend": 1942,
    "just recommend any": 1943,
    "may i have": 1944,
    "much that would": 1945,
    "assistance": 1946,
    "i will": 1947,
    "will and": 1948,
    "and thank": 1949,
    "your assistance": 1950,
    "i will and": 1951,
    "will and thank": 1952,
    "and thank you": 1953,
    "you for your": 1954,
    "for your assistance": 1955,
    "on museums": 1956,
    "museums in": 1957,
    "information on museums": 1958,
    "on museums in": 1959,
    "museums in town": 1960,
    "check": 1961,
    "favorite get": 1962,
    "get me": 1963,
    "'ll check": 1964,
    "check them": 1965,
    "them out": 1966,
    "your favorite get": 1967,
    "favorite get me": 1968,
    "get me their": 1969,
    "number and i": 1970,
    "and i 'll": 1971,
    "i 'll check": 1972,
    "'ll check them": 1973,
    "check them out": 1974,
    "other": 1975,
    "option": 1976,
    "maybe you": 1977,
    "could give": 1978,
    "1 other": 1979,
    "other option": 1980,
    "maybe you could": 1981,
    "you could give": 1982,
    "could give me": 1983,
    "give me 1": 1984,
    "me 1 other": 1985,
    "1 other option": 1986,
    "finding": 1987,
    "need help": 1988,
    "help finding": 1989,
    "finding a": 1990,
    "yes i need": 1991,
    "i need help": 1992,
    "need help finding": 1993,
    "help finding a": 1994,
    "finding a place": 1995,
    "but": 1996,
    "matter but": 1997,
    "but i": 1998,
    "the area does": 1999,
    "not matter but": 2000,
    "matter but i": 2001,
    "but i would": 2002,
    "like to find": 2003,
    "well at": 2004,
    "at the": 2005,
    "could you tell": 2006,
    "as well at": 2007,
    "well at the": 2008,
    "at the entrance": 2009,
    "was all thank": 2010,
    "milton": 2011,
    "country": 2012,
    "park": 2013,
    "like info": 2014,
    "on milton": 2015,
    "milton country": 2016,
    "country park": 2017,
    "would like info": 2018,
    "like info on": 2019,
    "info on milton": 2020,
    "on milton country": 2021,
    "milton country park": 2022,
