{
  "<none>": 0,
  "none": 1,
  "attraction-inform(choice)": 2,
  "attraction-request(area)": 3,
  "attraction-request(type)": 4,
  "attraction-nooffer(none)": 5,
  "attraction-recommend(name)": 6,
  "attraction-inform(post)": 7,
  "attraction-inform(phone)": 8,
  "attraction-inform(fee)": 9,
  "attraction-inform(name)": 10,
  "booking-inform(none)": 11,
  "attraction-inform(area)": 12,
  "attraction-inform(type)": 13,
  "general-reqmore(none)": 14,
  "attraction-inform(addr)": 15,
  "attraction-inform(price)": 16,
  "attraction-nooffer(area)": 17,
  "attraction-nooffer(type)": 18,
  "attraction-select(name)": 19,
  "attraction-recommend(area)": 20,
  "attraction-recommend(type)": 21,
  "hotel-inform(none)": 22,
  "general-greet(none)": 23,
  "attraction-recommend(fee)": 24,
  "attraction-recommend(post)": 25,
  "attraction-recommend(addr)": 26,
  "attraction-select(type)": 27,
  "attraction-recommend(phone)": 28,
  "general-welcome(none)": 29,
  "restaurant-request(area)": 30,
  "restaurant-nooffer(area)": 31,
  "general-bye(none)": 32,
  "hotel-request(type)": 33,
  "hotel-inform(choice)": 34,
  "hotel-inform(area)": 35,
  "attraction-request(price)": 36,
  "attraction-select(fee)": 37,
  "attraction-select(none)": 38,
  "attraction-recommend(open)": 39,
  "attraction-request(name)": 40,
  "attraction-inform(open)": 41,
  "hotel-nooffer(none)": 42,
  "attraction-select(choice)": 43,
  "attraction-recommend(choice)": 44,
  "attraction-inform(none)": 45,
  "attraction-select(area)": 46,
  "attraction-recommend(price)": 47,
  "restaurant-inform(post)": 48,
  "taxi-request(depart)": 49,
  "hotel-inform(phone)": 50,
  "taxi-request(leave)": 51,
  "taxi-request(arrive)": 52,
  "hotel-request(area)": 53,
  "hotel-inform(price)": 54,
  "hotel-inform(parking)": 55,
  "booking-nobook(day)": 56,
  "booking-request(stay)": 57,
  "booking-request(day)": 58,
  "booking-book(ref)": 59,
  "booking-request(people)": 60,
  "hotel-request(price)": 61,
  "hotel-request(stars)": 62,
  "booking-book(name)": 63,
  "hotel-inform(name)": 64,
  "hotel-inform(addr)": 65,
  "booking-nobook(none)": 66,
  "hotel-select(price)": 67,
  "hotel-inform(stars)": 68,
  "booking-book(stay)": 69,
  "hotel-request(parking)": 70,
  "hotel-recommend(addr)": 71,
  "hotel-recommend(name)": 72,
  "hotel-inform(internet)": 73,
  "booking-book(day)": 74,
  "hotel-inform(type)": 75,
  "booking-request(time)": 76,
  "hotel-inform(post)": 77,
  "booking-nobook(name)": 78,
  "booking-inform(ref)": 79,
  "booking-inform(name)": 80,
  "hotel-select(none)": 81,
  "hotel-select(area)": 82,
  "hotel-recommend(stars)": 83,
  "hotel-recommend(area)": 84,
  "booking-book(people)": 85,
  "hotel-request(name)": 86,
  "hotel-request(internet)": 87,
  "hotel-nooffer(stars)": 88,
  "hotel-nooffer(type)": 89,
  "hotel-nooffer(internet)": 90,
  "hotel-select(type)": 91,
  "hotel-nooffer(area)": 92,
  "hotel-recommend(type)": 93,
  "hotel-recommend(price)": 94,
  "hotel-select(name)": 95,
  "hotel-inform(ref)": 96,
  "booking-nobook(stay)": 97,
  "hotel-nooffer(price)": 98,
  "hotel-nooffer(choice)": 99,
  "hotel-select(stars)": 100,
  "hotel-select(internet)": 101,
  "hotel-select(parking)": 102,
  "hotel-recommend(phone)": 103,
  "hotel-recommend(parking)": 104,
  "hotel-select(choice)": 105,
  "hotel-recommend(post)": 106,
  "hotel-nooffer(parking)": 107,
  "hotel-recommend(internet)": 108,
  "hotel-recommend(none)": 109,
  "booking-book(none)": 110,
  "booking-inform(people)": 111,
  "booking-inform(stay)": 112,
  "booking-inform(day)": 113,
  "booking-nobook(time)": 114,
  "restaurant-request(price)": 115,
  "restaurant-recommend(none)": 116,
  "restaurant-select(none)": 117,
  "restaurant-inform(name)": 118,
  "hotel-recommend(choice)": 119,
  "restaurant-recommend(name)": 120,
  "restaurant-inform(choice)": 121,
  "booking-book(time)": 122,
  "restaurant-inform(none)": 123,
  "restaurant-nooffer(price)": 124,
  "booking-nobook(people)": 125,
  "restaurant-inform(phone)": 126,
  "restaurant-inform(food)": 127,
  "restaurant-inform(price)": 128,
  "restaurant-inform(area)": 129,
  "restaurant-inform(addr)": 130,
  "restaurant-select(food)": 131,
  "restaurant-request(food)": 132,
  "restaurant-recommend(food)": 133,
  "restaurant-recommend(area)": 134,
  "restaurant-recommend(price)": 135,
  "restaurant-nooffer(none)": 136,
  "restaurant-nooffer(food)": 137,
  "restaurant-select(price)": 138,
  "restaurant-recommend(addr)": 139,
  "restaurant-inform(ref)": 140,
  "restaurant-select(name)": 141,
  "restaurant-recommend(choice)": 142,
  "restaurant-select(area)": 143,
  "restaurant-recommend(post)": 144,
  "restaurant-recommend(phone)": 145,
  "restaurant-select(addr)": 146,
  "restaurant-request(name)": 147,
  "booking-inform(time)": 148,
  "booking-nobook(ref)": 149,
  "restaurant-select(choice)": 150,
  "restaurant-nooffer(choice)": 151,
  "taxi-request(dest)": 152,
  "taxi-inform(car)": 153,
  "taxi-inform(phone)": 154,
  "taxi-inform(leave)": 155,
  "taxi-inform(arrive)": 156,
  "taxi-inform(none)": 157,
  "taxi-inform(depart)": 158,
  "taxi-inform(dest)": 159,
  "train-request(depart)": 160,
  "train-inform(depart)": 161,
  "train-inform(dest)": 162,
  "train-request(dest)": 163,
  "train-inform(choice)": 164,
  "train-request(arrive)": 165,
  "train-inform(id)": 166,
  "train-inform(leave)": 167,
  "train-request(leave)": 168,
  "train-request(day)": 169,
  "train-inform(arrive)": 170,
  "train-inform(day)": 171,
  "train-inform(ticket)": 172,
  "train-inform(time)": 173,
  "train-offerbook(none)": 174,
  "train-nooffer(none)": 175,
  "train-nooffer(day)": 176,
  "train-select(depart)": 177,
  "train-request(people)": 178,
  "train-offerbooked(ref)": 179,
  "train-offerbooked(ticket)": 180,
  "train-offerbooked(people)": 181,
  "train-offerbook(leave)": 182,
  "train-offerbook(id)": 183,
  "train-offerbook(day)": 184,
  "train-offerbook(depart)": 185,
  "train-offerbook(dest)": 186,
  "train-offerbook(arrive)": 187,
  "train-offerbook(ticket)": 188,
  "train-offerbooked(id)": 189,
  "train-offerbooked(leave)": 190,
  "train-offerbooked(dest)": 191,
  "train-offerbooked(arrive)": 192,
  "train-inform(ref)": 193,
  "train-select(none)": 194,
  "train-offerbooked(none)": 195,
  "train-offerbook(people)": 196,
  "train-select(choice)": 197,
  "train-offerbook(ref)": 198,
  "train-select(id)": 199,
  "train-select(leave)": 200,
  "train-inform(people)": 201,
  "train-select(arrive)": 202,
  "train-nooffer(dest)": 203,
  "train-select(day)": 204,
  "train-offerbooked(day)": 205,
  "train-offerbooked(time)": 206,
  "train-offerbooked(depart)": 207,
  "train-inform(none)": 208,
  "train-nooffer(leave)": 209,
  "train-nooffer(depart)": 210,
  "train-nooffer(arrive)": 211,
  "train-offerbook(time)": 212,
  "train-nooffer(id)": 213
}