{
  "none": 0,
  "attraction-inform(choice)": 1,
  "attraction-request(area)": 2,
  "attraction-request(type)": 3,
  "attraction-nooffer(none)": 4,
  "attraction-recommend(name)": 5,
  "attraction-inform(post)": 6,
  "attraction-inform(phone)": 7,
  "attraction-inform(fee)": 8,
  "attraction-inform(name)": 9,
  "booking-inform(none)": 10,
  "attraction-inform(area)": 11,
  "attraction-inform(type)": 12,
  "general-reqmore(none)": 13,
  "attraction-inform(addr)": 14,
  "attraction-inform(price)": 15,
  "attraction-nooffer(area)": 16,
  "attraction-nooffer(type)": 17,
  "attraction-select(name)": 18,
  "attraction-recommend(area)": 19,
  "attraction-recommend(type)": 20,
  "hotel-inform(none)": 21,
  "general-greet(none)": 22,
  "attraction-recommend(fee)": 23,
  "attraction-recommend(post)": 24,
  "attraction-recommend(addr)": 25,
  "attraction-select(type)": 26,
  "attraction-recommend(phone)": 27,
  "general-welcome(none)": 28,
  "restaurant-request(area)": 29,
  "restaurant-nooffer(area)": 30,
  "general-bye(none)": 31,
  "hotel-request(type)": 32,
  "hotel-inform(choice)": 33,
  "hotel-inform(area)": 34,
  "attraction-request(price)": 35,
  "attraction-select(fee)": 36,
  "attraction-select(none)": 37,
  "attraction-recommend(open)": 38,
  "attraction-request(name)": 39,
  "attraction-inform(open)": 40,
  "hotel-nooffer(none)": 41,
  "attraction-select(choice)": 42,
  "attraction-recommend(choice)": 43,
  "attraction-inform(none)": 44,
  "attraction-select(area)": 45,
  "attraction-recommend(price)": 46,
  "restaurant-inform(post)": 47,
  "taxi-request(depart)": 48,
  "hotel-inform(phone)": 49,
  "taxi-request(leave)": 50,
  "taxi-request(arrive)": 51,
  "hotel-request(area)": 52,
  "hotel-inform(price)": 53,
  "hotel-inform(parking)": 54,
  "booking-nobook(day)": 55,
  "booking-request(stay)": 56,
  "booking-request(day)": 57,
  "booking-book(ref)": 58,
  "booking-request(people)": 59,
  "hotel-request(price)": 60,
  "hotel-request(stars)": 61,
  "booking-book(name)": 62,
  "hotel-inform(name)": 63,
  "hotel-inform(addr)": 64,
  "booking-nobook(none)": 65,
  "hotel-select(price)": 66,
  "hotel-inform(stars)": 67,
  "booking-book(stay)": 68,
  "hotel-request(parking)": 69,
  "hotel-recommend(addr)": 70,
  "hotel-recommend(name)": 71,
  "hotel-inform(internet)": 72,
  "booking-book(day)": 73,
  "hotel-inform(type)": 74,
  "booking-request(time)": 75,
  "hotel-inform(post)": 76,
  "booking-nobook(name)": 77,
  "booking-inform(ref)": 78,
  "booking-inform(name)": 79,
  "hotel-select(none)": 80,
  "hotel-select(area)": 81,
  "hotel-recommend(stars)": 82,
  "hotel-recommend(area)": 83,
  "booking-book(people)": 84,
  "hotel-request(name)": 85,
  "hotel-request(internet)": 86,
  "hotel-nooffer(stars)": 87,
  "hotel-nooffer(type)": 88,
  "hotel-nooffer(internet)": 89,
  "hotel-select(type)": 90,
  "hotel-nooffer(area)": 91,
  "hotel-recommend(type)": 92,
  "hotel-recommend(price)": 93,
  "hotel-select(name)": 94,
  "hotel-inform(ref)": 95,
  "booking-nobook(stay)": 96,
  "hotel-nooffer(price)": 97,
  "hotel-nooffer(choice)": 98,
  "hotel-select(stars)": 99,
  "hotel-select(internet)": 100,
  "hotel-select(parking)": 101,
  "hotel-recommend(phone)": 102,
  "hotel-recommend(parking)": 103,
  "hotel-select(choice)": 104,
  "hotel-recommend(post)": 105,
  "hotel-nooffer(parking)": 106,
  "hotel-recommend(internet)": 107,
  "hotel-recommend(none)": 108,
  "booking-book(none)": 109,
  "booking-inform(people)": 110,
  "booking-inform(stay)": 111,
  "booking-inform(day)": 112,
  "booking-nobook(time)": 113,
  "restaurant-request(price)": 114,
  "restaurant-recommend(none)": 115,
  "restaurant-select(none)": 116,
  "restaurant-inform(name)": 117,
  "hotel-recommend(choice)": 118,
  "restaurant-recommend(name)": 119,
  "restaurant-inform(choice)": 120,
  "booking-book(time)": 121,
  "restaurant-inform(none)": 122,
  "restaurant-nooffer(price)": 123,
  "booking-nobook(people)": 124,
  "restaurant-inform(phone)": 125,
  "restaurant-inform(food)": 126,
  "restaurant-inform(price)": 127,
  "restaurant-inform(area)": 128,
  "restaurant-inform(addr)": 129,
  "restaurant-select(food)": 130,
  "restaurant-request(food)": 131,
  "restaurant-recommend(food)": 132,
  "restaurant-recommend(area)": 133,
  "restaurant-recommend(price)": 134,
  "restaurant-nooffer(none)": 135,
  "restaurant-nooffer(food)": 136,
  "restaurant-select(price)": 137,
  "restaurant-recommend(addr)": 138,
  "restaurant-inform(ref)": 139,
  "restaurant-select(name)": 140,
  "restaurant-recommend(choice)": 141,
  "restaurant-select(area)": 142,
  "restaurant-recommend(post)": 143,
  "restaurant-recommend(phone)": 144,
  "restaurant-select(addr)": 145,
  "restaurant-request(name)": 146,
  "booking-inform(time)": 147,
  "booking-nobook(ref)": 148,
  "restaurant-select(choice)": 149,
  "restaurant-nooffer(choice)": 150,
  "taxi-request(dest)": 151,
  "taxi-inform(car)": 152,
  "taxi-inform(phone)": 153,
  "taxi-inform(leave)": 154,
  "taxi-inform(arrive)": 155,
  "taxi-inform(none)": 156,
  "taxi-inform(depart)": 157,
  "taxi-inform(dest)": 158,
  "train-request(depart)": 159,
  "train-inform(depart)": 160,
  "train-inform(dest)": 161,
  "train-request(dest)": 162,
  "train-inform(choice)": 163,
  "train-request(arrive)": 164,
  "train-inform(id)": 165,
  "train-inform(leave)": 166,
  "train-request(leave)": 167,
  "train-request(day)": 168,
  "train-inform(arrive)": 169,
  "train-inform(day)": 170,
  "train-inform(ticket)": 171,
  "train-inform(time)": 172,
  "train-offerbook(none)": 173,
  "train-nooffer(none)": 174,
  "train-nooffer(day)": 175,
  "train-select(depart)": 176,
  "train-request(people)": 177,
  "train-offerbooked(ref)": 178,
  "train-offerbooked(ticket)": 179,
  "train-offerbooked(people)": 180,
  "train-offerbook(leave)": 181,
  "train-offerbook(id)": 182,
  "train-offerbook(day)": 183,
  "train-offerbook(depart)": 184,
  "train-offerbook(dest)": 185,
  "train-offerbook(arrive)": 186,
  "train-offerbook(ticket)": 187,
  "train-offerbooked(id)": 188,
  "train-offerbooked(leave)": 189,
  "train-offerbooked(dest)": 190,
  "train-offerbooked(arrive)": 191,
  "train-inform(ref)": 192,
  "train-select(none)": 193,
  "train-offerbooked(none)": 194,
  "train-offerbook(people)": 195,
  "train-select(choice)": 196,
  "train-offerbook(ref)": 197,
  "train-select(id)": 198,
  "train-select(leave)": 199,
  "train-inform(people)": 200,
  "train-select(arrive)": 201,
  "train-nooffer(dest)": 202,
  "train-select(day)": 203,
  "train-offerbooked(day)": 204,
  "train-offerbooked(time)": 205,
  "train-offerbooked(depart)": 206,
  "train-inform(none)": 207,
  "train-nooffer(leave)": 208,
  "train-nooffer(depart)": 209,
  "train-nooffer(arrive)": 210,
  "train-offerbook(time)": 211,
  "train-nooffer(id)": 212
}