{
  "3": {
    "<pad>": 0,
    "</s>": 1,
    "<s>": 2,
    "unk": 3,
    "<dontcare>": 4,
    "<none>": 5,
    "i": 6,
    "need": 7,
    "to": 8,
    "get": 9,
    "a": 10,
    "taxi": 11,
    "from": 12,
    "emmanuel": 13,
    "college": 14,
    "yes": 15,
    "no": 16,
    "dontcare": 17,
    "i need": 18,
    "need to": 19,
    "to get": 20,
    "get a": 21,
    "a taxi": 22,
    "taxi from": 23,
    "from emmanuel": 24,
    "emmanuel college": 25,
    "i need to": 26,
    "need to get": 27,
    "to get a": 28,
    "get a taxi": 29,
    "a taxi from": 30,
    "taxi from emmanuel": 31,
    "from emmanuel college": 32,
    "am": 33,
    "heading": 34,
    "finches": 35,
    "bed": 36,
    "and": 37,
    "breakfast": 38,
    ".": 39,
    "i am": 40,
    "am heading": 41,
    "heading to": 42,
    "to finches": 43,
    "finches bed": 44,
    "bed and": 45,
    "and breakfast": 46,
    "i am heading": 47,
    "am heading to": 48,
    "heading to finches": 49,
    "to finches bed": 50,
    "finches bed and": 51,
    "bed and breakfast": 52,
    "do": 53,
    "not": 54,
    "have": 55,
    "preference": 56,
    "but": 57,
    "would": 58,
    "like": 59,
    "arrive": 60,
    "by": 61,
    "22:30": 62,
    "i do": 63,
    "do not": 64,
    "not have": 65,
    "have a": 66,
    "a preference": 67,
    "preference but": 68,
    "but would": 69,
    "would like": 70,
    "like to": 71,
    "to arrive": 72,
    "arrive by": 73,
    "by 22:30": 74,
    "i do not": 75,
    "do not have": 76,
    "not have a": 77,
    "have a preference": 78,
    "a preference but": 79,
    "preference but would": 80,
    "but would like": 81,
    "would like to": 82,
    "like to arrive": 83,
    "to arrive by": 84,
    "arrive by 22:30": 85,
    "thank": 86,
    "you": 87,
    "no thank": 88,
    "thank you": 89,
    "no thank you": 90,
    "could": 91,
    "help": 92,
    "me": 93,
    "find": 94,
    "hotel": 95,
    "on": 96,
    "the": 97,
    "west": 98,
    "side": 99,
    "with": 100,
    "free": 101,
    "wifi": 102,
    "?": 103,
    "could you": 104,
    "you help": 105,
    "help me": 106,
    "me find": 107,
    "find a": 108,
    "a hotel": 109,
    "hotel on": 110,
    "on the": 111,
    "the west": 112,
    "west side": 113,
    "side with": 114,
    "with free": 115,
    "free wifi": 116,
    "could you help": 117,
    "you help me": 118,
    "help me find": 119,
    "me find a": 120,
    "find a hotel": 121,
    "a hotel on": 122,
    "hotel on the": 123,
    "on the west": 124,
    "the west side": 125,
    "west side with": 126,
    "side with free": 127,
    "with free wifi": 128,
    "price": 129,
    "does": 130,
    "matter": 131,
    ",": 132,
    "really": 133,
    "parking": 134,
    "too": 135,
    "in": 136,
    "addition": 137,
    "please": 138,
    "price does": 139,
    "does not": 140,
    "not matter": 141,
    "matter really": 142,
    "really but": 143,
    "but i": 144,
    "i would": 145,
    "get free": 146,
    "free parking": 147,
    "parking too": 148,
    "too in": 149,
    "in addition": 150,
    "addition to": 151,
    "to the": 152,
    "the wifi": 153,
    "wifi please": 154,
    "price does not": 155,
    "does not matter": 156,
    "not matter really": 157,
    "matter really but": 158,
    "really but i": 159,
    "but i would": 160,
    "i would like": 161,
    "like to get": 162,
    "to get free": 163,
    "get free parking": 164,
    "free parking too": 165,
    "parking too in": 166,
    "too in addition": 167,
    "in addition to": 168,
    "addition to the": 169,
    "to the wifi": 170,
    "the wifi please": 171,
    "is": 172,
    "that": 173,
    "guesthouse": 174,
    "is that": 175,
    "that a": 176,
    "hotel i": 177,
    "need a": 178,
    "hotel and": 179,
    "and not": 180,
    "not a": 181,
    "a guesthouse": 182,
    "is that a": 183,
    "that a hotel": 184,
    "a hotel i": 185,
    "hotel i need": 186,
    "i need a": 187,
    "need a hotel": 188,
    "a hotel and": 189,
    "hotel and not": 190,
    "and not a": 191,
    "not a guesthouse": 192,
    "be": 193,
    "great": 194,
    "thanks": 195,
    "we": 196,
    "'ll": 197,
    "arriving": 198,
    "sunday": 199,
    "that would": 200,
    "would be": 201,
    "be great": 202,
    "great thanks": 203,
    "thanks we": 204,
    "we 'll": 205,
    "'ll be": 206,
    "be arriving": 207,
    "arriving on": 208,
    "on sunday": 209,
    "that would be": 210,
    "would be great": 211,
    "be great thanks": 212,
    "great thanks we": 213,
    "thanks we 'll": 214,
    "we 'll be": 215,
    "'ll be arriving": 216,
    "be arriving on": 217,
    "arriving on sunday": 218,
    "6": 219,
    "people": 220,
    "for": 221,
    "4": 222,
    "nights": 223,
    "6 people": 224,
    "people for": 225,
    "for 4": 226,
    "4 nights": 227,
    "6 people for": 228,
    "people for 4": 229,
    "for 4 nights": 230,
    "how": 231,
    "about": 232,
    "2": 233,
    "how about": 234,
    "about 2": 235,
    "2 nights": 236,
    "how about 2": 237,
    "about 2 nights": 238,
    "so": 239,
    "much": 240,
    "it": 241,
    "today": 242,
    "goodbye": 243,
    "thanks so": 244,
    "so much": 245,
    "much that": 246,
    "that is": 247,
    "is it": 248,
    "it for": 249,
    "for today": 250,
    "today goodbye": 251,
    "thanks so much": 252,
    "so much that": 253,
    "much that is": 254,
    "that is it": 255,
    "is it for": 256,
    "it for today": 257,
    "for today goodbye": 258,
    "looking": 259,
    "guest": 260,
    "house": 261,
    "offers": 262,
    "am looking": 263,
    "looking for": 264,
    "for a": 265,
    "a guest": 266,
    "guest house": 267,
    "house that": 268,
    "that offers": 269,
    "offers free": 270,
    "i am looking": 271,
    "am looking for": 272,
    "looking for a": 273,
    "for a guest": 274,
    "a guest house": 275,
    "guest house that": 276,
    "house that offers": 277,
    "that offers free": 278,
    "offers free parking": 279,
    "sure": 280,
    "south": 281,
    "expensive": 282,
    "range": 283,
    "sure i": 284,
    "like it": 285,
    "it to": 286,
    "to be": 287,
    "be in": 288,
    "in the": 289,
    "the south": 290,
    "south and": 291,
    "and in": 292,
    "the expensive": 293,
    "expensive price": 294,
    "price range": 295,
    "sure i would": 296,
    "would like it": 297,
    "like it to": 298,
    "it to be": 299,
    "to be in": 300,
    "be in the": 301,
    "in the south": 302,
    "the south and": 303,
    "south and in": 304,
    "and in the": 305,
    "in the expensive": 306,
    "the expensive price": 307,
    "expensive price range": 308,
    "will": 309,
    "take": 310,
    "moderate": 311,
    "then": 312,
    "i will": 313,
    "will take": 314,
    "take a": 315,
    "a moderate": 316,
    "moderate guest": 317,
    "house with": 318,
    "with parking": 319,
    "parking then": 320,
    "i will take": 321,
    "will take a": 322,
    "take a moderate": 323,
    "a moderate guest": 324,
    "moderate guest house": 325,
    "guest house with": 326,
    "house with parking": 327,
    "with parking then": 328,
    "5": 329,
    "starting": 330,
    "monday": 331,
    "yes 5": 332,
    "5 people": 333,
    "people 4": 334,
    "nights starting": 335,
    "starting from": 336,
    "from monday": 337,
    "monday on": 338,
    "yes 5 people": 339,
    "5 people 4": 340,
    "people 4 nights": 341,
    "4 nights starting": 342,
    "nights starting from": 343,
    "starting from monday": 344,
    "from monday on": 345,
    "all": 346,
    "you that": 347,
    "is all": 348,
    "thank you that": 349,
    "you that is": 350,
    "that is all": 351,
    "nearby": 352,
    "museums": 353,
    "for nearby": 354,
    "nearby museums": 355,
    "looking for nearby": 356,
    "for nearby museums": 357,
    "particular": 358,
    "area": 359,
    "may": 360,
    "phone": 361,
    "number": 362,
    "of": 363,
    "1": 364,
    "recommend": 365,
    "no particular": 366,
    "particular area": 367,
    "area may": 368,
    "may i": 369,
    "i have": 370,
    "have the": 371,
    "the phone": 372,
    "phone number": 373,
    "number of": 374,
    "of 1": 375,
    "1 you": 376,
    "you recommend": 377,
    "no particular area": 378,
    "particular area may": 379,
    "area may i": 380,
    "may i have": 381,
    "i have the": 382,
    "have the phone": 383,
    "the phone number": 384,
    "phone number of": 385,
    "number of 1": 386,
    "of 1 you": 387,
    "1 you recommend": 388,
    "sounds": 389,
    "good": 390,
    "what": 391,
    "their": 392,
    "that sounds": 393,
    "sounds good": 394,
    "good what": 395,
    "what is": 396,
    "is their": 397,
    "their phone": 398,
    "that sounds good": 399,
    "sounds good what": 400,
    "good what is": 401,
    "what is their": 402,
    "is their phone": 403,
    "their phone number": 404,
    "your": 405,
    "be it": 406,
    "it thank": 407,
    "you for": 408,
    "for all": 409,
    "all your": 410,
    "your help": 411,
    "would be it": 412,
    "be it thank": 413,
    "it thank you": 414,
    "thank you for": 415,
    "you for all": 416,
    "for all your": 417,
    "all your help": 418,
    "book": 419,
    "leave": 420,
    "after": 421,
    "11:00": 422,
    "going": 423,
    "arbury": 424,
    "lodge": 425,
    "to book": 426,
    "book a": 427,
    "taxi to": 428,
    "to leave": 429,
    "leave after": 430,
    "after 11:00": 431,
    "11:00 going": 432,
    "going to": 433,
    "to arbury": 434,
    "arbury lodge": 435,
    "lodge guesthouse": 436,
    "like to book": 437,
    "to book a": 438,
    "book a taxi": 439,
    "a taxi to": 440,
    "taxi to leave": 441,
    "to leave after": 442,
    "leave after 11:00": 443,
    "after 11:00 going": 444,
    "11:00 going to": 445,
    "going to arbury": 446,
    "to arbury lodge": 447,
    "arbury lodge guesthouse": 448,
    "gardenia": 449,
    "from the": 450,
    "the gardenia": 451,
    "from the gardenia": 452,
    "!": 453,
    "great thank": 454,
    "for your": 455,
    "great thank you": 456,
    "you for your": 457,
    "for your help": 458,
    "no that": 459,
    "that will": 460,
    "will be": 461,
    "be all": 462,
    "all for": 463,
    "today thank": 464,
    "no that will": 465,
    "that will be": 466,
    "will be all": 467,
    "be all for": 468,
    "all for today": 469,
    "for today thank": 470,
    "today thank you": 471,
    "hello": 472,
    "place": 473,
    "go": 474,
    "can": 475,
    "hello i": 476,
    "a place": 477,
    "place to": 478,
    "to go": 479,
    "go can": 480,
    "can you": 481,
    "hello i am": 482,
    "for a place": 483,
    "a place to": 484,
    "place to go": 485,
    "to go can": 486,
    "go can you": 487,
    "can you help": 488,
    "attraction": 489,
    "types": 490,
    "what attraction": 491,
    "attraction types": 492,
    "types do": 493,
    "do you": 494,
    "you have": 495,
    "have in": 496,
    "what attraction types": 497,
    "attraction types do": 498,
    "types do you": 499,
    "do you have": 500,
    "you have in": 501,
    "have in the": 502,
    "in the west": 503,
    "give": 504,
    "address": 505,
    "type": 506,
    "sure can": 507,
    "recommend 1": 508,
    "1 to": 509,
    "to me": 510,
    "me and": 511,
    "and give": 512,
    "give me": 513,
    "me the": 514,
    "the address": 515,
    "address and": 516,
    "and type": 517,
    "sure can you": 518,
    "can you recommend": 519,
    "you recommend 1": 520,
    "recommend 1 to": 521,
    "1 to me": 522,
    "to me and": 523,
    "me and give": 524,
    "and give me": 525,
    "give me the": 526,
    "me the address": 527,
    "the address and": 528,
    "address and type": 529,
    "all of": 530,
    "of your": 531,
    "for all of": 532,
    "all of your": 533,
    "of your help": 534,
    "helped": 535,
    "needed": 536,
    "have helped": 537,
    "helped with": 538,
    "with what": 539,
    "what i": 540,
    "i needed": 541,
    "needed thank": 542,
    "you goodbye": 543,
    "you have helped": 544,
    "have helped with": 545,
    "helped with what": 546,
    "with what i": 547,
    "what i needed": 548,
    "i needed thank": 549,
    "needed thank you": 550,
    "thank you goodbye": 551,
    "stay": 552,
    "also": 553,
    "an": 554,
    "added": 555,
    "advantage": 556,
    "that i": 557,
    "i can": 558,
    "can stay": 559,
    "stay in": 560,
    "in free": 561,
    "parking is": 562,
    "is also": 563,
    "also an": 564,
    "an added": 565,
    "added advantage": 566,
    "house that i": 567,
    "that i can": 568,
    "i can stay": 569,
    "can stay in": 570,
    "stay in free": 571,
    "in free parking": 572,
    "free parking is": 573,
    "parking is also": 574,
    "is also an": 575,
    "also an added": 576,
    "an added advantage": 577,
    "20184": 578,
    "10": 579,
    "2018": 580,
    "4 and": 581,
    "and 5": 582,
    "5 and": 583,
    "and 20184": 584,
    "20184 and": 585,
    "and 10": 586,
    "10 and": 587,
    "and 2018": 588,
    "4 and 5": 589,
    "and 5 and": 590,
    "5 and 20184": 591,
    "and 20184 and": 592,
    "20184 and 10": 593,
    "and 10 and": 594,
    "10 and 2018": 595,
    "something": 596,
    "internet": 597,
    "for something": 598,
    "something in": 599,
    "the moderate": 600,
    "moderate price": 601,
    "range and": 602,
    "and free": 603,
    "free internet": 604,
    "internet please": 605,
    "looking for something": 606,
    "for something in": 607,
    "something in the": 608,
    "in the moderate": 609,
    "the moderate price": 610,
    "moderate price range": 611,
    "price range and": 612,
    "range and free": 613,
    "and free internet": 614,
    "free internet please": 615,
    "perfect": 616,
    "star": 617,
    "perfect what": 618,
    "is the": 619,
    "the star": 620,
    "star and": 621,
    "and area": 622,
    "area of": 623,
    "of the": 624,
    "the hotel": 625,
    "perfect what is": 626,
    "what is the": 627,
    "is the star": 628,
    "the star and": 629,
    "star and area": 630,
    "and area of": 631,
    "area of the": 632,
    "of the hotel": 633,
    "necessary": 634,
    "information": 635,
    "now": 636,
    "will not": 637,
    "not be": 638,
    "be necessary": 639,
    "necessary i": 640,
    "have all": 641,
    "the information": 642,
    "information i": 643,
    "need for": 644,
    "for now": 645,
    "now thanks": 646,
    "that will not": 647,
    "will not be": 648,
    "not be necessary": 649,
    "be necessary i": 650,
    "necessary i have": 651,
    "i have all": 652,
    "have all of": 653,
    "all of the": 654,
    "of the information": 655,
    "the information i": 656,
    "information i need": 657,
    "i need for": 658,
    "need for now": 659,
    "for now thanks": 660,
    "bridge": 661,
    "the bridge": 662,
    "bridge guest": 663,
    "house please": 664,
    "need to book": 665,
    "taxi to the": 666,
    "to the bridge": 667,
    "the bridge guest": 668,
    "bridge guest house": 669,
    "guest house please": 670,
    "arrival": 671,
    "just": 672,
    "19:15": 673,
    "ashley": 674,
    "want": 675,
    "arrival does": 676,
    "matter i": 677,
    "i just": 678,
    "just need": 679,
    "after 19:15": 680,
    "19:15 from": 681,
    "from ashley": 682,
    "ashley hotel": 683,
    "and i": 684,
    "i want": 685,
    "want to": 686,
    "go to": 687,
    "to bridge": 688,
    "arrival does not": 689,
    "not matter i": 690,
    "matter i just": 691,
    "i just need": 692,
    "just need to": 693,
    "need to leave": 694,
    "leave after 19:15": 695,
    "after 19:15 from": 696,
    "19:15 from ashley": 697,
    "from ashley hotel": 698,
    "ashley hotel and": 699,
    "hotel and i": 700,
    "and i want": 701,
    "i want to": 702,
    "want to go": 703,
    "to go to": 704,
    "go to bridge": 705,
    "to bridge guest": 706,
    "leaving": 707,
    "am leaving": 708,
    "leaving from": 709,
    "i am leaving": 710,
    "am leaving from": 711,
    "leaving from ashley": 712,
    "thanks that": 713,
    "all i": 714,
    "thanks that is": 715,
    "is all i": 716,
    "all i need": 717,
    "cheap": 718,
    "restaurant": 719,
    "serving": 720,
    "italian": 721,
    "food": 722,
    "to find": 723,
    "a cheap": 724,
    "cheap restaurant": 725,
    "restaurant serving": 726,
    "serving italian": 727,
    "italian food": 728,
    "food what": 729,
    "and phone": 730,
    "want to find": 731,
    "to find a": 732,
    "find a cheap": 733,
    "a cheap restaurant": 734,
    "cheap restaurant serving": 735,
    "restaurant serving italian": 736,
    "serving italian food": 737,
    "italian food what": 738,
    "food what is": 739,
    "is the address": 740,
    "address and phone": 741,
    "and phone number": 742,
    "that does": 743,
    "no that does": 744,
    "that does not": 745,
    "the food": 746,
    "food type": 747,
    "type of": 748,
    "of that": 749,
    "that restaurant": 750,
    "is the food": 751,
    "the food type": 752,
    "food type of": 753,
    "type of that": 754,
    "of that restaurant": 755,
    "check": 756,
    "out": 757,
    "you i": 758,
    "i 'll": 759,
    "'ll check": 760,
    "check it": 761,
    "it out": 762,
    "thank you i": 763,
    "you i 'll": 764,
    "i 'll check": 765,
    "'ll check it": 766,
    "check it out": 767,
    "mediterranean": 768,
    "find an": 769,
    "an expensive": 770,
    "expensive restaurant": 771,
    "serving mediterranean": 772,
    "mediterranean food": 773,
    "to find an": 774,
    "find an expensive": 775,
    "an expensive restaurant": 776,
    "expensive restaurant serving": 777,
    "restaurant serving mediterranean": 778,
    "serving mediterranean food": 779,
    "mediterranean food what": 780,
    "their address": 781,
    "is their address": 782,
    "their address and": 783,
    "hey": 784,
    "trying": 785,
    "called": 786,
    "taj": 787,
    "tandoori": 788,
    "know": 789,
    "hey i": 790,
    "am trying": 791,
    "trying to": 792,
    "a restaurant": 793,
    "restaurant called": 794,
    "called taj": 795,
    "taj tandoori": 796,
    "tandoori what": 797,
    "what do": 798,
    "you know": 799,
    "know about": 800,
    "about that": 801,
    "hey i am": 802,
    "i am trying": 803,
    "am trying to": 804,
    "trying to find": 805,
    "find a restaurant": 806,
    "a restaurant called": 807,
    "restaurant called taj": 808,
    "called taj tandoori": 809,
    "taj tandoori what": 810,
    "tandoori what do": 811,
    "what do you": 812,
    "do you know": 813,
    "you know about": 814,
    "know about that": 815,
    "reservation": 816,
    "at": 817,
    "15:00": 818,
    "tuesday": 819,
    "yes please": 820,
    "please i": 821,
    "like a": 822,
    "a reservation": 823,
    "reservation for": 824,
    "4 people": 825,
    "people at": 826,
    "at 15:00": 827,
    "15:00 on": 828,
    "on tuesday": 829,
    "yes please i": 830,
    "please i would": 831,
    "would like a": 832,
    "like a reservation": 833,
    "a reservation for": 834,
    "reservation for 4": 835,
    "for 4 people": 836,
    "4 people at": 837,
    "people at 15:00": 838,
    "at 15:00 on": 839,
    "15:00 on tuesday": 840,
    "if": 841,
    "similar": 842,
    "please if": 843,
    "if you": 844,
    "you could": 845,
    "could find": 846,
    "find 1": 847,
    "1 similar": 848,
    "similar to": 849,
    "to taj": 850,
    "tandoori that": 851,
    "be perfect": 852,
    "yes please if": 853,
    "please if you": 854,
    "if you could": 855,
    "you could find": 856,
    "could find 1": 857,
    "find 1 similar": 858,
    "1 similar to": 859,
    "similar to taj": 860,
    "to taj tandoori": 861,
    "taj tandoori that": 862,
    "tandoori that would": 863,
    "would be perfect": 864,
    "let": 865,
    "'s": 866,
    "try": 867,
    "keep": 868,
    "same": 869,
    "sure but": 870,
    "but let": 871,
    "let 's": 872,
    "'s try": 873,
    "try to": 874,
    "to keep": 875,
    "keep it": 876,
    "it in": 877,
    "the same": 878,
    "same area": 879,
    "area and": 880,
    "and price": 881,
    "range please": 882,
    "sure but let": 883,
    "but let 's": 884,
    "let 's try": 885,
    "'s try to": 886,
    "try to keep": 887,
    "to keep it": 888,
    "keep it in": 889,
    "it in the": 890,
    "in the same": 891,
    "the same area": 892,
    "same area and": 893,
    "area and price": 894,
    "and price range": 895,
    "price range please": 896,
    "okay": 897,
    "moment": 898,
    "okay that": 899,
    "need at": 900,
    "at the": 901,
    "the moment": 902,
    "okay that is": 903,
    "i need at": 904,
    "need at the": 905,
    "at the moment": 906,
    "cheap place": 907,
    "to stay": 908,
    "need a cheap": 909,
    "a cheap place": 910,
    "cheap place to": 911,
    "place to stay": 912,
    "should": 913,
    "include": 914,
    "it should": 915,
    "should include": 916,
    "include free": 917,
    "parking the": 918,
    "hotel should": 919,
    "it should include": 920,
    "should include free": 921,
    "include free parking": 922,
    "free parking the": 923,
    "parking the hotel": 924,
    "the hotel should": 925,
    "hotel should include": 926,
    "include free wifi": 927,
    "whichever": 928,
    "cheapest": 929,
    "thursday": 930,
    "reference": 931,
    "whichever is": 932,
    "the cheapest": 933,
    "cheapest for": 934,
    "for 2": 935,
    "2 people": 936,
    "people 5": 937,
    "5 nights": 938,
    "starting thursday": 939,
    "thursday please": 940,
    "please book": 941,
    "book it": 942,
    "it and": 943,
    "will need": 944,
    "a reference": 945,
    "reference number": 946,
    "number thanks": 947,
    "whichever is the": 948,
    "is the cheapest": 949,
    "the cheapest for": 950,
    "cheapest for 2": 951,
    "for 2 people": 952,
    "2 people 5": 953,
    "people 5 nights": 954,
    "5 nights starting": 955,
    "nights starting thursday": 956,
    "starting thursday please": 957,
    "thursday please book": 958,
    "please book it": 959,
    "book it and": 960,
    "it and i": 961,
    "and i will": 962,
    "i will need": 963,
    "will need a": 964,
    "need a reference": 965,
    "a reference number": 966,
    "reference number thanks": 967,
    "confirm": 968,
    "this": 969,
    "-s": 970,
    "just want": 971,
    "to confirm": 972,
    "confirm that": 973,
    "that this": 974,
    "this hotel": 975,
    "hotel include": 976,
    "include -s": 977,
    "-s free": 978,
    "parking and": 979,
    "and wifi": 980,
    "you i just": 981,
    "i just want": 982,
    "just want to": 983,
    "want to confirm": 984,
    "to confirm that": 985,
    "confirm that this": 986,
    "that this hotel": 987,
    "this hotel include": 988,
    "hotel include -s": 989,
    "include -s free": 990,
    "-s free parking": 991,
    "free parking and": 992,
    "parking and wifi": 993,
    "all goodbye": 994,
    "thanks that will": 995,
    "be all goodbye": 996,
    "eat": 997,
    "centre": 998,
    "serves": 999,
    "chinese": 1000,
    "to eat": 1001,
    "eat in": 1002,
    "the centre": 1003,
    "centre that": 1004,
    "that serves": 1005,
    "serves chinese": 1006,
    "chinese food": 1007,
    "place to eat": 1008,
    "to eat in": 1009,
    "eat in the": 1010,
    "in the centre": 1011,
    "the centre that": 1012,
    "centre that serves": 1013,
    "that serves chinese": 1014,
    "serves chinese food": 1015,
    "postcode": 1016,
    "am not": 1017,
    "not particular": 1018,
    "particular how": 1019,
    "about moderate": 1020,
    "moderate i": 1021,
    "need their": 1022,
    "number address": 1023,
    "and postcode": 1024,
    "postcode please": 1025,
    "i am not": 1026,
    "am not particular": 1027,
    "not particular how": 1028,
    "particular how about": 1029,
    "how about moderate": 1030,
    "about moderate i": 1031,
    "moderate i will": 1032,
    "will need their": 1033,
    "need their phone": 1034,
    "phone number address": 1035,
    "number address and": 1036,
    "address and postcode": 1037,
    "and postcode please": 1038,
    "wonderful": 1039,
    "wonderful that": 1040,
    "to know": 1041,
    "know thanks": 1042,
    "wonderful that is": 1043,
    "need to know": 1044,
    "to know thanks": 1045,
    "north": 1046,
    "part": 1047,
    "town": 1048,
    "medium": 1049,
    "restaurant in": 1050,
    "the north": 1051,
    "north part": 1052,
    "part of": 1053,
    "of town": 1054,
    "town that": 1055,
    "is in": 1056,
    "the medium": 1057,
    "medium price": 1058,
    "like a restaurant": 1059,
    "a restaurant in": 1060,
    "restaurant in the": 1061,
    "in the north": 1062,
    "the north part": 1063,
    "north part of": 1064,
    "part of town": 1065,
    "of town that": 1066,
    "town that is": 1067,
    "that is in": 1068,
    "is in the": 1069,
    "in the medium": 1070,
    "the medium price": 1071,
    "medium price range": 1072,
    "care": 1073,
    "not care": 1074,
    "do not care": 1075,
    "there": 1076,
    "another": 1077,
    "as": 1078,
    "well": 1079,
    "is there": 1080,
    "there another": 1081,
    "another 1": 1082,
    "1 as": 1083,
    "as well": 1084,
    "is there another": 1085,
    "there another 1": 1086,
    "another 1 as": 1087,
    "1 as well": 1088,
    "nirala": 1089,
    "yes could": 1090,
    "you give": 1091,
    "number for": 1092,
    "for the": 1093,
    "the nirala": 1094,
    "yes could you": 1095,
    "could you give": 1096,
    "you give me": 1097,
    "me the phone": 1098,
    "phone number for": 1099,
    "number for the": 1100,
    "for the nirala": 1101,
    "which": 1102,
    "which part": 1103,
    "town it": 1104,
    "it is": 1105,
    "which part of": 1106,
    "of town it": 1107,
    "town it is": 1108,
    "it is in": 1109,
    "hoping": 1110,
    "am hoping": 1111,
    "hoping to": 1112,
    "i am hoping": 1113,
    "am hoping to": 1114,
    "hoping to find": 1115,
    "cheap restaurant in": 1116,
    "love": 1117,
    "some": 1118,
    "indian": 1119,
    "would love": 1120,
    "love to": 1121,
    "to have": 1122,
    "have some": 1123,
    "some indian": 1124,
    "indian food": 1125,
    "food please": 1126,
    "i would love": 1127,
    "would love to": 1128,
    "love to have": 1129,
    "to have some": 1130,
    "have some indian": 1131,
    "some indian food": 1132,
    "indian food please": 1133,
    "see": 1134,
    "any": 1135,
    "those": 1136,
    "are": 1137,
    "available": 1138,
    "wednesday": 1139,
    "14:45": 1140,
    "would you": 1141,
    "you see": 1142,
    "see if": 1143,
    "if any": 1144,
    "any of": 1145,
    "of those": 1146,
    "those are": 1147,
    "are available": 1148,
    "available on": 1149,
    "on wednesday": 1150,
    "wednesday at": 1151,
    "at 14:45": 1152,
    "14:45 for": 1153,
    "for 5": 1154,
    "people thanks": 1155,
    "would you see": 1156,
    "you see if": 1157,
    "see if any": 1158,
    "if any of": 1159,
    "any of those": 1160,
    "of those are": 1161,
    "those are available": 1162,
    "are available on": 1163,
    "available on wednesday": 1164,
    "on wednesday at": 1165,
    "wednesday at 14:45": 1166,
    "at 14:45 for": 1167,
    "14:45 for 5": 1168,
    "for 5 people": 1169,
    "5 people thanks": 1170,
    "nothing": 1171,
    "else": 1172,
    "you there": 1173,
    "there will": 1174,
    "be nothing": 1175,
    "nothing else": 1176,
    "else goodbye": 1177,
    "thank you there": 1178,
    "you there will": 1179,
    "there will be": 1180,
    "will be nothing": 1181,
    "be nothing else": 1182,
    "nothing else goodbye": 1183,
    "oak": 1184,
    "bistro": 1185,
    "me get": 1186,
    "the oak": 1187,
    "oak bistro": 1188,
    "help me get": 1189,
    "me get a": 1190,
    "to the oak": 1191,
    "the oak bistro": 1192,
    "06:00": 1193,
    "care about": 1194,
    "by 06:00": 1195,
    "06:00 please": 1196,
    "not care about": 1197,
    "care about that": 1198,
    "about that i": 1199,
    "that i just": 1200,
    "need to arrive": 1201,
    "arrive by 06:00": 1202,
    "by 06:00 please": 1203,
    "pizza": 1204,
    "hut": 1205,
    "city": 1206,
    "car": 1207,
    "contact": 1208,
    "pizza hut": 1209,
    "hut city": 1210,
    "city centre": 1211,
    "centre and": 1212,
    "need car": 1213,
    "car type": 1214,
    "type and": 1215,
    "and contact": 1216,
    "contact number": 1217,
    "pizza hut city": 1218,
    "hut city centre": 1219,
    "city centre and": 1220,
    "centre and i": 1221,
    "and i need": 1222,
    "i need car": 1223,
    "need car type": 1224,
    "car type and": 1225,
    "type and contact": 1226,
    "and contact number": 1227,
    "thai": 1228,
    "a good": 1229,
    "good thai": 1230,
    "thai restaurant": 1231,
    "find a good": 1232,
    "a good thai": 1233,
    "good thai restaurant": 1234,
    "thai restaurant in": 1235,
    "yes that": 1236,
    "yes that would": 1237,
    "12:45": 1238,
    "7": 1239,
    "thursday at": 1240,
    "at 12:45": 1241,
    "12:45 for": 1242,
    "for 7": 1243,
    "7 people": 1244,
    "thursday at 12:45": 1245,
    "at 12:45 for": 1246,
    "12:45 for 7": 1247,
    "for 7 people": 1248,
    "service": 1249,
    "your service": 1250,
    "for your service": 1251,
    "no the": 1252,
    "the reservation": 1253,
    "reservation is": 1254,
    "no the reservation": 1255,
    "the reservation is": 1256,
    "reservation is all": 1257,
    "is all goodbye": 1258,
    "for a cheap": 1259,
    "da": 1260,
    "vinci": 1261,
    "pizzeria": 1262,
    "da vinci": 1263,
    "vinci pizzeria": 1264,
    "pizzeria serves": 1265,
    "serves italian": 1266,
    "food it": 1267,
    "da vinci pizzeria": 1268,
    "vinci pizzeria serves": 1269,
    "pizzeria serves italian": 1270,
    "serves italian food": 1271,
    "italian food it": 1272,
    "food it is": 1273,
    "course": 1274,
    "of course": 1275,
    "restaurant on": 1276,
    "south side": 1277,
    "side please": 1278,
    "restaurant on the": 1279,
    "on the south": 1280,
    "the south side": 1281,
    "south side please": 1282,
    "actually": 1283,
    "suggest": 1284,
    "kosher": 1285,
    "no actually": 1286,
    "actually can": 1287,
    "you suggest": 1288,
    "suggest me": 1289,
    "me some": 1290,
    "some kosher": 1291,
    "kosher place": 1292,
    "place -s": 1293,
    "no actually can": 1294,
    "actually can you": 1295,
    "can you suggest": 1296,
    "you suggest me": 1297,
    "suggest me some": 1298,
    "me some kosher": 1299,
    "some kosher place": 1300,
    "kosher place -s": 1301,
    "portuguese": 1302,
    "might": 1303,
    "nice": 1304,
    "a portuguese": 1305,
    "portuguese restaurant": 1306,
    "restaurant might": 1307,
    "might be": 1308,
    "be nice": 1309,
    "a portuguese restaurant": 1310,
    "portuguese restaurant might": 1311,
    "restaurant might be": 1312,
    "might be nice": 1313,
    "english": 1314,
    "like information": 1315,
    "information about": 1316,
    "about a": 1317,
    "in south": 1318,
    "south that": 1319,
    "serves english": 1320,
    "english food": 1321,
    "would like information": 1322,
    "like information about": 1323,
    "information about a": 1324,
    "about a restaurant": 1325,
    "restaurant in south": 1326,
    "in south that": 1327,
    "south that serves": 1328,
    "that serves english": 1329,
    "serves english food": 1330,
    "about chinese": 1331,
    "how about chinese": 1332,
    "about chinese food": 1333,
    "cheap price": 1334,
    "cheap price range": 1335,
    "yes i": 1336,
    "know the": 1337,
    "address please": 1338,
    "yes i would": 1339,
    "like to know": 1340,
    "to know the": 1341,
    "know the address": 1342,
    "the address please": 1343,
    "known": 1344,
    "lucky": 1345,
    "get to": 1346,
    "to a": 1347,
    "restaurant known": 1348,
    "known as": 1349,
    "as the": 1350,
    "the lucky": 1351,
    "lucky star": 1352,
    "to get to": 1353,
    "get to a": 1354,
    "to a restaurant": 1355,
    "a restaurant known": 1356,
    "restaurant known as": 1357,
    "known as the": 1358,
    "as the lucky": 1359,
    "the lucky star": 1360,
    "make": 1361,
    "18:00": 1362,
    "saturday": 1363,
    "thanks please": 1364,
    "please make": 1365,
    "make a": 1366,
    "reservation there": 1367,
    "there for": 1368,
    "at 18:00": 1369,
    "18:00 on": 1370,
    "on saturday": 1371,
    "thanks please make": 1372,
    "please make a": 1373,
    "make a reservation": 1374,
    "a reservation there": 1375,
    "reservation there for": 1376,
    "there for 2": 1377,
    "2 people at": 1378,
    "people at 18:00": 1379,
    "at 18:00 on": 1380,
    "18:00 on saturday": 1381,
    "they": 1382,
    "openings": 1383,
    "17:00": 1384,
    "sure do": 1385,
    "do they": 1386,
    "they have": 1387,
    "have any": 1388,
    "any openings": 1389,
    "openings at": 1390,
    "at 17:00": 1391,
    "sure do they": 1392,
    "do they have": 1393,
    "they have any": 1394,
    "have any openings": 1395,
    "any openings at": 1396,
    "openings at 17:00": 1397,
    "stay with": 1398,
    "wifi and": 1399,
    "hey i need": 1400,
    "need a place": 1401,
    "to stay with": 1402,
    "stay with free": 1403,
    "free wifi and": 1404,
    "wifi and free": 1405,
    "and free parking": 1406,
    "has": 1407,
    "thanks i": 1408,
    "i really": 1409,
    "really do": 1410,
    "about the": 1411,
    "the area": 1412,
    "area i": 1413,
    "need stay": 1414,
    "in a": 1415,
    "guesthouse that": 1416,
    "that has": 1417,
    "has free": 1418,
    "and parking": 1419,
    "thanks i really": 1420,
    "i really do": 1421,
    "really do not": 1422,
    "care about the": 1423,
    "about the area": 1424,
    "the area i": 1425,
    "area i need": 1426,
    "i need stay": 1427,
    "need stay in": 1428,
    "stay in a": 1429,
    "in a guesthouse": 1430,
    "a guesthouse that": 1431,
    "guesthouse that has": 1432,
    "that has free": 1433,
    "has free wifi": 1434,
    "wifi and parking": 1435,
    "mind": 1436,
    "stars": 1437,
    "not mind": 1438,
    "mind about": 1439,
    "the price": 1440,
    "price but": 1441,
    "want something": 1442,
    "something with": 1443,
    "with 4": 1444,
    "4 stars": 1445,
    "do not mind": 1446,
    "not mind about": 1447,
    "mind about the": 1448,
    "about the price": 1449,
    "the price but": 1450,
    "price but i": 1451,
    "but i want": 1452,
    "i want something": 1453,
    "want something with": 1454,
    "something with 4": 1455,
    "with 4 stars": 1456,
    "sounds nice": 1457,
    "nice can": 1458,
    "you get": 1459,
    "get it": 1460,
    "that sounds nice": 1461,
    "sounds nice can": 1462,
    "nice can you": 1463,
    "can you get": 1464,
    "you get it": 1465,
    "get it for": 1466,
    "it for 4": 1467,
    "4 people thanks": 1468,
    "bye": 1469,
    "need bye": 1470,
    "i need bye": 1471,
    "named": 1472,
    "eraina": 1473,
    "get some": 1474,
    "some information": 1475,
    "information on": 1476,
    "on a": 1477,
    "restaurant named": 1478,
    "named eraina": 1479,
    "to get some": 1480,
    "get some information": 1481,
    "some information on": 1482,
    "information on a": 1483,
    "on a restaurant": 1484,
    "a restaurant named": 1485,
    "restaurant named eraina": 1486,
    "8": 1487,
    "12:30": 1488,
    "yes for": 1489,
    "for 8": 1490,
    "8 people": 1491,
    "at 12:30": 1492,
    "12:30 on": 1493,
    "on monday": 1494,
    "monday please": 1495,
    "yes for 8": 1496,
    "for 8 people": 1497,
    "8 people at": 1498,
    "people at 12:30": 1499,
    "at 12:30 on": 1500,
    "12:30 on monday": 1501,
    "on monday please": 1502,
    "time": 1503,
    "another restaurant": 1504,
    "range that": 1505,
    "is available": 1506,
    "available at": 1507,
    "at that": 1508,
    "that time": 1509,
    "there another restaurant": 1510,
    "another restaurant in": 1511,
    "price range that": 1512,
    "range that is": 1513,
    "that is available": 1514,
    "is available at": 1515,
    "available at that": 1516,
    "at that time": 1517,
    "been": 1518,
    "day": 1519,
    "all the": 1520,
    "the help": 1521,
    "help you": 1522,
    "have been": 1523,
    "been you": 1524,
    "good day": 1525,
    "for all the": 1526,
    "all the help": 1527,
    "the help you": 1528,
    "help you have": 1529,
    "you have been": 1530,
    "have been you": 1531,
    "been you have": 1532,
    "you have a": 1533,
    "have a good": 1534,
    "a good day": 1535,
    "-ly": 1536,
    "priced": 1537,
    "moderate -ly": 1538,
    "-ly priced": 1539,
    "priced restaurant": 1540,
    "south part": 1541,
    "town what": 1542,
    "number and": 1543,
    "and address": 1544,
    "find a moderate": 1545,
    "a moderate -ly": 1546,
    "moderate -ly priced": 1547,
    "-ly priced restaurant": 1548,
    "priced restaurant in": 1549,
    "the south part": 1550,
    "south part of": 1551,
    "of town what": 1552,
    "town what is": 1553,
    "is the phone": 1554,
    "phone number and": 1555,
    "number and address": 1556,
    "curry": 1557,
    "garden": 1558,
    "you book": 1559,
    "book me": 1560,
    "me a": 1561,
    "to curry": 1562,
    "curry garden": 1563,
    "could you book": 1564,
    "you book me": 1565,
    "book me a": 1566,
    "me a taxi": 1567,
    "taxi to curry": 1568,
    "to curry garden": 1569,
    "oh": 1570,
    "sorry": 1571,
    "forgot": 1572,
    "say": 1573,
    "10:45": 1574,
    "lan": 1575,
    "hong": 1576,
    "oh sorry": 1577,
    "sorry i": 1578,
    "i forgot": 1579,
    "forgot to": 1580,
    "to say": 1581,
    "say i": 1582,
    "need it": 1583,
    "by 10:45": 1584,
    "10:45 and": 1585,
    "and it": 1586,
    "it 'll": 1587,
    "be leaving": 1588,
    "leaving the": 1589,
    "the lan": 1590,
    "lan hong": 1591,
    "hong house": 1592,
    "oh sorry i": 1593,
    "sorry i forgot": 1594,
    "i forgot to": 1595,
    "forgot to say": 1596,
    "to say i": 1597,
    "say i need": 1598,
    "i need it": 1599,
    "need it to": 1600,
    "it to arrive": 1601,
    "arrive by 10:45": 1602,
    "by 10:45 and": 1603,
    "10:45 and it": 1604,
    "and it 'll": 1605,
    "it 'll be": 1606,
    "'ll be leaving": 1607,
    "be leaving the": 1608,
    "leaving the lan": 1609,
    "the lan hong": 1610,
    "lan hong house": 1611,
    "very": 1612,
    "helpful": 1613,
    "great you": 1614,
    "been very": 1615,
    "very helpful": 1616,
    "helpful have": 1617,
    "a great": 1618,
    "great day": 1619,
    "great you have": 1620,
    "have been very": 1621,
    "been very helpful": 1622,
    "very helpful have": 1623,
    "helpful have a": 1624,
    "have a great": 1625,
    "a great day": 1626,
    "unusual": 1627,
    "eat that": 1628,
    "serves unusual": 1629,
    "unusual food": 1630,
    "food in": 1631,
    "find a place": 1632,
    "to eat that": 1633,
    "eat that serves": 1634,
    "that serves unusual": 1635,
    "serves unusual food": 1636,
    "unusual food in": 1637,
    "food in the": 1638,
    "british": 1639,
    "about british": 1640,
    "how about british": 1641,
    "table": 1642,
    "moderate sounds": 1643,
    "good can": 1644,
    "a table": 1645,
    "table at": 1646,
    "at any": 1647,
    "any 1": 1648,
    "1 of": 1649,
    "the 4": 1650,
    "4 for": 1651,
    "people on": 1652,
    "monday at": 1653,
    "moderate sounds good": 1654,
    "sounds good can": 1655,
    "good can you": 1656,
    "can you book": 1657,
    "you book a": 1658,
    "book a table": 1659,
    "a table at": 1660,
    "table at any": 1661,
    "at any 1": 1662,
    "any 1 of": 1663,
    "1 of the": 1664,
    "of the 4": 1665,
    "the 4 for": 1666,
    "4 for 8": 1667,
    "8 people on": 1668,
    "people on monday": 1669,
    "on monday at": 1670,
    "monday at 18:00": 1671,
    "ga03mu3u": 1672,
    "the reference": 1673,
    "number ga03mu3u": 1674,
    "ga03mu3u goodbye": 1675,
    "you for the": 1676,
    "for the reference": 1677,
    "the reference number": 1678,
    "reference number ga03mu3u": 1679,
    "number ga03mu3u goodbye": 1680,
    "a 4": 1681,
    "4 star": 1682,
    "star place": 1683,
    "need a 4": 1684,
    "a 4 star": 1685,
    "4 star place": 1686,
    "star place to": 1687,
    "want it": 1688,
    "north and": 1689,
    "i want it": 1690,
    "want it in": 1691,
    "the north and": 1692,
    "north and it": 1693,
    "and it should": 1694,
    "you please": 1695,
    "please recommend": 1696,
    "1 for": 1697,
    "for me": 1698,
    "can you please": 1699,
    "you please recommend": 1700,
    "please recommend 1": 1701,
    "recommend 1 for": 1702,
    "1 for me": 1703,
    "people and": 1704,
    "from wednesday": 1705,
    "book it for": 1706,
    "it for 7": 1707,
    "7 people and": 1708,
    "people and 5": 1709,
    "and 5 nights": 1710,
    "starting from wednesday": 1711,
    "was": 1712,
    "that was": 1713,
    "was all": 1714,
    "all thank": 1715,
    "no that was": 1716,
    "that was all": 1717,
    "was all thank": 1718,
    "all thank you": 1719,
    "hi": 1720,
    "hi i": 1721,
    "restaurant that": 1722,
    "hi i need": 1723,
    "need a restaurant": 1724,
    "a restaurant that": 1725,
    "restaurant that serves": 1726,
    "chinese food please": 1727,
    "like an": 1728,
    "expensive 1": 1729,
    "1 please": 1730,
    "would like an": 1731,
    "like an expensive": 1732,
    "an expensive 1": 1733,
    "expensive 1 please": 1734,
    "centre of": 1735,
    "town are": 1736,
    "are there": 1737,
    "there any": 1738,
    "any available": 1739,
    "for a restaurant": 1740,
    "the centre of": 1741,
    "centre of town": 1742,
    "of town are": 1743,
    "town are there": 1744,
    "are there any": 1745,
    "there any available": 1746,
    "11:30": 1747,
    "table for": 1748,
    "at 11:30": 1749,
    "11:30 on": 1750,
    "wednesday i": 1751,
    "would also": 1752,
    "also like": 1753,
    "number please": 1754,
    "a table for": 1755,
    "table for 5": 1756,
    "5 people at": 1757,
    "people at 11:30": 1758,
    "at 11:30 on": 1759,
    "11:30 on wednesday": 1760,
    "on wednesday i": 1761,
    "wednesday i would": 1762,
    "i would also": 1763,
    "would also like": 1764,
    "also like a": 1765,
    "like a reference": 1766,
    "reference number please": 1767,
    "everything": 1768,
    "is everything": 1769,
    "everything thanks": 1770,
    "that is everything": 1771,
    "is everything thanks": 1772,
    "over": 1773,
    "weekend": 1774,
    "or": 1775,
    "guesthouse to": 1776,
    "in over": 1777,
    "over the": 1778,
    "the weekend": 1779,
    "weekend i": 1780,
    "not need": 1781,
    "need internet": 1782,
    "internet or": 1783,
    "or free": 1784,
    "for a guesthouse": 1785,
    "a guesthouse to": 1786,
    "guesthouse to stay": 1787,
    "to stay in": 1788,
    "stay in over": 1789,
    "in over the": 1790,
    "over the weekend": 1791,
    "the weekend i": 1792,
    "weekend i do": 1793,
    "do not need": 1794,
    "not need internet": 1795,
    "need internet or": 1796,
    "internet or free": 1797,
    "or free parking": 1798,
    "avalon": 1799,
    "the avalon": 1800,
    "avalon sounds": 1801,
    "the avalon sounds": 1802,
    "avalon sounds good": 1803,
    "right": 1804,
    "no i": 1805,
    "book right": 1806,
    "right now": 1807,
    "now but": 1808,
    "but thanks": 1809,
    "no i do": 1810,
    "not need to": 1811,
    "to book right": 1812,
    "book right now": 1813,
    "right now but": 1814,
    "now but thanks": 1815,
    "but thanks that": 1816,
    "is all for": 1817,
    "for an": 1818,
    "expensive chinese": 1819,
    "chinese restaurant": 1820,
    "yes i am": 1821,
    "looking for an": 1822,
    "for an expensive": 1823,
    "an expensive chinese": 1824,
    "expensive chinese restaurant": 1825,
    "recommendation": 1826,
    "not could": 1827,
    "you make": 1828,
    "a recommendation": 1829,
    "do not could": 1830,
    "not could you": 1831,
    "could you make": 1832,
    "you make a": 1833,
    "make a recommendation": 1834,
    "the postcode": 1835,
    "postcode for": 1836,
    "for that": 1837,
    "is the postcode": 1838,
    "the postcode for": 1839,
    "postcode for that": 1840,
    "for that restaurant": 1841,
    "necessary thank": 1842,
    "be necessary thank": 1843,
    "necessary thank you": 1844,
    "for the help": 1845,
    "need the": 1846,
    "of a": 1847,
    "i need the": 1848,
    "need the address": 1849,
    "number of a": 1850,
    "of a restaurant": 1851,
    "tell": 1852,
    "kind": 1853,
    "serve": 1854,
    "you tell": 1855,
    "tell me": 1856,
    "me what": 1857,
    "what kind": 1858,
    "kind of": 1859,
    "of food": 1860,
    "food they": 1861,
    "they serve": 1862,
    "can you tell": 1863,
    "you tell me": 1864,
    "tell me what": 1865,
    "me what kind": 1866,
    "what kind of": 1867,
    "kind of food": 1868,
    "of food they": 1869,
    "food they serve": 1870,
    "chiquito": 1871,
    "want 1": 1872,
    "1 in": 1873,
    "moderate priced": 1874,
    "priced range": 1875,
    "range what": 1876,
    "range of": 1877,
    "of chiquito": 1878,
    "chiquito restaurant": 1879,
    "i want 1": 1880,
    "want 1 in": 1881,
    "1 in the": 1882,
    "the moderate priced": 1883,
    "moderate priced range": 1884,
    "priced range what": 1885,
    "range what is": 1886,
    "is the price": 1887,
    "the price range": 1888,
    "price range of": 1889,
    "range of chiquito": 1890,
    "of chiquito restaurant": 1891,
    "cherry": 1892,
    "hinton": 1893,
    "address for": 1894,
    "for pizza": 1895,
    "hut cherry": 1896,
    "cherry hinton": 1897,
    "the address for": 1898,
    "address for pizza": 1899,
    "for pizza hut": 1900,
    "pizza hut cherry": 1901,
    "hut cherry hinton": 1902,
    "again": 1903,
    "sorry what": 1904,
    "area again": 1905,
    "sorry what is": 1906,
    "is the area": 1907,
    "the area again": 1908,
    "located": 1909,
    "restaurant located": 1910,
    "located in": 1911,
    "like a moderate": 1912,
    "priced restaurant located": 1913,
    "restaurant located in": 1914,
    "located in the": 1915,
    "what type": 1916,
    "food are": 1917,
    "are they": 1918,
    "they what": 1919,
    "what type of": 1920,
    "type of food": 1921,
    "of food are": 1922,
    "food are they": 1923,
    "are they what": 1924,
    "they what is": 1925,
    "3": 1926,
    "should have": 1927,
    "a star": 1928,
    "star of": 1929,
    "of 3": 1930,
    "3 and": 1931,
    "and include": 1932,
    "it should have": 1933,
    "should have a": 1934,
    "have a star": 1935,
    "a star of": 1936,
    "star of 3": 1937,
    "of 3 and": 1938,
    "3 and include": 1939,
    "and include free": 1940,
    "hotel in": 1941,
    "west with": 1942,
    "with a": 1943,
    "for a hotel": 1944,
    "a hotel in": 1945,
    "hotel in the": 1946,
    "the west with": 1947,
    "west with a": 1948,
    "with a moderate": 1949,
    "a moderate price": 1950,
    "long": 1951,
    "it does": 1952,
    "have to": 1953,
    "range as": 1954,
    "as long": 1955,
    "long as": 1956,
    "as it": 1957,
    "is a": 1958,
    "a 3": 1959,
    "3 star": 1960,
    "star hotel": 1961,
    "hotel with": 1962,
    "parking please": 1963,
    "please suggest": 1964,
    "suggest 1": 1965,
    "it does not": 1966,
    "does not have": 1967,
    "not have to": 1968,
    "have to be": 1969,
    "price range as": 1970,
    "range as long": 1971,
    "as long as": 1972,
    "long as it": 1973,
    "as it is": 1974,
    "it is a": 1975,
    "is a 3": 1976,
    "a 3 star": 1977,
    "3 star hotel": 1978,
    "star hotel with": 1979,
    "hotel with free": 1980,
    "with free parking": 1981,
    "free parking please": 1982,
    "parking please suggest": 1983,
    "please suggest 1": 1984,
    "suggest 1 for": 1985,
    "book there": 1986,
    "for 3": 1987,
    "3 people": 1988,
    "thursday and": 1989,
    "to book there": 1990,
    "book there for": 1991,
    "there for 3": 1992,
    "for 3 people": 1993,
    "3 people for": 1994,
    "starting thursday and": 1995,
    "thursday and i": 1996,
    "and i would": 1997,
    "look": 1998,
    "please look": 1999,
    "look for": 2000,
    "for any": 2001,
    "any hotel": 2002,
    "hotel -s": 2003,
    "-s in": 2004,
    "same price": 2005,
    "yes please look": 2006,
    "please look for": 2007,
    "look for any": 2008,
    "for any hotel": 2009,
    "any hotel -s": 2010,
    "hotel -s in": 2011,
    "-s in the": 2012,
    "the same price": 2013,
    "same price range": 2014,
    "fine": 2015,
    "hobsons": 2016,
    "be fine": 2017,
    "fine the": 2018,
    "the hobsons": 2019,
    "hobsons house": 2020,
    "house sounds": 2021,
    "would be fine": 2022,
    "be fine the": 2023,
    "fine the hobsons": 2024,
    "the hobsons house": 2025,
    "hobsons house sounds": 2026,
    "house sounds good": 2027,
    "you so": 2028,
    "much for": 2029,
    "thank you so": 2030,
    "you so much": 2031,
    "so much for": 2032,
    "much for your": 2033,
    "restaurant the": 2034,
    "the restaurant": 2035,
    "restaurant should": 2036,
    "should serve": 2037,
    "serve italian": 2038,
    "food and": 2039,
    "and should": 2040,
    "should be": 2041,
    "a restaurant the": 2042,
    "restaurant the restaurant": 2043,
    "the restaurant should": 2044,
    "restaurant should serve": 2045,
    "should serve italian": 2046,
    "serve italian food": 2047,
    "italian food and": 2048,
    "food and should": 2049,
    "and should be": 2050,
    "should be in": 2051,
    "looking in": 2052,
    "am looking in": 2053,
