{
  "none": 0,
  "hotel-inform(area)": 1,
  "hotel-inform(name)": 2,
  "hotel-inform(choice)": 3,
  "hotel-inform(internet)": 4,
  "hotel-inform(parking)": 5,
  "booking-request(day)": 6,
  "booking-book(ref)": 7,
  "hotel-request(price)": 8,
  "hotel-recommend(name)": 9,
  "hotel-inform(type)": 10,
  "booking-request(people)": 11,
  "booking-request(stay)": 12,
  "hotel-recommend(area)": 13,
  "hotel-recommend(stars)": 14,
  "booking-inform(none)": 15,
  "hotel-select(none)": 16,
  "hotel-inform(price)": 17,
  "hotel-inform(stars)": 18,
  "hotel-request(area)": 19,
  "hotel-request(parking)": 20,
  "booking-nobook(stay)": 21,
  "booking-nobook(day)": 22,
  "booking-nobook(people)": 23,
  "general-reqmore(none)": 24,
  "booking-book(day)": 25,
  "booking-book(people)": 26,
  "hotel-nooffer(none)": 27,
  "general-greet(none)": 28,
  "hotel-select(price)": 29,
  "booking-nobook(none)": 30,
  "booking-inform(name)": 31,
  "hotel-inform(post)": 32,
  "hotel-inform(phone)": 33,
  "hotel-inform(addr)": 34,
  "booking-book(stay)": 35,
  "booking-book(name)": 36,
  "hotel-recommend(none)": 37,
  "hotel-select(area)": 38,
  "hotel-request(stars)": 39,
  "hotel-request(name)": 40,
  "general-welcome(none)": 41,
  "booking-book(none)": 42,
  "hotel-inform(ref)": 43,
  "hotel-nooffer(type)": 44,
  "attraction-inform(name)": 45,
  "hotel-request(internet)": 46,
  "hotel-request(type)": 47,
  "general-bye(none)": 48,
  "hotel-recommend(phone)": 49,
  "hotel-recommend(addr)": 50,
  "hotel-recommend(post)": 51,
  "hotel-select(choice)": 52,
  "hotel-select(internet)": 53,
  "hotel-recommend(price)": 54,
  "hotel-recommend(parking)": 55,
  "hotel-select(type)": 56,
  "hotel-recommend(type)": 57,
  "booking-request(time)": 58,
  "hotel-select(name)": 59,
  "booking-nobook(name)": 60,
  "hotel-nooffer(price)": 61,
  "hotel-nooffer(area)": 62,
  "hotel-recommend(internet)": 63,
  "hotel-nooffer(internet)": 64,
  "booking-inform(people)": 65,
  "booking-inform(stay)": 66,
  "booking-inform(day)": 67,
  "hotel-inform(none)": 68,
  "hotel-nooffer(stars)": 69,
  "restaurant-recommend(name)": 70,
  "restaurant-inform(choice)": 71,
  "hotel-select(stars)": 72,
  "hotel-nooffer(choice)": 73,
  "hotel-select(parking)": 74,
  "restaurant-request(price)": 75,
  "restaurant-nooffer(price)": 76,
  "hotel-nooffer(parking)": 77,
  "booking-inform(ref)": 78,
  "booking-book(time)": 79,
  "hotel-recommend(choice)": 80,
  "restaurant-inform(none)": 81,
  "booking-nobook(time)": 82,
  "restaurant-recommend(none)": 83,
  "restaurant-inform(post)": 84,
  "restaurant-inform(area)": 85,
  "restaurant-inform(name)": 86,
  "restaurant-nooffer(none)": 87,
  "restaurant-inform(food)": 88,
  "restaurant-inform(addr)": 89,
  "restaurant-inform(price)": 90,
  "restaurant-request(area)": 91,
  "restaurant-request(food)": 92,
  "restaurant-select(none)": 93,
  "restaurant-inform(phone)": 94,
  "restaurant-select(area)": 95,
  "restaurant-recommend(food)": 96,
  "restaurant-recommend(price)": 97,
  "restaurant-select(price)": 98,
  "restaurant-recommend(area)": 99,
  "restaurant-select(food)": 100,
  "restaurant-recommend(phone)": 101,
  "restaurant-recommend(addr)": 102,
  "restaurant-nooffer(food)": 103,
  "restaurant-request(name)": 104,
  "restaurant-nooffer(area)": 105,
  "booking-inform(time)": 106,
  "restaurant-recommend(post)": 107,
  "restaurant-inform(ref)": 108,
  "restaurant-select(name)": 109,
  "restaurant-select(choice)": 110,
  "restaurant-recommend(choice)": 111,
  "booking-nobook(ref)": 112,
  "restaurant-select(addr)": 113,
  "attraction-inform(phone)": 114,
  "taxi-request(depart)": 115,
  "taxi-request(leave)": 116,
  "taxi-request(dest)": 117,
  "attraction-nooffer(none)": 118,
  "taxi-inform(car)": 119,
  "taxi-inform(phone)": 120,
  "taxi-request(arrive)": 121,
  "taxi-inform(depart)": 122,
  "taxi-inform(dest)": 123,
  "taxi-inform(arrive)": 124,
  "taxi-inform(none)": 125,
  "taxi-inform(leave)": 126,
  "train-inform(depart)": 127,
  "train-inform(dest)": 128,
  "attraction-request(name)": 129,
  "train-request(dest)": 130,
  "train-inform(choice)": 131,
  "train-request(leave)": 132,
  "train-request(day)": 133,
  "train-inform(arrive)": 134,
  "train-inform(leave)": 135,
  "train-inform(ticket)": 136,
  "train-request(depart)": 137,
  "train-request(arrive)": 138,
  "train-inform(id)": 139,
  "train-offerbook(none)": 140,
  "train-inform(time)": 141,
  "train-inform(day)": 142,
  "train-request(people)": 143,
  "train-offerbooked(ref)": 144,
  "train-offerbooked(ticket)": 145,
  "train-offerbooked(id)": 146,
  "train-nooffer(day)": 147,
  "train-offerbook(arrive)": 148,
  "train-offerbook(dest)": 149,
  "train-offerbook(id)": 150,
  "train-offerbook(depart)": 151,
  "train-offerbook(leave)": 152,
  "train-offerbook(people)": 153,
  "train-offerbooked(people)": 154,
  "train-offerbooked(arrive)": 155,
  "train-offerbooked(leave)": 156,
  "train-offerbooked(time)": 157,
  "train-offerbooked(day)": 158,
  "train-offerbooked(dest)": 159,
  "train-offerbooked(depart)": 160,
  "train-inform(ref)": 161,
  "train-nooffer(arrive)": 162,
  "train-select(none)": 163,
  "train-nooffer(none)": 164,
  "train-select(id)": 165,
  "train-select(leave)": 166,
  "train-select(day)": 167,
  "train-offerbooked(none)": 168,
  "train-inform(none)": 169,
  "train-nooffer(depart)": 170,
  "train-nooffer(dest)": 171,
  "train-nooffer(leave)": 172,
  "train-select(choice)": 173,
  "train-offerbook(ref)": 174,
  "train-nooffer(id)": 175,
  "train-offerbook(ticket)": 176,
  "train-offerbook(time)": 177,
  "train-offerbook(day)": 178,
  "train-inform(people)": 179
}