{
  "3": {
    "<pad>": 0,
    "</s>": 1,
    "<s>": 2,
    "unk": 3,
    "<dontcare>": 4,
    "<none>": 5,
    "i": 6,
    "need": 7,
    "to": 8,
    "find": 9,
    "a": 10,
    "guesthouse": 11,
    "with": 12,
    "0": 13,
    "star": 14,
    "rating": 15,
    ".": 16,
    "yes": 17,
    "no": 18,
    "dontcare": 19,
    "i need": 20,
    "need to": 21,
    "to find": 22,
    "find a": 23,
    "a guesthouse": 24,
    "guesthouse with": 25,
    "with a": 26,
    "a 0": 27,
    "0 star": 28,
    "star rating": 29,
    "i need to": 30,
    "need to find": 31,
    "to find a": 32,
    "find a guesthouse": 33,
    "a guesthouse with": 34,
    "guesthouse with a": 35,
    "with a 0": 36,
    "a 0 star": 37,
    "0 star rating": 38,
    "do": 39,
    "they": 40,
    "have": 41,
    "free": 42,
    "parking": 43,
    "and": 44,
    "wifi": 45,
    "?": 46,
    "do they": 47,
    "they have": 48,
    "have free": 49,
    "free parking": 50,
    "parking and": 51,
    "and wifi": 52,
    "do they have": 53,
    "they have free": 54,
    "have free parking": 55,
    "free parking and": 56,
    "parking and wifi": 57,
    "that": 58,
    "is": 59,
    "awesome": 60,
    "can": 61,
    "you": 62,
    "book": 63,
    "1": 64,
    "of": 65,
    "them": 66,
    "for": 67,
    "me": 68,
    "that is": 69,
    "is awesome": 70,
    "awesome can": 71,
    "can you": 72,
    "you book": 73,
    "book 1": 74,
    "1 of": 75,
    "of them": 76,
    "them for": 77,
    "for me": 78,
    "that is awesome": 79,
    "is awesome can": 80,
    "awesome can you": 81,
    "can you book": 82,
    "you book 1": 83,
    "book 1 of": 84,
    "1 of them": 85,
    "of them for": 86,
    "them for me": 87,
    "on": 88,
    "friday": 89,
    ",": 90,
    "would": 91,
    "like": 92,
    "stay": 93,
    "5": 94,
    "nights": 95,
    "this": 96,
    "will": 97,
    "be": 98,
    "6": 99,
    "people": 100,
    "on friday": 101,
    "friday and": 102,
    "and i": 103,
    "i would": 104,
    "would like": 105,
    "like to": 106,
    "to stay": 107,
    "stay 5": 108,
    "5 nights": 109,
    "nights this": 110,
    "this will": 111,
    "will be": 112,
    "be for": 113,
    "for 6": 114,
    "6 people": 115,
    "on friday and": 116,
    "friday and i": 117,
    "and i would": 118,
    "i would like": 119,
    "would like to": 120,
    "like to stay": 121,
    "to stay 5": 122,
    "stay 5 nights": 123,
    "5 nights this": 124,
    "nights this will": 125,
    "this will be": 126,
    "will be for": 127,
    "be for 6": 128,
    "for 6 people": 129,
    "excellent": 130,
    "thank": 131,
    "the": 132,
    "help": 133,
    "!": 134,
    "excellent thank": 135,
    "thank you": 136,
    "you for": 137,
    "for the": 138,
    "the help": 139,
    "excellent thank you": 140,
    "thank you for": 141,
    "you for the": 142,
    "for the help": 143,
    "am": 144,
    "looking": 145,
    "hotel": 146,
    "in": 147,
    "north": 148,
    "i am": 149,
    "am looking": 150,
    "looking for": 151,
    "for a": 152,
    "a hotel": 153,
    "hotel with": 154,
    "with free": 155,
    "parking in": 156,
    "in the": 157,
    "the north": 158,
    "i am looking": 159,
    "am looking for": 160,
    "looking for a": 161,
    "for a hotel": 162,
    "a hotel with": 163,
    "hotel with free": 164,
    "with free parking": 165,
    "free parking in": 166,
    "parking in the": 167,
    "in the north": 168,
    "are": 169,
    "any": 170,
    "those": 171,
    "11": 172,
    "guesthouses": 173,
    "are any": 174,
    "any of": 175,
    "of those": 176,
    "those 11": 177,
    "11 guesthouses": 178,
    "are any of": 179,
    "any of those": 180,
    "of those 11": 181,
    "those 11 guesthouses": 182,
    "does": 183,
    "it": 184,
    "offer": 185,
    "does it": 186,
    "it offer": 187,
    "offer free": 188,
    "free wifi": 189,
    "does it offer": 190,
    "it offer free": 191,
    "offer free wifi": 192,
    "okay": 193,
    "please": 194,
    "okay please": 195,
    "please help": 196,
    "help me": 197,
    "me book": 198,
    "book this": 199,
    "this guesthouse": 200,
    "okay please help": 201,
    "please help me": 202,
    "help me book": 203,
    "me book this": 204,
    "book this guesthouse": 205,
    "not": 206,
    "all": 207,
    "information": 208,
    "at": 209,
    "time": 210,
    "talk": 211,
    "again": 212,
    "when": 213,
    "know": 214,
    "more": 215,
    "i do": 216,
    "do not": 217,
    "not have": 218,
    "have all": 219,
    "all of": 220,
    "of that": 221,
    "that information": 222,
    "information at": 223,
    "at this": 224,
    "this time": 225,
    "time can": 226,
    "can i": 227,
    "i talk": 228,
    "talk to": 229,
    "to you": 230,
    "you again": 231,
    "again when": 232,
    "when i": 233,
    "i know": 234,
    "know more": 235,
    "i do not": 236,
    "do not have": 237,
    "not have all": 238,
    "have all of": 239,
    "all of that": 240,
    "of that information": 241,
    "that information at": 242,
    "information at this": 243,
    "at this time": 244,
    "this time can": 245,
    "time can i": 246,
    "can i talk": 247,
    "i talk to": 248,
    "talk to you": 249,
    "to you again": 250,
    "you again when": 251,
    "again when i": 252,
    "when i know": 253,
    "i know more": 254,
    "your": 255,
    "for your": 256,
    "your help": 257,
    "you for your": 258,
    "for your help": 259,
    "3": 260,
    "centre": 261,
    "town": 262,
    "a 3": 263,
    "3 star": 264,
    "star hotel": 265,
    "hotel in": 266,
    "the centre": 267,
    "centre of": 268,
    "of town": 269,
    "for a 3": 270,
    "a 3 star": 271,
    "3 star hotel": 272,
    "star hotel in": 273,
    "hotel in the": 274,
    "in the centre": 275,
    "the centre of": 276,
    "centre of town": 277,
    "but": 278,
    "just": 279,
    "by": 280,
    "chance": 281,
    "it does": 282,
    "does not": 283,
    "not need": 284,
    "to have": 285,
    "parking but": 286,
    "but just": 287,
    "just by": 288,
    "by chance": 289,
    "chance do": 290,
    "they offer": 291,
    "offer that": 292,
    "it does not": 293,
    "does not need": 294,
    "not need to": 295,
    "need to have": 296,
    "to have free": 297,
    "free parking but": 298,
    "parking but just": 299,
    "but just by": 300,
    "just by chance": 301,
    "by chance do": 302,
    "chance do they": 303,
    "do they offer": 304,
    "they offer that": 305,
    "no that": 306,
    "is all": 307,
    "all the": 308,
    "the information": 309,
    "information i": 310,
    "need thank": 311,
    "no that is": 312,
    "that is all": 313,
    "is all the": 314,
    "all the information": 315,
    "the information i": 316,
    "information i need": 317,
    "i need thank": 318,
    "need thank you": 319,
    "place": 320,
    "should": 321,
    "expensive": 322,
    "price": 323,
    "range": 324,
    "type": 325,
    "a place": 326,
    "place to": 327,
    "stay the": 328,
    "the hotel": 329,
    "hotel should": 330,
    "should be": 331,
    "be in": 332,
    "the expensive": 333,
    "expensive price": 334,
    "price range": 335,
    "range and": 336,
    "and should": 337,
    "the type": 338,
    "type of": 339,
    "of guesthouse": 340,
    "for a place": 341,
    "a place to": 342,
    "place to stay": 343,
    "to stay the": 344,
    "stay the hotel": 345,
    "the hotel should": 346,
    "hotel should be": 347,
    "should be in": 348,
    "be in the": 349,
    "in the expensive": 350,
    "the expensive price": 351,
    "expensive price range": 352,
    "price range and": 353,
    "range and should": 354,
    "and should be": 355,
    "in the type": 356,
    "the type of": 357,
    "type of guesthouse": 358,
    "its": 359,
    "ok": 360,
    "if": 361,
    "has": 362,
    "its ok": 363,
    "ok if": 364,
    "if it": 365,
    "it has": 366,
    "has free": 367,
    "its ok if": 368,
    "ok if it": 369,
    "if it has": 370,
    "it has free": 371,
    "has free parking": 372,
    "there": 373,
    "cheap": 374,
    "are there": 375,
    "there any": 376,
    "any guesthouses": 377,
    "guesthouses in": 378,
    "the cheap": 379,
    "cheap price": 380,
    "are there any": 381,
    "there any guesthouses": 382,
    "any guesthouses in": 383,
    "guesthouses in the": 384,
    "in the cheap": 385,
    "the cheap price": 386,
    "cheap price range": 387,
    "tell": 388,
    "about": 389,
    "you please": 390,
    "please tell": 391,
    "tell me": 392,
    "me about": 393,
    "about the": 394,
    "the star": 395,
    "star of": 396,
    "of the": 397,
    "can you please": 398,
    "you please tell": 399,
    "please tell me": 400,
    "tell me about": 401,
    "me about the": 402,
    "about the star": 403,
    "the star of": 404,
    "star of the": 405,
    "of the hotel": 406,
    "what": 407,
    "allenbell": 408,
    "what is": 409,
    "is the": 410,
    "the price": 411,
    "price of": 412,
    "of allenbell": 413,
    "what is the": 414,
    "is the price": 415,
    "the price of": 416,
    "price of allenbell": 417,
    "today": 418,
    "goodbye": 419,
    "all i": 420,
    "need for": 421,
    "for today": 422,
    "today goodbye": 423,
    "is all i": 424,
    "all i need": 425,
    "i need for": 426,
    "need for today": 427,
    "for today goodbye": 428,
    "south": 429,
    "need a": 430,
    "the south": 431,
    "south with": 432,
    "i need a": 433,
    "need a hotel": 434,
    "a hotel in": 435,
    "in the south": 436,
    "the south with": 437,
    "south with free": 438,
    "with free wifi": 439,
    "you tell": 440,
    "me if": 441,
    "if the": 442,
    "cheap 1": 443,
    "1 has": 444,
    "has a": 445,
    "a star": 446,
    "can you tell": 447,
    "you tell me": 448,
    "tell me if": 449,
    "me if the": 450,
    "if the cheap": 451,
    "the cheap 1": 452,
    "cheap 1 has": 453,
    "1 has a": 454,
    "has a star": 455,
    "a star rating": 456,
    "room": 457,
    "yes please": 458,
    "please book": 459,
    "book a": 460,
    "a room": 461,
    "room for": 462,
    "for 5": 463,
    "5 people": 464,
    "yes please book": 465,
    "please book a": 466,
    "book a room": 467,
    "a room for": 468,
    "room for 5": 469,
    "for 5 people": 470,
    "thursday": 471,
    "days": 472,
    "book it": 473,
    "it on": 474,
    "on thursday": 475,
    "thursday for": 476,
    "people and": 477,
    "and 3": 478,
    "3 days": 479,
    "please book it": 480,
    "book it on": 481,
    "it on thursday": 482,
    "on thursday for": 483,
    "thursday for 5": 484,
    "5 people and": 485,
    "people and 3": 486,
    "and 3 days": 487,
    "that will": 488,
    "be all": 489,
    "all thank": 490,
    "that will be": 491,
    "will be all": 492,
    "be all thank": 493,
    "all thank you": 494,
    "info": 495,
    "4": 496,
    "accommodations": 497,
    "somewhere": 498,
    "where": 499,
    "nickel": 500,
    "dime": 501,
    "services": 502,
    "for info": 503,
    "info about": 504,
    "about 4": 505,
    "4 star": 506,
    "star accommodations": 507,
    "accommodations somewhere": 508,
    "somewhere where": 509,
    "where they": 510,
    "they do": 511,
    "not nickel": 512,
    "nickel and": 513,
    "and dime": 514,
    "dime you": 515,
    "for services": 516,
    "services like": 517,
    "like wifi": 518,
    "looking for info": 519,
    "for info about": 520,
    "info about 4": 521,
    "about 4 star": 522,
    "4 star accommodations": 523,
    "star accommodations somewhere": 524,
    "accommodations somewhere where": 525,
    "somewhere where they": 526,
    "where they do": 527,
    "they do not": 528,
    "do not nickel": 529,
    "not nickel and": 530,
    "nickel and dime": 531,
    "and dime you": 532,
    "dime you for": 533,
    "you for services": 534,
    "for services like": 535,
    "services like wifi": 536,
    "located": 537,
    "east": 538,
    "moderate": 539,
    "like 1": 540,
    "1 located": 541,
    "located in": 542,
    "the east": 543,
    "east with": 544,
    "a moderate": 545,
    "moderate price": 546,
    "would like 1": 547,
    "like 1 located": 548,
    "1 located in": 549,
    "located in the": 550,
    "in the east": 551,
    "the east with": 552,
    "east with a": 553,
    "with a moderate": 554,
    "a moderate price": 555,
    "moderate price range": 556,
    "care": 557,
    "surprise": 558,
    "no i": 559,
    "not care": 560,
    "care about": 561,
    "about that": 562,
    "that surprise": 563,
    "surprise me": 564,
    "no i do": 565,
    "do not care": 566,
    "not care about": 567,
    "care about that": 568,
    "about that surprise": 569,
    "that surprise me": 570,
    "thats": 571,
    "still": 572,
    "fine": 573,
    "night": 574,
    "thats still": 575,
    "still fine": 576,
    "fine book": 577,
    "book for": 578,
    "for 1": 579,
    "1 night": 580,
    "thats still fine": 581,
    "still fine book": 582,
    "fine book for": 583,
    "book for 1": 584,
    "for 1 night": 585,
    "'ll": 586,
    "starting": 587,
    "from": 588,
    "wednesday": 589,
    "it 'll": 590,
    "'ll be": 591,
    "and 5": 592,
    "nights starting": 593,
    "starting from": 594,
    "from wednesday": 595,
    "wednesday please": 596,
    "it 'll be": 597,
    "'ll be for": 598,
    "be for 5": 599,
    "people and 5": 600,
    "and 5 nights": 601,
    "5 nights starting": 602,
    "nights starting from": 603,
    "starting from wednesday": 604,
    "from wednesday please": 605,
    "see": 606,
    "available": 607,
    "reference": 608,
    "number": 609,
    "you see": 610,
    "see if": 611,
    "if they": 612,
    "they are": 613,
    "are available": 614,
    "available for": 615,
    "night i": 616,
    "i will": 617,
    "will need": 618,
    "need the": 619,
    "the reference": 620,
    "reference number": 621,
    "number if": 622,
    "if available": 623,
    "can you see": 624,
    "you see if": 625,
    "see if they": 626,
    "if they are": 627,
    "they are available": 628,
    "are available for": 629,
    "available for 1": 630,
    "1 night i": 631,
    "night i will": 632,
    "i will need": 633,
    "will need the": 634,
    "need the reference": 635,
    "the reference number": 636,
    "reference number if": 637,
    "number if available": 638,
    "think": 639,
    "everything": 640,
    "helping": 641,
    "i think": 642,
    "think that": 643,
    "is everything": 644,
    "everything i": 645,
    "for helping": 646,
    "helping me": 647,
    "no i think": 648,
    "i think that": 649,
    "think that is": 650,
    "that is everything": 651,
    "is everything i": 652,
    "everything i need": 653,
    "you for helping": 654,
    "for helping me": 655,
    "you help": 656,
    "me find": 657,
    "stay with": 658,
    "can you help": 659,
    "you help me": 660,
    "help me find": 661,
    "me find a": 662,
    "find a place": 663,
    "to stay with": 664,
    "stay with free": 665,
    "stick": 666,
    "to stick": 667,
    "stick to": 668,
    "to a": 669,
    "like to stick": 670,
    "to stick to": 671,
    "stick to a": 672,
    "to a moderate": 673,
    "centr": 674,
    "stay in": 675,
    "in town": 676,
    "town centr": 677,
    "to stay in": 678,
    "stay in town": 679,
    "in town centr": 680,
    "actually": 681,
    "area": 682,
    "matter": 683,
    "actually the": 684,
    "the area": 685,
    "area does": 686,
    "not matter": 687,
    "matter i": 688,
    "i just": 689,
    "just need": 690,
    "a 4": 691,
    "the moderate": 692,
    "actually the area": 693,
    "the area does": 694,
    "area does not": 695,
    "does not matter": 696,
    "not matter i": 697,
    "matter i just": 698,
    "i just need": 699,
    "just need a": 700,
    "need a 4": 701,
    "a 4 star": 702,
    "4 star hotel": 703,
    "in the moderate": 704,
    "the moderate price": 705,
    "really": 706,
    "search": 707,
    "open": 708,
    "-s": 709,
    "i really": 710,
    "really would": 711,
    "like a": 712,
    "hotel not": 713,
    "not a": 714,
    "guesthouse can": 715,
    "please search": 716,
    "search again": 717,
    "again open": 718,
    "open to": 719,
    "to all": 720,
    "all area": 721,
    "area -s": 722,
    "i really would": 723,
    "really would like": 724,
    "would like a": 725,
    "like a hotel": 726,
    "a hotel not": 727,
    "hotel not a": 728,
    "not a guesthouse": 729,
    "a guesthouse can": 730,
    "guesthouse can you": 731,
    "you please search": 732,
    "please search again": 733,
    "search again open": 734,
    "again open to": 735,
    "open to all": 736,
    "to all area": 737,
    "all area -s": 738,
    "double": 739,
    "check": 740,
    "you double": 741,
    "double check": 742,
    "check for": 743,
    "range with": 744,
    "can you double": 745,
    "you double check": 746,
    "double check for": 747,
    "check for a": 748,
    "for a 4": 749,
    "price range with": 750,
    "range with free": 751,
    "certain": 752,
    "prefer": 753,
    "there is": 754,
    "is no": 755,
    "no certain": 756,
    "certain area": 757,
    "area but": 758,
    "but i": 759,
    "would prefer": 760,
    "prefer a": 761,
    "there is no": 762,
    "is no certain": 763,
    "no certain area": 764,
    "certain area but": 765,
    "area but i": 766,
    "but i would": 767,
    "i would prefer": 768,
    "would prefer a": 769,
    "prefer a hotel": 770,
    "apologize": 771,
    "confusion": 772,
    "lodging": 773,
    "-ly": 774,
    "priced": 775,
    "i apologize": 776,
    "apologize for": 777,
    "for all": 778,
    "all this": 779,
    "this confusion": 780,
    "confusion the": 781,
    "of lodging": 782,
    "lodging does": 783,
    "like it": 784,
    "it to": 785,
    "parking be": 786,
    "be 4": 787,
    "star moderate": 788,
    "moderate -ly": 789,
    "-ly priced": 790,
    "priced and": 791,
    "and the": 792,
    "i apologize for": 793,
    "apologize for all": 794,
    "for all this": 795,
    "all this confusion": 796,
    "this confusion the": 797,
    "confusion the type": 798,
    "type of lodging": 799,
    "of lodging does": 800,
    "lodging does not": 801,
    "matter i would": 802,
    "would like it": 803,
    "like it to": 804,
    "it to have": 805,
    "free parking be": 806,
    "parking be 4": 807,
    "be 4 star": 808,
    "4 star moderate": 809,
    "star moderate -ly": 810,
    "moderate -ly priced": 811,
    "-ly priced and": 812,
    "priced and the": 813,
    "and the area": 814,
    "great": 815,
    "7": 816,
    "us": 817,
    "staying": 818,
    "great can": 819,
    "it for": 820,
    "me there": 821,
    "there will": 822,
    "be 7": 823,
    "7 of": 824,
    "of us": 825,
    "us staying": 826,
    "great can you": 827,
    "you please book": 828,
    "book it for": 829,
    "it for me": 830,
    "for me there": 831,
    "me there will": 832,
    "there will be": 833,
    "will be 7": 834,
    "be 7 of": 835,
    "7 of us": 836,
    "of us staying": 837,
    "arriving": 838,
    "tuesday": 839,
    "2": 840,
    "be arriving": 841,
    "arriving on": 842,
    "on tuesday": 843,
    "tuesday and": 844,
    "and staying": 845,
    "staying for": 846,
    "for 2": 847,
    "2 days": 848,
    "days please": 849,
    "i will be": 850,
    "will be arriving": 851,
    "be arriving on": 852,
    "arriving on tuesday": 853,
    "on tuesday and": 854,
    "tuesday and staying": 855,
    "and staying for": 856,
    "staying for 2": 857,
    "for 2 days": 858,
    "2 days please": 859,
    "very": 860,
    "much": 861,
    "you very": 862,
    "very much": 863,
    "is all thank": 864,
    "thank you very": 865,
    "you very much": 866,
    "want": 867,
    "i want": 868,
    "want to": 869,
    "stay that": 870,
    "is a": 871,
    "guesthouse and": 872,
    "and has": 873,
    "i want to": 874,
    "want to find": 875,
    "to stay that": 876,
    "stay that is": 877,
    "that is a": 878,
    "is a guesthouse": 879,
    "a guesthouse and": 880,
    "guesthouse and has": 881,
    "and has free": 882,
    "least": 883,
    "stars": 884,
    "starts": 885,
    "want at": 886,
    "at least": 887,
    "least 4": 888,
    "4 stars": 889,
    "stars rating": 890,
    "rating are": 891,
    "them 4": 892,
    "4 starts": 893,
    "i want at": 894,
    "want at least": 895,
    "at least 4": 896,
    "least 4 stars": 897,
    "4 stars rating": 898,
    "stars rating are": 899,
    "rating are any": 900,
    "any of them": 901,
    "of them 4": 902,
    "them 4 starts": 903,
    "sunday": 904,
    "no just": 905,
    "just any": 906,
    "any where": 907,
    "where that": 908,
    "that has": 909,
    "has room": 910,
    "people starting": 911,
    "starting sunday": 912,
    "no just any": 913,
    "just any where": 914,
    "any where that": 915,
    "where that has": 916,
    "that has room": 917,
    "has room for": 918,
    "5 people starting": 919,
    "people starting sunday": 920,
    "i prefer": 921,
    "prefer to": 922,
    "in a": 923,
    "moderate area": 924,
    "i prefer to": 925,
    "prefer to stay": 926,
    "stay in a": 927,
    "in a moderate": 928,
    "a moderate area": 929,
    "sounds": 930,
    "good": 931,
    "sounds good": 932,
    "good please": 933,
    "3 nights": 934,
    "from this": 935,
    "this sunday": 936,
    "sounds good please": 937,
    "good please book": 938,
    "please book for": 939,
    "book for 5": 940,
    "and 3 nights": 941,
    "3 nights starting": 942,
    "starting from this": 943,
    "from this sunday": 944,
    "let": 945,
    "'s": 946,
    "try": 947,
    "yes let": 948,
    "let 's": 949,
    "'s try": 950,
    "try that": 951,
    "that 1": 952,
    "1 please": 953,
    "yes let 's": 954,
    "let 's try": 955,
    "'s try that": 956,
    "try that 1": 957,
    "that 1 please": 958,
    "aloha": 959,
    "aloha can": 960,
    "hotel please": 961,
    "aloha can you": 962,
    "find a hotel": 963,
    "a hotel please": 964,
    "sure": 965,
    "something": 966,
    "am not": 967,
    "not sure": 968,
    "sure but": 969,
    "for something": 970,
    "something in": 971,
    "price rating": 972,
    "rating with": 973,
    "with 4": 974,
    "i am not": 975,
    "am not sure": 976,
    "not sure but": 977,
    "sure but i": 978,
    "but i am": 979,
    "looking for something": 980,
    "for something in": 981,
    "something in the": 982,
    "cheap price rating": 983,
    "price rating with": 984,
    "rating with 4": 985,
    "with 4 stars": 986,
    "need free": 987,
    "i need free": 988,
    "need free parking": 989,
    "into": 990,
    "like you": 991,
    "you to": 992,
    "to book": 993,
    "book me": 994,
    "me into": 995,
    "into the": 996,
    "hotel for": 997,
    "for tuesday": 998,
    "tuesday for": 999,
    "nights and": 1000,
    "and 2": 1001,
    "2 people": 1002,
    "would like you": 1003,
    "like you to": 1004,
    "you to book": 1005,
    "to book me": 1006,
    "book me into": 1007,
    "me into the": 1008,
    "into the hotel": 1009,
    "the hotel for": 1010,
    "hotel for tuesday": 1011,
    "for tuesday for": 1012,
    "tuesday for 5": 1013,
    "for 5 nights": 1014,
    "5 nights and": 1015,
    "nights and 2": 1016,
    "and 2 people": 1017,
    "not that": 1018,
    "is it": 1019,
    "it thank": 1020,
    "not that is": 1021,
    "that is it": 1022,
    "is it thank": 1023,
    "it thank you": 1024,
    "near": 1025,
    "mall": 1026,
    "indoor": 1027,
    "even": 1028,
    "include": 1029,
    "internet": 1030,
    "hotel near": 1031,
    "near the": 1032,
    "the mall": 1033,
    "mall the": 1034,
    "should has": 1035,
    "free indoor": 1036,
    "indoor parking": 1037,
    "parking even": 1038,
    "even it": 1039,
    "not include": 1040,
    "include internet": 1041,
    "a hotel near": 1042,
    "hotel near the": 1043,
    "near the mall": 1044,
    "the mall the": 1045,
    "mall the hotel": 1046,
    "hotel should has": 1047,
    "should has free": 1048,
    "has free indoor": 1049,
    "free indoor parking": 1050,
    "indoor parking even": 1051,
    "parking even it": 1052,
    "even it does": 1053,
    "does not include": 1054,
    "not include internet": 1055,
    "which": 1056,
    "closest": 1057,
    "to be": 1058,
    "area with": 1059,
    "with the": 1060,
    "mall which": 1061,
    "which hotel": 1062,
    "hotel is": 1063,
    "the closest": 1064,
    "closest to": 1065,
    "to the": 1066,
    "want to be": 1067,
    "to be in": 1068,
    "in the area": 1069,
    "the area with": 1070,
    "area with the": 1071,
    "with the mall": 1072,
    "the mall which": 1073,
    "mall which hotel": 1074,
    "which hotel is": 1075,
    "hotel is the": 1076,
    "is the closest": 1077,
    "the closest to": 1078,
    "closest to the": 1079,
    "to the mall": 1080,
    "either": 1081,
    "do either": 1082,
    "either of": 1083,
    "those hotel": 1084,
    "hotel -s": 1085,
    "-s have": 1086,
    "do either of": 1087,
    "either of those": 1088,
    "of those hotel": 1089,
    "those hotel -s": 1090,
    "hotel -s have": 1091,
    "-s have free": 1092,
    "have free wifi": 1093,
    "booking": 1094,
    "gonville": 1095,
    "will try": 1096,
    "try booking": 1097,
    "booking at": 1098,
    "at the": 1099,
    "the gonville": 1100,
    "gonville for": 1101,
    "for 3": 1102,
    "3 people": 1103,
    "and 4": 1104,
    "4 nights": 1105,
    "from sunday": 1106,
    "i will try": 1107,
    "will try booking": 1108,
    "try booking at": 1109,
    "booking at the": 1110,
    "at the gonville": 1111,
    "the gonville for": 1112,
    "gonville for 3": 1113,
    "for 3 people": 1114,
    "3 people and": 1115,
    "people and 4": 1116,
    "and 4 nights": 1117,
    "4 nights starting": 1118,
    "starting from sunday": 1119,
    "covers": 1120,
    "that covers": 1121,
    "covers it": 1122,
    "think that covers": 1123,
    "that covers it": 1124,
    "covers it thank": 1125,
    "lovell": 1126,
    "lodge": 1127,
    "do you": 1128,
    "you have": 1129,
    "have information": 1130,
    "information about": 1131,
    "the lovell": 1132,
    "lovell lodge": 1133,
    "do you have": 1134,
    "you have information": 1135,
    "have information about": 1136,
    "information about the": 1137,
    "about the lovell": 1138,
    "the lovell lodge": 1139,
    "postcode": 1140,
    "determine": 1141,
    "location": 1142,
    "the postcode": 1143,
    "postcode for": 1144,
    "lodge please": 1145,
    "please i": 1146,
    "to determine": 1147,
    "determine the": 1148,
    "the location": 1149,
    "is the postcode": 1150,
    "the postcode for": 1151,
    "postcode for the": 1152,
    "for the lovell": 1153,
    "lovell lodge please": 1154,
    "lodge please i": 1155,
    "please i want": 1156,
    "want to determine": 1157,
    "to determine the": 1158,
    "determine the location": 1159,
    "thanks": 1160,
    "so": 1161,
    "that 'll": 1162,
    "'ll do": 1163,
    "do it": 1164,
    "it thanks": 1165,
    "thanks so": 1166,
    "so much": 1167,
    "much for": 1168,
    "no that 'll": 1169,
    "that 'll do": 1170,
    "'ll do it": 1171,
    "do it thanks": 1172,
    "it thanks so": 1173,
    "thanks so much": 1174,
    "so much for": 1175,
    "much for your": 1176,
    "warkworth": 1177,
    "house": 1178,
    "if warkworth": 1179,
    "warkworth house": 1180,
    "house hotel": 1181,
    "hotel has": 1182,
    "has wifi": 1183,
    "me if warkworth": 1184,
    "if warkworth house": 1185,
    "warkworth house hotel": 1186,
    "house hotel has": 1187,
    "hotel has wifi": 1188,
    "their": 1189,
    "phone": 1190,
    "and what": 1191,
    "is their": 1192,
    "their phone": 1193,
    "phone number": 1194,
    "parking and what": 1195,
    "and what is": 1196,
    "what is their": 1197,
    "is their phone": 1198,
    "their phone number": 1199,
    "trying": 1200,
    "name": 1201,
    "yes i": 1202,
    "am trying": 1203,
    "trying to": 1204,
    "hotel by": 1205,
    "by the": 1206,
    "the name": 1207,
    "name of": 1208,
    "allenbell can": 1209,
    "yes i am": 1210,
    "i am trying": 1211,
    "am trying to": 1212,
    "trying to find": 1213,
    "a hotel by": 1214,
    "hotel by the": 1215,
    "by the name": 1216,
    "the name of": 1217,
    "name of allenbell": 1218,
    "of allenbell can": 1219,
    "allenbell can you": 1220,
    "8": 1221,
    "for 8": 1222,
    "8 people": 1223,
    "from tuesday": 1224,
    "yes i would": 1225,
    "like to book": 1226,
    "to book it": 1227,
    "it for 8": 1228,
    "for 8 people": 1229,
    "8 people and": 1230,
    "starting from tuesday": 1231,
    "no thank": 1232,
    "you thanks": 1233,
    "thanks for": 1234,
    "no thank you": 1235,
    "thank you thanks": 1236,
    "you thanks for": 1237,
    "thanks for your": 1238,
    "happen": 1239,
    "would you": 1240,
    "you happen": 1241,
    "happen to": 1242,
    "information on": 1243,
    "on the": 1244,
    "would you happen": 1245,
    "you happen to": 1246,
    "happen to have": 1247,
    "to have information": 1248,
    "have information on": 1249,
    "information on the": 1250,
    "on the lovell": 1251,
    "get": 1252,
    "address": 1253,
    "i get": 1254,
    "get the": 1255,
    "the phone": 1256,
    "number and": 1257,
    "and address": 1258,
    "address please": 1259,
    "can i get": 1260,
    "i get the": 1261,
    "get the phone": 1262,
    "the phone number": 1263,
    "phone number and": 1264,
    "number and address": 1265,
    "and address please": 1266,
    "you that": 1267,
    "thank you that": 1268,
    "you that is": 1269,
    "hello": 1270,
    "hello i": 1271,
    "wifi and": 1272,
    "and free": 1273,
    "hello i am": 1274,
    "free wifi and": 1275,
    "wifi and free": 1276,
    "and free parking": 1277,
    "range please": 1278,
    "price range please": 1279,
    "too": 1280,
    "could": 1281,
    "make": 1282,
    "reservation": 1283,
    "person": 1284,
    "area too": 1285,
    "too much": 1286,
    "much could": 1287,
    "could you": 1288,
    "please make": 1289,
    "make a": 1290,
    "a reservation": 1291,
    "reservation for": 1292,
    "1 person": 1293,
    "person starting": 1294,
    "starting thursday": 1295,
    "care about the": 1296,
    "about the area": 1297,
    "the area too": 1298,
    "area too much": 1299,
    "too much could": 1300,
    "much could you": 1301,
    "could you please": 1302,
    "you please make": 1303,
    "please make a": 1304,
    "make a reservation": 1305,
    "a reservation for": 1306,
    "reservation for 1": 1307,
    "for 1 person": 1308,
    "1 person starting": 1309,
    "person starting thursday": 1310,
    "starting thursday for": 1311,
    "quality": 1312,
    "gonville a": 1313,
    "a good": 1314,
    "good quality": 1315,
    "quality hotel": 1316,
    "is the gonville": 1317,
    "the gonville a": 1318,
    "gonville a good": 1319,
    "a good quality": 1320,
    "good quality hotel": 1321,
    "was": 1322,
    "that was": 1323,
    "was all": 1324,
    "that was all": 1325,
    "was all thank": 1326,
    "included": 1327,
    "hotel that": 1328,
    "has 4": 1329,
    "stars and": 1330,
    "and included": 1331,
    "included free": 1332,
    "like to find": 1333,
    "a hotel that": 1334,
    "hotel that has": 1335,
    "that has 4": 1336,
    "has 4 stars": 1337,
    "4 stars and": 1338,
    "stars and included": 1339,
    "and included free": 1340,
    "included free parking": 1341,
    "should have": 1342,
    "have a": 1343,
    "of 4": 1344,
    "4 and": 1345,
    "should include": 1346,
    "include free": 1347,
    "hotel should have": 1348,
    "should have a": 1349,
    "have a star": 1350,
    "a star of": 1351,
    "star of 4": 1352,
    "of 4 and": 1353,
    "4 and should": 1354,
    "and should include": 1355,
    "should include free": 1356,
    "include free parking": 1357,
    "saturday": 1358,
    "please 8": 1359,
    "people for": 1360,
    "2 nights": 1361,
    "starting on": 1362,
    "on saturday": 1363,
    "yes please 8": 1364,
    "please 8 people": 1365,
    "8 people for": 1366,
    "people for 2": 1367,
    "for 2 nights": 1368,
    "2 nights starting": 1369,
    "nights starting on": 1370,
    "starting on saturday": 1371,
    "needed": 1372,
    "i needed": 1373,
    "all i needed": 1374,
    "zero": 1375,
    "and zero": 1376,
    "zero stars": 1377,
    "parking and zero": 1378,
    "and zero stars": 1379,
    "anything": 1380,
    "have anything": 1381,
    "anything in": 1382,
    "you have anything": 1383,
    "have anything in": 1384,
    "anything in the": 1385,
    "instead": 1386,
    "then": 1387,
    "no can": 1388,
    "please check": 1389,
    "check in": 1390,
    "north instead": 1391,
    "instead then": 1392,
    "no can you": 1393,
    "you please check": 1394,
    "please check in": 1395,
    "check in the": 1396,
    "the north instead": 1397,
    "north instead then": 1398,
    "we": 1399,
    "to make": 1400,
    "reservation on": 1401,
    "saturday for": 1402,
    "and we": 1403,
    "we will": 1404,
    "be staying": 1405,
    "like to make": 1406,
    "to make a": 1407,
    "a reservation on": 1408,
    "reservation on saturday": 1409,
    "on saturday for": 1410,
    "saturday for 6": 1411,
    "6 people and": 1412,
    "people and we": 1413,
    "and we will": 1414,
    "we will be": 1415,
    "will be staying": 1416,
    "be staying for": 1417,
    "same": 1418,
    "like something": 1419,
    "the same": 1420,
    "same price": 1421,
    "would like something": 1422,
    "like something in": 1423,
    "in the same": 1424,
    "the same price": 1425,
    "same price range": 1426,
    "change": 1427,
    "other": 1428,
    "criteria": 1429,
    "as": 1430,
    "city": 1431,
    "bed": 1432,
    "breakfast": 1433,
    "you can": 1434,
    "can change": 1435,
    "change any": 1436,
    "any other": 1437,
    "other criteria": 1438,
    "criteria but": 1439,
    "but the": 1440,
    "range should": 1441,
    "be the": 1442,
    "same as": 1443,
    "as the": 1444,
    "the city": 1445,
    "city centre": 1446,
    "centre north": 1447,
    "north bed": 1448,
    "bed and": 1449,
    "and breakfast": 1450,
    "breakfast please": 1451,
    "please try": 1452,
    "try again": 1453,
    "you can change": 1454,
    "can change any": 1455,
    "change any other": 1456,
    "any other criteria": 1457,
    "other criteria but": 1458,
    "criteria but the": 1459,
    "but the price": 1460,
    "the price range": 1461,
    "price range should": 1462,
    "range should be": 1463,
    "should be the": 1464,
    "be the same": 1465,
    "the same as": 1466,
    "same as the": 1467,
    "as the city": 1468,
    "the city centre": 1469,
    "city centre north": 1470,
    "centre north bed": 1471,
    "north bed and": 1472,
    "bed and breakfast": 1473,
    "and breakfast please": 1474,
    "breakfast please try": 1475,
    "please try again": 1476,
    "is great": 1477,
    "great thanks": 1478,
    "thanks do": 1479,
    "have their": 1480,
    "their address": 1481,
    "that is great": 1482,
    "is great thanks": 1483,
    "great thanks do": 1484,
    "thanks do you": 1485,
    "you have their": 1486,
    "have their address": 1487,
    "set": 1488,
    "here": 1489,
    "ok i": 1490,
    "am all": 1491,
    "all set": 1492,
    "set here": 1493,
    "here thanks": 1494,
    "ok i am": 1495,
    "i am all": 1496,
    "am all set": 1497,
    "all set here": 1498,
    "set here thanks": 1499,
    "here thanks for": 1500,
    "particular": 1501,
    "you find": 1502,
    "find me": 1503,
    "me a": 1504,
    "a particular": 1505,
    "particular hotel": 1506,
    "can you find": 1507,
    "you find me": 1508,
    "find me a": 1509,
    "me a particular": 1510,
    "a particular hotel": 1511,
    "particular hotel please": 1512,
    "the warkworth": 1513,
    "house i": 1514,
    "it starting": 1515,
    "sunday for": 1516,
    "nights for": 1517,
    "looking for the": 1518,
    "for the warkworth": 1519,
    "the warkworth house": 1520,
    "warkworth house i": 1521,
    "house i would": 1522,
    "book it starting": 1523,
    "it starting sunday": 1524,
    "starting sunday for": 1525,
    "sunday for 3": 1526,
    "for 3 nights": 1527,
    "3 nights for": 1528,
    "nights for 2": 1529,
    "for 2 people": 1530,
    "yeah": 1531,
    "yeah that": 1532,
    "is okay": 1533,
    "yeah that is": 1534,
    "that is okay": 1535,
    "is okay please": 1536,
    "okay please book": 1537,
    "it for 2": 1538,
    "2 people and": 1539,
    "nights starting sunday": 1540,
    "look": 1541,
    "different": 1542,
    "please look": 1543,
    "look for": 1544,
    "a different": 1545,
    "different hotel": 1546,
    "please look for": 1547,
    "look for a": 1548,
    "for a different": 1549,
    "a different hotel": 1550,
    "different hotel in": 1551,
    "of your": 1552,
    "much for all": 1553,
    "for all of": 1554,
    "all of your": 1555,
    "of your help": 1556,
    "give": 1557,
    "huntingdon": 1558,
    "marriott": 1559,
    "yes can": 1560,
    "you give": 1561,
    "give me": 1562,
    "me the": 1563,
    "the huntingdon": 1564,
    "huntingdon marriott": 1565,
    "marriott hotel": 1566,
    "yes can you": 1567,
    "can you give": 1568,
    "you give me": 1569,
    "give me the": 1570,
    "me the information": 1571,
    "the information on": 1572,
    "on the huntingdon": 1573,
    "the huntingdon marriott": 1574,
    "huntingdon marriott hotel": 1575,
    "yes please i": 1576,
    "please i need": 1577,
    "need a reservation": 1578,
    "reservation for 6": 1579,
    "6 people for": 1580,
    "people for 5": 1581,
    "how": 1582,
    "works": 1583,
    "course": 1584,
    "how about": 1585,
    "about for": 1586,
    "night if": 1587,
    "if that": 1588,
    "that works": 1589,
    "works i": 1590,
    "i 'll": 1591,
    "'ll need": 1592,
    "a reference": 1593,
    "number of": 1594,
    "of course": 1595,
    "how about for": 1596,
    "about for 1": 1597,
    "1 night if": 1598,
    "night if that": 1599,
    "if that works": 1600,
    "that works i": 1601,
    "works i 'll": 1602,
    "i 'll need": 1603,
    "'ll need a": 1604,
    "need a reference": 1605,
    "a reference number": 1606,
    "reference number of": 1607,
    "number of course": 1608,
    "you so": 1609,
    "much goodbye": 1610,
    "thank you so": 1611,
    "you so much": 1612,
    "so much goodbye": 1613,
    "parking please": 1614,
    "guesthouse with free": 1615,
    "free parking please": 1616,
    "well": 1617,
    "no but": 1618,
    "do need": 1619,
    "wifi as": 1620,
    "as well": 1621,
    "well as": 1622,
    "as free": 1623,
    "no but i": 1624,
    "but i do": 1625,
    "i do need": 1626,
    "do need free": 1627,
    "need free wifi": 1628,
    "free wifi as": 1629,
    "wifi as well": 1630,
    "as well as": 1631,
    "well as free": 1632,
    "as free parking": 1633,
    "flexible": 1634,
    "no the": 1635,
    "range is": 1636,
    "is flexible": 1637,
    "flexible i": 1638,
    "room on": 1639,
    "on wednesday": 1640,
    "wednesday for": 1641,
    "people 2": 1642,
    "no the price": 1643,
    "price range is": 1644,
    "range is flexible": 1645,
    "is flexible i": 1646,
    "flexible i would": 1647,
    "to book a": 1648,
    "a room on": 1649,
    "room on wednesday": 1650,
    "on wednesday for": 1651,
    "wednesday for 2": 1652,
    "2 people 2": 1653,
    "people 2 nights": 1654,
    "will do": 1655,
    "do and": 1656,
    "and that": 1657,
    "is for": 1658,
    "starting wednesday": 1659,
    "that will do": 1660,
    "will do and": 1661,
    "do and that": 1662,
    "and that is": 1663,
    "that is for": 1664,
    "is for 2": 1665,
    "2 people for": 1666,
    "nights starting wednesday": 1667,
    "sure let": 1668,
    "try for": 1669,
    "for just": 1670,
    "just 1": 1671,
    "night and": 1672,
    "and see": 1673,
    "works please": 1674,
    "sure let 's": 1675,
    "'s try for": 1676,
    "try for just": 1677,
    "for just 1": 1678,
    "just 1 night": 1679,
    "1 night and": 1680,
    "night and see": 1681,
    "and see if": 1682,
    "see if that": 1683,
    "that works please": 1684,
    "number please": 1685,
    "reference number please": 1686,
    "bye": 1687,
    "help i": 1688,
    "set bye": 1689,
    "your help i": 1690,
    "help i am": 1691,
    "all set bye": 1692,
    "some": 1693,
    "acorn": 1694,
    "guest": 1695,
    "looking to": 1696,
    "to get": 1697,
    "get some": 1698,
    "some information": 1699,
    "the acorn": 1700,
    "acorn guest": 1701,
    "guest house": 1702,
    "am looking to": 1703,
    "looking to get": 1704,
    "to get some": 1705,
    "get some information": 1706,
    "some information on": 1707,
    "on the acorn": 1708,
    "the acorn guest": 1709,
    "acorn guest house": 1710,
    "beginning": 1711,
    "is there": 1712,
    "there a": 1713,
    "room available": 1714,
    "a 5": 1715,
    "5 night": 1716,
    "night stay": 1717,
    "stay beginning": 1718,
    "beginning friday": 1719,
    "is there a": 1720,
    "there a room": 1721,
    "a room available": 1722,
    "room available for": 1723,
    "available for a": 1724,
    "for a 5": 1725,
    "a 5 night": 1726,
    "5 night stay": 1727,
    "night stay beginning": 1728,
    "stay beginning friday": 1729,
    "just for": 1730,
    "person thanks": 1731,
    "just for 1": 1732,
    "1 person thanks": 1733,
    "yes in": 1734,
    "please include": 1735,
    "include reference": 1736,
    "yes in the": 1737,
    "range please include": 1738,
    "please include reference": 1739,
    "include reference number": 1740,
    "area of": 1741,
    "the area of": 1742,
    "area of the": 1743,
    "of the acorn": 1744,
    "yes thank": 1745,
    "yes thank you": 1746,
    "alpha": 1747,
    "milton": 1748,
    "the alpha": 1749,
    "alpha milton": 1750,
    "milton guest": 1751,
    "on the alpha": 1752,
    "the alpha milton": 1753,
    "alpha milton guest": 1754,
    "milton guest house": 1755,
    "help goodbye": 1756,
    "very much for": 1757,
    "your help goodbye": 1758,
    "handle": 1759,
    "particular bed": 1760,
    "breakfast do": 1761,
    "you handle": 1762,
    "handle those": 1763,
    "for a particular": 1764,
    "a particular bed": 1765,
    "particular bed and": 1766,
    "and breakfast do": 1767,
    "breakfast do you": 1768,
    "do you handle": 1769,
    "you handle those": 1770,
    "oh": 1771,
    "dear": 1772,
    "local": 1773,
    "houses": 1774,
    "staring": 1775,
    "monday": 1776,
    "oh dear": 1777,
    "dear well": 1778,
    "well what": 1779,
    "what about": 1780,
    "about local": 1781,
    "local guest": 1782,
    "guest houses": 1783,
    "houses instead": 1784,
    "instead i": 1785,
    "nights staring": 1786,
    "staring from": 1787,
    "from monday": 1788,
    "oh dear well": 1789,
    "dear well what": 1790,
    "well what about": 1791,
    "what about local": 1792,
    "about local guest": 1793,
    "local guest houses": 1794,
    "guest houses instead": 1795,
    "houses instead i": 1796,
    "instead i need": 1797,
    "need to book": 1798,
    "it for 6": 1799,
    "5 nights staring": 1800,
    "nights staring from": 1801,
    "staring from monday": 1802,
    "called": 1803,
    "rosa": 1804,
    "hotel called": 1805,
    "called rosa": 1806,
    "rosa 's": 1807,
    "'s bed": 1808,
    "a hotel called": 1809,
    "hotel called rosa": 1810,
    "called rosa 's": 1811,
    "rosa 's bed": 1812,
    "'s bed and": 1813,
    "please for": 1814,
    "on monday": 1815,
    "yes please for": 1816,
    "please for 6": 1817,
    "starting on monday": 1818,
    "perfect": 1819,
    "perfect that": 1820,
    "need thanks": 1821,
    "perfect that is": 1822,
    "i need thanks": 1823,
    "needs": 1824,
    "no it": 1825,
    "it just": 1826,
    "just needs": 1827,
    "needs to": 1828,
    "be cheap": 1829,
    "no it just": 1830,
    "it just needs": 1831,
    "just needs to": 1832,
    "needs to be": 1833,
    "to be cheap": 1834,
    "good can": 1835,
    "get it": 1836,
    "for 7": 1837,
    "7 people": 1838,
    "nights from": 1839,
    "from thursday": 1840,
    "thursday please": 1841,
    "sounds good can": 1842,
    "good can i": 1843,
    "i get it": 1844,
    "get it for": 1845,
    "it for 7": 1846,
    "for 7 people": 1847,
    "7 people and": 1848,
    "4 nights from": 1849,
    "nights from thursday": 1850,
    "from thursday please": 1851,
    "ok try": 1852,
    "ok try for": 1853,
    "try for 2": 1854,
    "needed thanks": 1855,
    "thanks again": 1856,
    "no that was": 1857,
    "was all i": 1858,
    "i needed thanks": 1859,
    "needed thanks again": 1860,
    "5 star": 1861,
    "hotel to": 1862,
    "in that": 1863,
    "that should": 1864,
    "be a": 1865,
    "need a 5": 1866,
    "a 5 star": 1867,
    "5 star hotel": 1868,
    "star hotel to": 1869,
    "hotel to stay": 1870,
    "stay in that": 1871,
    "in that should": 1872,
    "that should be": 1873,
    "should be a": 1874,
    "be a guesthouse": 1875,
    "about a": 1876,
    "star place": 1877,
    "what about a": 1878,
    "about a 4": 1879,
    "4 star place": 1880,
    "long": 1881,
    "matter as": 1882,
    "as long": 1883,
    "long as": 1884,
    "as it": 1885,
    "it is": 1886,
    "star guesthouse": 1887,
    "wifi i": 1888,
    "will want": 1889,
    "it from": 1890,
    "not matter as": 1891,
    "matter as long": 1892,
    "as long as": 1893,
    "long as it": 1894,
    "as it is": 1895,
    "it is a": 1896,
    "is a 4": 1897,
    "4 star guesthouse": 1898,
    "star guesthouse with": 1899,
    "free wifi i": 1900,
    "wifi i will": 1901,
    "i will want": 1902,
    "will want to": 1903,
    "want to book": 1904,
    "book it from": 1905,
    "it from monday": 1906,
    "trip": 1907,
    "is just": 1908,
    "just me": 1909,
    "me this": 1910,
    "this trip": 1911,
    "trip and": 1912,
    "be there": 1913,
    "there for": 1914,
    "it is just": 1915,
    "is just me": 1916,
    "just me this": 1917,
    "me this trip": 1918,
    "this trip and": 1919,
    "trip and i": 1920,
    "and i 'll": 1921,
    "i 'll be": 1922,
    "'ll be there": 1923,
    "be there for": 1924,
    "there for 3": 1925,
    "'ll be arriving": 1926,
    "arriving on monday": 1927,
    "beside": 1928,
    "as i": 1929,
    "need anything": 1930,
    "anything beside": 1931,
    "beside the": 1932,
    "number thanks": 1933,
    "long as i": 1934,
    "as i do": 1935,
    "do not need": 1936,
    "not need anything": 1937,
    "need anything beside": 1938,
    "anything beside the": 1939,
    "beside the reference": 1940,
    "reference number thanks": 1941,
    "or": 1942,
    "cambridge": 1943,
    "hello there": 1944,
    "there can": 1945,
    "if there": 1946,
    "there are": 1947,
    "any 4": 1948,
    "-s or": 1949,
    "or guesthouses": 1950,
    "in cambridge": 1951,
    "cambridge that": 1952,
    "that are": 1953,
    "are cheap": 1954,
    "hello there can": 1955,
    "there can you": 1956,
    "me if there": 1957,
    "if there are": 1958,
    "there are any": 1959,
    "are any 4": 1960,
    "any 4 star": 1961,
    "star hotel -s": 1962,
    "hotel -s or": 1963,
    "-s or guesthouses": 1964,
    "or guesthouses in": 1965,
    "guesthouses in cambridge": 1966,
    "in cambridge that": 1967,
    "cambridge that are": 1968,
    "that are cheap": 1969,
    "hoping": 1970,
    "am hoping": 1971,
    "hoping it": 1972,
    "i am hoping": 1973,
    "am hoping it": 1974,
    "hoping it is": 1975,
    "recommend": 1976,
    "no as": 1977,
    "is cheap": 1978,
    "cheap and": 1979,
    "and have": 1980,
    "have 4": 1981,
    "stars can": 1982,
    "you recommend": 1983,
    "recommend me": 1984,
    "me 1": 1985,
    "1 and": 1986,
    "and book": 1987,
    "no as long": 1988,
    "it is cheap": 1989,
    "is cheap and": 1990,
    "cheap and have": 1991,
    "and have 4": 1992,
    "have 4 stars": 1993,
    "4 stars can": 1994,
    "stars can you": 1995,
    "can you recommend": 1996,
    "you recommend me": 1997,
    "recommend me 1": 1998,
    "me 1 and": 1999,
    "1 and book": 2000,
    "and book it": 2001,
    "nights starting thursday": 2002,
    "great what": 2003,
    "what was": 2004,
    "was the": 2005,
    "number for": 2006,
    "the booking": 2007,
    "great what was": 2008,
    "what was the": 2009,
    "was the reference": 2010,
    "reference number for": 2011,
    "number for the": 2012,
    "for the booking": 2013,
    "forward": 2014,
    "ok thanks": 2015,
    "i look": 2016,
    "look forward": 2017,
    "forward to": 2018,
    "the stay": 2019,
    "ok thanks for": 2020,
    "help i look": 2021,
    "i look forward": 2022,
    "look forward to": 2023,
    "forward to the": 2024,
    "to the stay": 2025,
    "all thanks": 2026,
    "is all thanks": 2027,
    "hi": 2028,
    "hi i": 2029,
    "the are": 2030,
    "are that": 2031,
    "that include": 2032,
    "include -s": 2033,
    "-s free": 2034,
    "hi i am": 2035,
    "in the are": 2036,
    "the are that": 2037,
    "are that include": 2038,
    "that include -s": 2039,
    "include -s free": 2040,
    "-s free wifi": 2041,
    "west": 2042,
    "an": 2043,
    "the west": 2044,
    "west and": 2045,
    "and it": 2046,
    "it would": 2047,
    "would be": 2048,
    "be great": 2049,
    "great if": 2050,
    "it was": 2051,
    "was an": 2052,
    "an expensive": 2053,
    "expensive hotel": 2054,
    "like to be": 2055,
    "in the west": 2056,
    "the west and": 2057,
    "west and it": 2058,
    "and it would": 2059,
    "it would be": 2060,
    "would be great": 2061,
    "be great if": 2062,
    "great if it": 2063,
    "if it was": 2064,
    "it was an": 2065,
    "was an expensive": 2066,
