{
  "none": 0,
  "taxi-request(dest)": 1,
  "taxi-request(leave)": 2,
  "taxi-inform(car)": 3,
  "taxi-inform(phone)": 4,
  "general-reqmore(none)": 5,
  "hotel-request(price)": 6,
  "hotel-inform(choice)": 7,
  "hotel-inform(price)": 8,
  "hotel-recommend(name)": 9,
  "booking-inform(none)": 10,
  "hotel-inform(type)": 11,
  "booking-request(people)": 12,
  "booking-request(stay)": 13,
  "booking-request(day)": 14,
  "booking-nobook(none)": 15,
  "booking-book(ref)": 16,
  "hotel-request(area)": 17,
  "hotel-inform(parking)": 18,
  "hotel-select(none)": 19,
  "hotel-inform(ref)": 20,
  "booking-book(name)": 21,
  "attraction-request(area)": 22,
  "attraction-inform(type)": 23,
  "attraction-inform(choice)": 24,
  "attraction-recommend(name)": 25,
  "attraction-inform(phone)": 26,
  "taxi-request(depart)": 27,
  "attraction-request(type)": 28,
  "attraction-select(area)": 29,
  "attraction-select(type)": 30,
  "attraction-inform(name)": 31,
  "attraction-inform(addr)": 32,
  "attraction-inform(post)": 33,
  "general-welcome(none)": 34,
  "hotel-inform(name)": 35,
  "hotel-inform(area)": 36,
  "hotel-inform(stars)": 37,
  "taxi-request(arrive)": 38,
  "restaurant-request(area)": 39,
  "restaurant-inform(choice)": 40,
  "restaurant-inform(price)": 41,
  "restaurant-inform(addr)": 42,
  "restaurant-inform(name)": 43,
  "restaurant-inform(food)": 44,
  "restaurant-inform(phone)": 45,
  "restaurant-inform(area)": 46,
  "restaurant-request(food)": 47,
  "restaurant-nooffer(none)": 48,
  "hotel-inform(internet)": 49,
  "restaurant-request(price)": 50,
  "restaurant-inform(post)": 51,
  "booking-request(time)": 52,
  "booking-book(day)": 53,
  "restaurant-select(food)": 54,
  "restaurant-recommend(name)": 55,
  "restaurant-recommend(food)": 56,
  "hotel-select(price)": 57,
  "booking-book(people)": 58,
  "taxi-inform(dest)": 59,
  "taxi-inform(arrive)": 60,
  "restaurant-select(none)": 61,
  "restaurant-inform(ref)": 62,
  "restaurant-recommend(price)": 63,
  "restaurant-recommend(area)": 64,
  "booking-inform(name)": 65,
  "hotel-inform(post)": 66,
  "hotel-inform(addr)": 67,
  "hotel-nooffer(none)": 68,
  "booking-nobook(name)": 69,
  "hotel-request(parking)": 70,
  "hotel-request(stars)": 71,
  "booking-book(stay)": 72,
  "hotel-request(internet)": 73,
  "general-bye(none)": 74,
  "booking-nobook(stay)": 75,
  "booking-nobook(day)": 76,
  "hotel-request(type)": 77,
  "hotel-request(name)": 78,
  "hotel-inform(phone)": 79,
  "general-greet(none)": 80,
  "booking-nobook(time)": 81,
  "booking-book(time)": 82,
  "restaurant-request(name)": 83,
  "attraction-inform(fee)": 84,
  "attraction-inform(area)": 85,
  "attraction-recommend(fee)": 86,
  "attraction-recommend(addr)": 87,
  "attraction-recommend(type)": 88,
  "attraction-recommend(post)": 89,
  "booking-book(none)": 90,
  "hotel-nooffer(internet)": 91,
  "hotel-nooffer(type)": 92,
  "hotel-nooffer(parking)": 93,
  "hotel-select(type)": 94,
  "hotel-recommend(price)": 95,
  "hotel-recommend(internet)": 96,
  "hotel-recommend(parking)": 97,
  "hotel-recommend(stars)": 98,
  "hotel-inform(none)": 99,
  "restaurant-select(area)": 100,
  "attraction-inform(open)": 101,
  "booking-inform(people)": 102,
  "booking-inform(stay)": 103,
  "booking-inform(day)": 104,
  "taxi-inform(leave)": 105,
  "hotel-select(area)": 106,
  "hotel-nooffer(stars)": 107,
  "hotel-nooffer(area)": 108,
  "hotel-recommend(addr)": 109,
  "hotel-recommend(area)": 110,
  "hotel-recommend(type)": 111,
  "restaurant-nooffer(food)": 112,
  "restaurant-nooffer(area)": 113,
  "attraction-inform(price)": 114,
  "restaurant-recommend(addr)": 115,
  "attraction-select(name)": 116,
  "restaurant-select(name)": 117,
  "hotel-nooffer(price)": 118,
  "restaurant-select(addr)": 119,
  "restaurant-recommend(post)": 120,
  "taxi-inform(depart)": 121,
  "restaurant-nooffer(price)": 122,
  "attraction-nooffer(area)": 123,
  "hotel-select(name)": 124,
  "attraction-recommend(area)": 125,
  "hotel-select(choice)": 126,
  "restaurant-recommend(phone)": 127,
  "taxi-inform(none)": 128,
  "attraction-nooffer(type)": 129,
  "booking-inform(time)": 130,
  "restaurant-select(price)": 131,
  "attraction-select(none)": 132,
  "hotel-recommend(phone)": 133,
  "restaurant-inform(none)": 134,
  "attraction-nooffer(none)": 135,
  "attraction-select(fee)": 136,
  "attraction-recommend(phone)": 137,
  "hotel-recommend(choice)": 138,
  "hotel-select(stars)": 139,
  "hotel-select(internet)": 140,
  "hotel-select(parking)": 141,
  "hotel-recommend(post)": 142,
  "hotel-nooffer(choice)": 143,
  "attraction-request(name)": 144,
  "attraction-recommend(choice)": 145,
  "booking-nobook(people)": 146,
  "booking-inform(ref)": 147,
  "attraction-select(choice)": 148,
  "attraction-request(price)": 149,
  "restaurant-select(choice)": 150,
  "restaurant-recommend(none)": 151,
  "attraction-recommend(price)": 152,
  "train-request(depart)": 153,
  "restaurant-recommend(choice)": 154,
  "hotel-recommend(none)": 155,
  "train-inform(depart)": 156,
  "train-inform(dest)": 157,
  "attraction-recommend(open)": 158,
  "attraction-inform(none)": 159
}