{
  "3": {
    "<pad>": 0,
    "</s>": 1,
    "<s>": 2,
    "unk": 3,
    "<dontcare>": 4,
    "<none>": 5,
    "oh": 6,
    ",": 7,
    "yes": 8,
    "i": 9,
    "am": 10,
    "hoping": 11,
    "you": 12,
    "can": 13,
    "help": 14,
    "me": 15,
    "with": 16,
    "finding": 17,
    "a": 18,
    "train": 19,
    "departing": 20,
    "out": 21,
    "of": 22,
    "cambridge": 23,
    ".": 24,
    "no": 25,
    "dontcare": 26,
    "oh yes": 27,
    "yes i": 28,
    "i am": 29,
    "am hoping": 30,
    "hoping you": 31,
    "you can": 32,
    "can help": 33,
    "help me": 34,
    "me with": 35,
    "with finding": 36,
    "finding a": 37,
    "a train": 38,
    "train departing": 39,
    "departing out": 40,
    "out of": 41,
    "of cambridge": 42,
    "oh yes i": 43,
    "yes i am": 44,
    "i am hoping": 45,
    "am hoping you": 46,
    "hoping you can": 47,
    "you can help": 48,
    "can help me": 49,
    "help me with": 50,
    "me with finding": 51,
    "with finding a": 52,
    "finding a train": 53,
    "a train departing": 54,
    "train departing out": 55,
    "departing out of": 56,
    "out of cambridge": 57,
    "need": 58,
    "to": 59,
    "go": 60,
    "birmingham": 61,
    "new": 62,
    "street": 63,
    "i need": 64,
    "need to": 65,
    "to go": 66,
    "go to": 67,
    "to birmingham": 68,
    "birmingham new": 69,
    "new street": 70,
    "i need to": 71,
    "need to go": 72,
    "to go to": 73,
    "go to birmingham": 74,
    "to birmingham new": 75,
    "birmingham new street": 76,
    "would": 77,
    "like": 78,
    "leave": 79,
    "on": 80,
    "sunday": 81,
    "afternoon": 82,
    "after": 83,
    "15:00": 84,
    "i would": 85,
    "would like": 86,
    "like to": 87,
    "to leave": 88,
    "leave on": 89,
    "on sunday": 90,
    "sunday afternoon": 91,
    "afternoon after": 92,
    "after 15:00": 93,
    "i would like": 94,
    "would like to": 95,
    "like to leave": 96,
    "to leave on": 97,
    "leave on sunday": 98,
    "on sunday afternoon": 99,
    "sunday afternoon after": 100,
    "afternoon after 15:00": 101,
    "what": 102,
    "is": 103,
    "the": 104,
    "price": 105,
    "that": 106,
    "?": 107,
    "what is": 108,
    "is the": 109,
    "the price": 110,
    "price on": 111,
    "on that": 112,
    "that train": 113,
    "what is the": 114,
    "is the price": 115,
    "the price on": 116,
    "price on that": 117,
    "on that train": 118,
    "was": 119,
    "all": 120,
    "needed": 121,
    "thank": 122,
    "so": 123,
    "much": 124,
    "for": 125,
    "your": 126,
    "!": 127,
    "no that": 128,
    "that was": 129,
    "was all": 130,
    "all i": 131,
    "i needed": 132,
    "needed thank": 133,
    "thank you": 134,
    "you so": 135,
    "so much": 136,
    "much for": 137,
    "for your": 138,
    "your help": 139,
    "no that was": 140,
    "that was all": 141,
    "was all i": 142,
    "all i needed": 143,
    "i needed thank": 144,
    "needed thank you": 145,
    "thank you so": 146,
    "you so much": 147,
    "so much for": 148,
    "much for your": 149,
    "for your help": 150,
    "looking": 151,
    "should": 152,
    "depart": 153,
    "from": 154,
    "bournemouth": 155,
    "and": 156,
    "am looking": 157,
    "looking for": 158,
    "for a": 159,
    "train the": 160,
    "the train": 161,
    "train should": 162,
    "should depart": 163,
    "depart from": 164,
    "from bournemouth": 165,
    "bournemouth and": 166,
    "and should": 167,
    "should leave": 168,
    "i am looking": 169,
    "am looking for": 170,
    "looking for a": 171,
    "for a train": 172,
    "a train the": 173,
    "train the train": 174,
    "the train should": 175,
    "train should depart": 176,
    "should depart from": 177,
    "depart from bournemouth": 178,
    "from bournemouth and": 179,
    "bournemouth and should": 180,
    "and should leave": 181,
    "should leave on": 182,
    "sorry": 183,
    "misspoke": 184,
    "earlier": 185,
    "actually": 186,
    "broxbourne": 187,
    "am sorry": 188,
    "sorry i": 189,
    "i misspoke": 190,
    "misspoke earlier": 191,
    "earlier i": 192,
    "am actually": 193,
    "actually looking": 194,
    "looking to": 195,
    "leave from": 196,
    "from broxbourne": 197,
    "broxbourne and": 198,
    "and would": 199,
    "to cambridge": 200,
    "i am sorry": 201,
    "am sorry i": 202,
    "sorry i misspoke": 203,
    "i misspoke earlier": 204,
    "misspoke earlier i": 205,
    "earlier i am": 206,
    "i am actually": 207,
    "am actually looking": 208,
    "actually looking to": 209,
    "looking to leave": 210,
    "to leave from": 211,
    "leave from broxbourne": 212,
    "from broxbourne and": 213,
    "broxbourne and would": 214,
    "and would like": 215,
    "like to go": 216,
    "go to cambridge": 217,
    "wow": 218,
    "sounds": 219,
    "might": 220,
    "be": 221,
    "able": 222,
    "then": 223,
    "find": 224,
    "going": 225,
    "into": 226,
    "leicester": 227,
    "wow sounds": 228,
    "sounds like": 229,
    "like you": 230,
    "you might": 231,
    "might be": 232,
    "be able": 233,
    "able to": 234,
    "to help": 235,
    "me then": 236,
    "then can": 237,
    "can you": 238,
    "you find": 239,
    "find me": 240,
    "me a": 241,
    "train going": 242,
    "going into": 243,
    "into leicester": 244,
    "wow sounds like": 245,
    "sounds like you": 246,
    "like you might": 247,
    "you might be": 248,
    "might be able": 249,
    "be able to": 250,
    "able to help": 251,
    "to help me": 252,
    "help me then": 253,
    "me then can": 254,
    "then can you": 255,
    "can you find": 256,
    "you find me": 257,
    "find me a": 258,
    "me a train": 259,
    "a train going": 260,
    "train going into": 261,
    "going into leicester": 262,
    "will": 263,
    "i will": 264,
    "will need": 265,
    "from cambridge": 266,
    "i will need": 267,
    "will need to": 268,
    "need to leave": 269,
    "leave from cambridge": 270,
    "travel": 271,
    "thursday": 272,
    "to travel": 273,
    "travel on": 274,
    "on a": 275,
    "a thursday": 276,
    "like to travel": 277,
    "to travel on": 278,
    "travel on a": 279,
    "on a thursday": 280,
    "just": 281,
    "arrive": 282,
    "by": 283,
    "17:45": 284,
    "i just": 285,
    "just need": 286,
    "to arrive": 287,
    "arrive by": 288,
    "by 17:45": 289,
    "i just need": 290,
    "just need to": 291,
    "need to arrive": 292,
    "to arrive by": 293,
    "arrive by 17:45": 294,
    "total": 295,
    "time": 296,
    "the total": 297,
    "total travel": 298,
    "travel time": 299,
    "time and": 300,
    "and price": 301,
    "is the total": 302,
    "the total travel": 303,
    "total travel time": 304,
    "travel time and": 305,
    "time and price": 306,
    "and price on": 307,
    "perfect": 308,
    "thanks": 309,
    "that sounds": 310,
    "sounds perfect": 311,
    "perfect thanks": 312,
    "thanks for": 313,
    "for all": 314,
    "all your": 315,
    "that sounds perfect": 316,
    "sounds perfect thanks": 317,
    "perfect thanks for": 318,
    "thanks for all": 319,
    "for all your": 320,
    "all your help": 321,
    "not": 322,
    "that is": 323,
    "is not": 324,
    "not needed": 325,
    "that is not": 326,
    "is not needed": 327,
    "not needed thank": 328,
    "could": 329,
    "please": 330,
    "get": 331,
    "could you": 332,
    "you please": 333,
    "please get": 334,
    "get me": 335,
    "could you please": 336,
    "you please get": 337,
    "please get me": 338,
    "get me a": 339,
    "leaving": 340,
    "20:30": 341,
    "am leaving": 342,
    "leaving leicester": 343,
    "leicester and": 344,
    "and i": 345,
    "leave by": 346,
    "by 20:30": 347,
    "i am leaving": 348,
    "am leaving leicester": 349,
    "leaving leicester and": 350,
    "leicester and i": 351,
    "and i need": 352,
    "to leave by": 353,
    "leave by 20:30": 354,
    "friday": 355,
    "cambridge and": 356,
    "and on": 357,
    "on friday": 358,
    "friday can": 359,
    "can i": 360,
    "just get": 361,
    "get the": 362,
    "the travel": 363,
    "time for": 364,
    "for the": 365,
    "train thanks": 366,
    "cambridge and on": 367,
    "and on friday": 368,
    "on friday can": 369,
    "friday can i": 370,
    "can i just": 371,
    "i just get": 372,
    "just get the": 373,
    "get the travel": 374,
    "the travel time": 375,
    "travel time for": 376,
    "time for the": 377,
    "for the train": 378,
    "the train thanks": 379,
    "perfect thank": 380,
    "you for": 381,
    "sounds perfect thank": 382,
    "perfect thank you": 383,
    "thank you for": 384,
    "you for your": 385,
    "ok": 386,
    "'ll": 387,
    "my": 388,
    "tickets": 389,
    "at": 390,
    "station": 391,
    "information": 392,
    "is ok": 393,
    "ok i": 394,
    "i 'll": 395,
    "'ll get": 396,
    "get my": 397,
    "my tickets": 398,
    "tickets at": 399,
    "at the": 400,
    "the station": 401,
    "station i": 402,
    "just needed": 403,
    "needed information": 404,
    "no that is": 405,
    "that is ok": 406,
    "is ok i": 407,
    "ok i 'll": 408,
    "i 'll get": 409,
    "'ll get my": 410,
    "get my tickets": 411,
    "my tickets at": 412,
    "tickets at the": 413,
    "at the station": 414,
    "the station i": 415,
    "station i just": 416,
    "i just needed": 417,
    "just needed information": 418,
    "is all": 419,
    "all thanks": 420,
    "that is all": 421,
    "is all thanks": 422,
    "correcting": 423,
    "have": 424,
    "god": 425,
    "day": 426,
    "for correcting": 427,
    "correcting that": 428,
    "that for": 429,
    "for me": 430,
    "me have": 431,
    "have a": 432,
    "a god": 433,
    "god day": 434,
    "you for correcting": 435,
    "for correcting that": 436,
    "correcting that for": 437,
    "that for me": 438,
    "for me have": 439,
    "me have a": 440,
    "have a god": 441,
    "a god day": 442,
    "it": 443,
    "ely": 444,
    "train it": 445,
    "it should": 446,
    "should go": 447,
    "to ely": 448,
    "a train it": 449,
    "train it should": 450,
    "it should depart": 451,
    "depart from cambridge": 452,
    "from cambridge and": 453,
    "cambridge and should": 454,
    "and should go": 455,
    "should go to": 456,
    "go to ely": 457,
    "wednesday": 458,
    "there": 459,
    "17:15": 460,
    "on wednesday": 461,
    "wednesday and": 462,
    "and get": 463,
    "get there": 464,
    "there by": 465,
    "by 17:15": 466,
    "need to travel": 467,
    "travel on wednesday": 468,
    "on wednesday and": 469,
    "wednesday and get": 470,
    "and get there": 471,
    "get there by": 472,
    "there by 17:15": 473,
    "give": 474,
    "you give": 475,
    "give me": 476,
    "me the": 477,
    "can you give": 478,
    "you give me": 479,
    "give me the": 480,
    "me the price": 481,
    "alright": 482,
    "take": 483,
    "alright i": 484,
    "'ll take": 485,
    "take it": 486,
    "it that": 487,
    "train will": 488,
    "will be": 489,
    "be perfect": 490,
    "alright i 'll": 491,
    "i 'll take": 492,
    "'ll take it": 493,
    "take it that": 494,
    "it that train": 495,
    "that train will": 496,
    "train will be": 497,
    "will be perfect": 498,
    "do": 499,
    "book": 500,
    "now": 501,
    "reference": 502,
    "goodbye": 503,
    "oh i": 504,
    "i do": 505,
    "do not": 506,
    "not need": 507,
    "to book": 508,
    "book now": 509,
    "now i": 510,
    "need the": 511,
    "the information": 512,
    "information for": 513,
    "for reference": 514,
    "reference thank": 515,
    "you goodbye": 516,
    "oh i do": 517,
    "i do not": 518,
    "do not need": 519,
    "not need to": 520,
    "need to book": 521,
    "to book now": 522,
    "book now i": 523,
    "now i just": 524,
    "just need the": 525,
    "need the information": 526,
    "the information for": 527,
    "information for reference": 528,
    "for reference thank": 529,
    "reference thank you": 530,
    "thank you goodbye": 531,
    "hi": 532,
    "stevenage": 533,
    "tell": 534,
    "when": 535,
    "next": 536,
    "hi i": 537,
    "travel stevenage": 538,
    "stevenage from": 539,
    "cambridge by": 540,
    "by train": 541,
    "train could": 542,
    "please tell": 543,
    "tell me": 544,
    "me when": 545,
    "when the": 546,
    "the next": 547,
    "next train": 548,
    "train is": 549,
    "is leaving": 550,
    "hi i would": 551,
    "to travel stevenage": 552,
    "travel stevenage from": 553,
    "stevenage from cambridge": 554,
    "from cambridge by": 555,
    "cambridge by train": 556,
    "by train could": 557,
    "train could you": 558,
    "you please tell": 559,
    "please tell me": 560,
    "tell me when": 561,
    "me when the": 562,
    "when the next": 563,
    "the next train": 564,
    "next train is": 565,
    "train is leaving": 566,
    "saturday": 567,
    "i actually": 568,
    "actually need": 569,
    "on saturday": 570,
    "i actually need": 571,
    "actually need to": 572,
    "leave on saturday": 573,
    "in": 574,
    "traveling": 575,
    "stevanage": 576,
    "want": 577,
    "12:45": 578,
    "am in": 579,
    "in cambridge": 580,
    "cambridge traveling": 581,
    "traveling to": 582,
    "to stevanage": 583,
    "stevanage on": 584,
    "saturday i": 585,
    "i want": 586,
    "want to": 587,
    "arrive in": 588,
    "in stevenage": 589,
    "stevenage by": 590,
    "by 12:45": 591,
    "i am in": 592,
    "am in cambridge": 593,
    "in cambridge traveling": 594,
    "cambridge traveling to": 595,
    "traveling to stevanage": 596,
    "to stevanage on": 597,
    "stevanage on saturday": 598,
    "on saturday i": 599,
    "saturday i want": 600,
    "i want to": 601,
    "want to arrive": 602,
    "to arrive in": 603,
    "arrive in stevenage": 604,
    "in stevenage by": 605,
    "stevenage by 12:45": 606,
    "also": 607,
    "'ll also": 608,
    "also need": 609,
    "time please": 610,
    "i 'll also": 611,
    "'ll also need": 612,
    "also need the": 613,
    "need the travel": 614,
    "travel time please": 615,
    "great": 616,
    "ok great": 617,
    "great thanks": 618,
    "ok great thanks": 619,
    "everything": 620,
    "was everything": 621,
    "everything goodbye": 622,
    "that was everything": 623,
    "was everything goodbye": 624,
    "11:45": 625,
    "to find": 626,
    "find a": 627,
    "train that": 628,
    "is going": 629,
    "going to": 630,
    "by 11:45": 631,
    "need to find": 632,
    "to find a": 633,
    "find a train": 634,
    "a train that": 635,
    "train that is": 636,
    "that is going": 637,
    "is going to": 638,
    "going to arrive": 639,
    "stevenage by 11:45": 640,
    "which": 641,
    "1": 642,
    "which 1": 643,
    "1 would": 644,
    "would you": 645,
    "you like": 646,
    "which 1 would": 647,
    "1 would you": 648,
    "would you like": 649,
    "you like to": 650,
    "like to book": 651,
    "tr6334": 652,
    "id": 653,
    "book tr6334": 654,
    "tr6334 and": 655,
    "train id": 656,
    "id please": 657,
    "book tr6334 and": 658,
    "tr6334 and get": 659,
    "and get me": 660,
    "get me the": 661,
    "me the train": 662,
    "the train id": 663,
    "train id please": 664,
    "make": 665,
    "sure": 666,
    "this": 667,
    "yes book": 668,
    "book 1": 669,
    "1 for": 670,
    "me please": 671,
    "please and": 672,
    "and please": 673,
    "please make": 674,
    "make sure": 675,
    "sure this": 676,
    "this is": 677,
    "is for": 678,
    "for sunday": 679,
    "yes book 1": 680,
    "book 1 for": 681,
    "1 for me": 682,
    "for me please": 683,
    "me please and": 684,
    "please and please": 685,
    "and please make": 686,
    "please make sure": 687,
    "make sure this": 688,
    "sure this is": 689,
    "this is for": 690,
    "is for sunday": 691,
    "did": 692,
    "seat": 693,
    "number": 694,
    "i did": 695,
    "did not": 696,
    "book a": 697,
    "a seat": 698,
    "seat i": 699,
    "needed a": 700,
    "id number": 701,
    "i did not": 702,
    "did not need": 703,
    "to book a": 704,
    "book a seat": 705,
    "a seat i": 706,
    "seat i just": 707,
    "just needed a": 708,
    "needed a train": 709,
    "a train id": 710,
    "train id number": 711,
    "about": 712,
    "confusion": 713,
    "steveage": 714,
    "arrives": 715,
    "sorry about": 716,
    "about the": 717,
    "the confusion": 718,
    "confusion i": 719,
    "need a": 720,
    "train from": 721,
    "from steveage": 722,
    "steveage to": 723,
    "cambridge that": 724,
    "that arrives": 725,
    "arrives by": 726,
    "11:45 i": 727,
    "sorry about the": 728,
    "about the confusion": 729,
    "the confusion i": 730,
    "confusion i just": 731,
    "just need a": 732,
    "need a train": 733,
    "a train from": 734,
    "train from steveage": 735,
    "from steveage to": 736,
    "steveage to cambridge": 737,
    "to cambridge that": 738,
    "cambridge that arrives": 739,
    "that arrives by": 740,
    "arrives by 11:45": 741,
    "by 11:45 i": 742,
    "11:45 i just": 743,
    "need the train": 744,
    "you that": 745,
    "thank you that": 746,
    "you that was": 747,
    "peterborough": 748,
    "train to": 749,
    "to peterborough": 750,
    "like to find": 751,
    "a train to": 752,
    "train to peterborough": 753,
    "arriving": 754,
    "14:30": 755,
    "go from": 756,
    "and go": 757,
    "go on": 758,
    "friday arriving": 759,
    "arriving by": 760,
    "by 14:30": 761,
    "am looking to": 762,
    "looking to go": 763,
    "to go from": 764,
    "go from cambridge": 765,
    "cambridge and go": 766,
    "and go on": 767,
    "go on friday": 768,
    "on friday arriving": 769,
    "friday arriving by": 770,
    "arriving by 14:30": 771,
    "that would": 772,
    "would be": 773,
    "that would be": 774,
    "would be perfect": 775,
    "7": 776,
    "booking": 777,
    "7 tickets": 778,
    "tickets please": 779,
    "please can": 780,
    "i also": 781,
    "also have": 782,
    "have the": 783,
    "the reference": 784,
    "reference number": 785,
    "number for": 786,
    "the booking": 787,
    "7 tickets please": 788,
    "tickets please can": 789,
    "please can i": 790,
    "can i also": 791,
    "i also have": 792,
    "also have the": 793,
    "have the reference": 794,
    "the reference number": 795,
    "reference number for": 796,
    "number for the": 797,
    "for the booking": 798,
    "today": 799,
    "much that": 800,
    "need today": 801,
    "so much that": 802,
    "much that is": 803,
    "is all i": 804,
    "all i will": 805,
    "will need today": 806,
    "from peterborough": 807,
    "i need a": 808,
    "train from peterborough": 809,
    "8:00": 810,
    "am going": 811,
    "and leaving": 812,
    "leaving after": 813,
    "after 8:00": 814,
    "8:00 on": 815,
    "i am going": 816,
    "am going to": 817,
    "going to cambridge": 818,
    "to cambridge and": 819,
    "cambridge and leaving": 820,
    "and leaving after": 821,
    "leaving after 8:00": 822,
    "after 8:00 on": 823,
    "8:00 on friday": 824,
    "5": 825,
    "people": 826,
    "yes please": 827,
    "please book": 828,
    "book it": 829,
    "it for": 830,
    "for 5": 831,
    "5 people": 832,
    "people and": 833,
    "and give": 834,
    "a reference": 835,
    "yes please book": 836,
    "please book it": 837,
    "book it for": 838,
    "it for 5": 839,
    "for 5 people": 840,
    "5 people and": 841,
    "people and give": 842,
    "and give me": 843,
    "give me a": 844,
    "me a reference": 845,
    "a reference number": 846,
    "think": 847,
    "takes": 848,
    "care": 849,
    "i think": 850,
    "think that": 851,
    "that takes": 852,
    "takes care": 853,
    "care of": 854,
    "of everything": 855,
    "everything thanks": 856,
    "i think that": 857,
    "think that takes": 858,
    "that takes care": 859,
    "takes care of": 860,
    "care of everything": 861,
    "of everything thanks": 862,
    "tuesday": 863,
    "arrangements": 864,
    "hi on": 865,
    "on tuesday": 866,
    "tuesday i": 867,
    "leave cambridge": 868,
    "train can": 869,
    "you help": 870,
    "with the": 871,
    "the arrangements": 872,
    "hi on tuesday": 873,
    "on tuesday i": 874,
    "tuesday i need": 875,
    "to leave cambridge": 876,
    "leave cambridge by": 877,
    "by train can": 878,
    "train can you": 879,
    "can you help": 880,
    "you help me": 881,
    "me with the": 882,
    "with the arrangements": 883,
    "10:15": 884,
    "leave after": 885,
    "after 10:15": 886,
    "10:15 and": 887,
    "train should leave": 888,
    "should leave after": 889,
    "leave after 10:15": 890,
    "after 10:15 and": 891,
    "10:15 and should": 892,
    "go to peterborough": 893,
    "n't": 894,
    "decided": 895,
    "yet": 896,
    "reach": 897,
    "i have": 898,
    "have n't": 899,
    "n't decided": 900,
    "decided yet": 901,
    "yet what": 902,
    "what time": 903,
    "time will": 904,
    "will the": 905,
    "train reach": 906,
    "reach the": 907,
    "station in": 908,
    "in peterborough": 909,
    "i have n't": 910,
    "have n't decided": 911,
    "n't decided yet": 912,
    "decided yet what": 913,
    "yet what time": 914,
    "what time will": 915,
    "time will the": 916,
    "will the train": 917,
    "the train reach": 918,
    "train reach the": 919,
    "reach the station": 920,
    "the station in": 921,
    "station in peterborough": 922,
    "welcome": 923,
    "service": 924,
    "welcome at": 925,
    "at your": 926,
    "your service": 927,
    "service next": 928,
    "next time": 929,
    "welcome at your": 930,
    "at your service": 931,
    "your service next": 932,
    "service next time": 933,
    "needed today": 934,
    "i needed today": 935,
    "london": 936,
    "liverpool": 937,
    "an": 938,
    "early": 939,
    "8:30": 940,
    "to london": 941,
    "london liverpool": 942,
    "liverpool street": 943,
    "street i": 944,
    "need an": 945,
    "an early": 946,
    "early 1": 947,
    "1 arriving": 948,
    "arriving there": 949,
    "by 8:30": 950,
    "hi i need": 951,
    "train to london": 952,
    "to london liverpool": 953,
    "london liverpool street": 954,
    "liverpool street i": 955,
    "street i need": 956,
    "i need an": 957,
    "need an early": 958,
    "an early 1": 959,
    "early 1 arriving": 960,
    "1 arriving there": 961,
    "arriving there by": 962,
    "there by 8:30": 963,
    "leave on wednesday": 964,
    "trains": 965,
    "you have": 966,
    "have no": 967,
    "no trains": 968,
    "trains departing": 969,
    "departing cambridge": 970,
    "cambridge to": 971,
    "street on": 972,
    "wednesday that": 973,
    "that will": 974,
    "will arrive": 975,
    "you have no": 976,
    "have no trains": 977,
    "no trains departing": 978,
    "trains departing cambridge": 979,
    "departing cambridge to": 980,
    "cambridge to london": 981,
    "liverpool street on": 982,
    "street on wednesday": 983,
    "on wednesday that": 984,
    "wednesday that will": 985,
    "that will arrive": 986,
    "will arrive by": 987,
    "arrive by 8:30": 988,
    "fine": 989,
    "how": 990,
    "long": 991,
    "journey": 992,
    "ticket": 993,
    "way": 994,
    "yes that": 995,
    "is fine": 996,
    "fine how": 997,
    "how long": 998,
    "long is": 999,
    "the journey": 1000,
    "journey and": 1001,
    "and how": 1002,
    "how much": 1003,
    "much is": 1004,
    "the ticket": 1005,
    "ticket by": 1006,
    "by the": 1007,
    "the way": 1008,
    "yes that is": 1009,
    "that is fine": 1010,
    "is fine how": 1011,
    "fine how long": 1012,
    "how long is": 1013,
    "long is the": 1014,
    "is the journey": 1015,
    "the journey and": 1016,
    "journey and how": 1017,
    "and how much": 1018,
    "how much is": 1019,
    "much is the": 1020,
    "is the ticket": 1021,
    "the ticket by": 1022,
    "ticket by the": 1023,
    "by the way": 1024,
    "book me": 1025,
    "a ticket": 1026,
    "ticket please": 1027,
    "yes book me": 1028,
    "book me a": 1029,
    "me a ticket": 1030,
    "a ticket please": 1031,
    "you that is": 1032,
    "greetings": 1033,
    "locating": 1034,
    "greetings can": 1035,
    "me in": 1036,
    "in locating": 1037,
    "locating a": 1038,
    "to get": 1039,
    "me to": 1040,
    "greetings can you": 1041,
    "help me in": 1042,
    "me in locating": 1043,
    "in locating a": 1044,
    "locating a train": 1045,
    "train to get": 1046,
    "to get me": 1047,
    "get me to": 1048,
    "me to cambridge": 1049,
    "sure i": 1050,
    "friday from": 1051,
    "sure i need": 1052,
    "leave on friday": 1053,
    "on friday from": 1054,
    "friday from broxbourne": 1055,
    "sometime": 1056,
    "later": 1057,
    "than": 1058,
    "6": 1059,
    "seats": 1060,
    "to need": 1061,
    "leave sometime": 1062,
    "sometime later": 1063,
    "later than": 1064,
    "than 17:15": 1065,
    "17:15 i": 1066,
    "need 6": 1067,
    "6 seats": 1068,
    "going to need": 1069,
    "to need to": 1070,
    "to leave sometime": 1071,
    "leave sometime later": 1072,
    "sometime later than": 1073,
    "later than 17:15": 1074,
    "than 17:15 i": 1075,
    "17:15 i will": 1076,
    "will need 6": 1077,
    "need 6 seats": 1078,
    "does": 1079,
    "matter": 1080,
    "it does": 1081,
    "does not": 1082,
    "not matter": 1083,
    "matter i": 1084,
    "sometime after": 1085,
    "after 17:15": 1086,
    "it does not": 1087,
    "does not matter": 1088,
    "not matter i": 1089,
    "matter i just": 1090,
    "leave sometime after": 1091,
    "sometime after 17:15": 1092,
    "please for": 1093,
    "for 6": 1094,
    "6 people": 1095,
    "yes please for": 1096,
    "please for 6": 1097,
    "for 6 people": 1098,
    "needed for": 1099,
    "for today": 1100,
    "today thank": 1101,
    "i needed for": 1102,
    "needed for today": 1103,
    "for today thank": 1104,
    "today thank you": 1105,
    "from london": 1106,
    "street station": 1107,
    "station on": 1108,
    "train from london": 1109,
    "from london liverpool": 1110,
    "liverpool street station": 1111,
    "street station on": 1112,
    "station on wednesday": 1113,
    "heading": 1114,
    "important": 1115,
    "visit": 1116,
    "11:00": 1117,
    "am heading": 1118,
    "heading to": 1119,
    "cambridge for": 1120,
    "for an": 1121,
    "an important": 1122,
    "important visit": 1123,
    "visit can": 1124,
    "you get": 1125,
    "me there": 1126,
    "by 11:00": 1127,
    "i am heading": 1128,
    "am heading to": 1129,
    "heading to cambridge": 1130,
    "to cambridge for": 1131,
    "cambridge for an": 1132,
    "for an important": 1133,
    "an important visit": 1134,
    "important visit can": 1135,
    "visit can you": 1136,
    "can you get": 1137,
    "you get me": 1138,
    "get me there": 1139,
    "me there by": 1140,
    "there by 11:00": 1141,
    "many": 1142,
    "that should": 1143,
    "should be": 1144,
    "perfect how": 1145,
    "how many": 1146,
    "many tickets": 1147,
    "tickets can": 1148,
    "i get": 1149,
    "that should be": 1150,
    "should be perfect": 1151,
    "be perfect how": 1152,
    "perfect how many": 1153,
    "how many tickets": 1154,
    "many tickets can": 1155,
    "tickets can i": 1156,
    "can i get": 1157,
    "just 1": 1158,
    "1 is": 1159,
    "just 1 is": 1160,
    "1 is fine": 1161,
    "first": 1162,
    "you tell": 1163,
    "please first": 1164,
    "could you tell": 1165,
    "you tell me": 1166,
    "tell me the": 1167,
    "me the travel": 1168,
    "time please first": 1169,
    "info": 1170,
    "all the": 1171,
    "the info": 1172,
    "info i": 1173,
    "is all the": 1174,
    "all the info": 1175,
    "the info i": 1176,
    "info i needed": 1177,
    "needed today thank": 1178,
    "cambridge on": 1179,
    "train to cambridge": 1180,
    "to cambridge on": 1181,
    "cambridge on saturday": 1182,
    "11:30": 1183,
    "will depart": 1184,
    "depart at": 1185,
    "at birmingham": 1186,
    "street and": 1187,
    "should arrive": 1188,
    "by 11:30": 1189,
    "11:30 can": 1190,
    "with this": 1191,
    "i will depart": 1192,
    "will depart at": 1193,
    "depart at birmingham": 1194,
    "at birmingham new": 1195,
    "new street and": 1196,
    "street and should": 1197,
    "and should arrive": 1198,
    "should arrive by": 1199,
    "arrive by 11:30": 1200,
    "by 11:30 can": 1201,
    "11:30 can you": 1202,
    "me with this": 1203,
    "departs": 1204,
    "monday": 1205,
    "that departs": 1206,
    "departs from": 1207,
    "from ely": 1208,
    "ely on": 1209,
    "on monday": 1210,
    "monday please": 1211,
    "train that departs": 1212,
    "that departs from": 1213,
    "departs from ely": 1214,
    "from ely on": 1215,
    "ely on monday": 1216,
    "on monday please": 1217,
    "13:15": 1218,
    "after 13:15": 1219,
    "13:15 and": 1220,
    "to leave after": 1221,
    "leave after 13:15": 1222,
    "after 13:15 and": 1223,
    "13:15 and i": 1224,
    "and i am": 1225,
    "any": 1226,
    "them": 1227,
    "arrival": 1228,
    "least": 1229,
    "option": 1230,
    "any of": 1231,
    "of them": 1232,
    "them will": 1233,
    "will do": 1234,
    "do can": 1235,
    "price arrival": 1236,
    "arrival time": 1237,
    "and train": 1238,
    "id of": 1239,
    "of at": 1240,
    "at least": 1241,
    "least 1": 1242,
    "1 option": 1243,
    "any of them": 1244,
    "of them will": 1245,
    "them will do": 1246,
    "will do can": 1247,
    "do can you": 1248,
    "can you tell": 1249,
    "the price arrival": 1250,
    "price arrival time": 1251,
    "arrival time and": 1252,
    "time and train": 1253,
    "and train id": 1254,
    "train id of": 1255,
    "id of at": 1256,
    "of at least": 1257,
    "at least 1": 1258,
    "least 1 option": 1259,
    "need thank": 1260,
    "think that is": 1261,
    "all i need": 1262,
    "i need thank": 1263,
    "need thank you": 1264,
    "schedule": 1265,
    "train schedule": 1266,
    "schedule that": 1267,
    "a train schedule": 1268,
    "train schedule that": 1269,
    "schedule that departs": 1270,
    "departs from cambridge": 1271,
    "10:30": 1272,
    "get a": 1273,
    "train leaving": 1274,
    "leaving cambridge": 1275,
    "and going": 1276,
    "ely i": 1277,
    "to be": 1278,
    "be in": 1279,
    "in ely": 1280,
    "ely by": 1281,
    "by 10:30": 1282,
    "10:30 and": 1283,
    "and am": 1284,
    "leaving on": 1285,
    "need to get": 1286,
    "to get a": 1287,
    "get a train": 1288,
    "a train leaving": 1289,
    "train leaving cambridge": 1290,
    "leaving cambridge and": 1291,
    "cambridge and going": 1292,
    "and going to": 1293,
    "going to ely": 1294,
    "to ely i": 1295,
    "ely i need": 1296,
    "need to be": 1297,
    "to be in": 1298,
    "be in ely": 1299,
    "in ely by": 1300,
    "ely by 10:30": 1301,
    "by 10:30 and": 1302,
    "10:30 and am": 1303,
    "and am leaving": 1304,
    "am leaving on": 1305,
    "leaving on wednesday": 1306,
    "3": 1307,
    "as": 1308,
    "well": 1309,
    "you book": 1310,
    "book that": 1311,
    "for 3": 1312,
    "3 people": 1313,
    "number as": 1314,
    "as well": 1315,
    "well please": 1316,
    "can you book": 1317,
    "you book that": 1318,
    "book that for": 1319,
    "that for 3": 1320,
    "for 3 people": 1321,
    "3 people and": 1322,
    "people and get": 1323,
    "reference number as": 1324,
    "number as well": 1325,
    "as well please": 1326,
    "is everything": 1327,
    "everything that": 1328,
    "that i": 1329,
    "needed thanks": 1330,
    "that is everything": 1331,
    "is everything that": 1332,
    "everything that i": 1333,
    "that i needed": 1334,
    "i needed thanks": 1335,
    "needed thanks for": 1336,
    "thanks for your": 1337,
    "end": 1338,
    "dialogue": 1339,
    "you this": 1340,
    "the end": 1341,
    "end of": 1342,
    "of the": 1343,
    "the dialogue": 1344,
    "thank you this": 1345,
    "you this is": 1346,
    "this is the": 1347,
    "is the end": 1348,
    "the end of": 1349,
    "end of the": 1350,
    "of the dialogue": 1351,
    "hello": 1352,
    "norwich": 1353,
    "hello i": 1354,
    "train i": 1355,
    "wednesday from": 1356,
    "from norwich": 1357,
    "hello i am": 1358,
    "a train i": 1359,
    "train i need": 1360,
    "on wednesday from": 1361,
    "wednesday from norwich": 1362,
    "09:00": 1363,
    "after 09:00": 1364,
    "am leaving after": 1365,
    "leaving after 09:00": 1366,
    "price and": 1367,
    "and travel": 1368,
    "the price and": 1369,
    "price and travel": 1370,
    "and travel time": 1371,
    "great can": 1372,
    "ok great can": 1373,
    "great can you": 1374,
    "you book it": 1375,
    "it for me": 1376,
    "be all": 1377,
    "all thank": 1378,
    "that will be": 1379,
    "will be all": 1380,
    "be all thank": 1381,
    "all thank you": 1382,
    "18:45": 1383,
    "bishops": 1384,
    "stortford": 1385,
    "train for": 1386,
    "for tuesday": 1387,
    "tuesday at": 1388,
    "at 18:45": 1389,
    "18:45 departing": 1390,
    "departing at": 1391,
    "at bishops": 1392,
    "bishops stortford": 1393,
    "stortford and": 1394,
    "and arrive": 1395,
    "arrive at": 1396,
    "at cambridge": 1397,
    "book a train": 1398,
    "a train for": 1399,
    "train for tuesday": 1400,
    "for tuesday at": 1401,
    "tuesday at 18:45": 1402,
    "at 18:45 departing": 1403,
    "18:45 departing at": 1404,
    "departing at bishops": 1405,
    "at bishops stortford": 1406,
    "bishops stortford and": 1407,
    "stortford and arrive": 1408,
    "and arrive at": 1409,
    "arrive at cambridge": 1410,
    "after 18:45": 1411,
    "leave after 18:45": 1412,
    "4": 1413,
    "for 4": 1414,
    "4 people": 1415,
    "can you please": 1416,
    "you please book": 1417,
    "it for 4": 1418,
    "for 4 people": 1419,
    "no thank": 1420,
    "no thank you": 1421,
    "15:30": 1422,
    "will take": 1423,
    "take me": 1424,
    "cambridge i": 1425,
    "by 15:30": 1426,
    "hi i am": 1427,
    "train that will": 1428,
    "that will take": 1429,
    "will take me": 1430,
    "take me to": 1431,
    "to cambridge i": 1432,
    "cambridge i want": 1433,
    "want to get": 1434,
    "to get there": 1435,
    "there by 15:30": 1436,
    "leaving from": 1437,
    "from stevenage": 1438,
    "stevenage and": 1439,
    "am leaving from": 1440,
    "leaving from stevenage": 1441,
    "from stevenage and": 1442,
    "stevenage and i": 1443,
    "and i would": 1444,
    "travel on monday": 1445,
    "8": 1446,
    "matter when": 1447,
    "when i": 1448,
    "i depart": 1449,
    "depart i": 1450,
    "15:30 i": 1451,
    "will have": 1452,
    "have 8": 1453,
    "8 people": 1454,
    "not matter when": 1455,
    "matter when i": 1456,
    "when i depart": 1457,
    "i depart i": 1458,
    "depart i just": 1459,
    "arrive in cambridge": 1460,
    "in cambridge by": 1461,
    "cambridge by 15:30": 1462,
    "by 15:30 i": 1463,
    "15:30 i will": 1464,
    "i will have": 1465,
    "will have 8": 1466,
    "have 8 people": 1467,
    "require": 1468,
    "yes for": 1469,
    "for 8": 1470,
    "will require": 1471,
    "require a": 1472,
    "yes for 8": 1473,
    "for 8 people": 1474,
    "8 people and": 1475,
    "people and i": 1476,
    "and i will": 1477,
    "i will require": 1478,
    "will require a": 1479,
    "require a reference": 1480,
    "very": 1481,
    "you very": 1482,
    "very much": 1483,
    "is all thank": 1484,
    "thank you very": 1485,
    "you very much": 1486,
    "departing from": 1487,
    "train departing from": 1488,
    "departing from broxbourne": 1489,
    "arrive by 17:15": 1490,
    "be leaving": 1491,
    "i will be": 1492,
    "will be leaving": 1493,
    "be leaving on": 1494,
    "before": 1495,
    "does that": 1496,
    "train arrive": 1497,
    "cambridge before": 1498,
    "before 17:15": 1499,
    "does that train": 1500,
    "that train arrive": 1501,
    "train arrive in": 1502,
    "in cambridge before": 1503,
    "cambridge before 17:15": 1504,
    "departure": 1505,
    "yes and": 1506,
    "'ll just": 1507,
    "id and": 1508,
    "and departure": 1509,
    "departure time": 1510,
    "yes and i": 1511,
    "and i 'll": 1512,
    "i 'll just": 1513,
    "'ll just need": 1514,
    "train id and": 1515,
    "id and departure": 1516,
    "and departure time": 1517,
    "okay": 1518,
    "2": 1519,
    "okay would": 1520,
    "book 2": 1521,
    "2 tickets": 1522,
    "tickets for": 1523,
    "for that": 1524,
    "that 1": 1525,
    "okay would you": 1526,
    "would you please": 1527,
    "please book 2": 1528,
    "book 2 tickets": 1529,
    "2 tickets for": 1530,
    "tickets for that": 1531,
    "for that 1": 1532,
    "imagine": 1533,
    "why": 1534,
    "asked": 1535,
    "passage": 1536,
    "always": 1537,
    "buy": 1538,
    "own": 1539,
    "case": 1540,
    "ever": 1541,
    "i can": 1542,
    "can not": 1543,
    "not imagine": 1544,
    "imagine why": 1545,
    "why i": 1546,
    "i asked": 1547,
    "asked you": 1548,
    "you to": 1549,
    "book passage": 1550,
    "passage i": 1551,
    "i always": 1552,
    "always buy": 1553,
    "buy my": 1554,
    "my own": 1555,
    "own tickets": 1556,
    "tickets in": 1557,
    "in any": 1558,
    "any case": 1559,
    "case thanks": 1560,
    "thanks ever": 1561,
    "ever so": 1562,
    "i can not": 1563,
    "can not imagine": 1564,
    "not imagine why": 1565,
    "imagine why i": 1566,
    "why i asked": 1567,
    "i asked you": 1568,
    "asked you to": 1569,
    "you to book": 1570,
    "to book passage": 1571,
    "book passage i": 1572,
    "passage i always": 1573,
    "i always buy": 1574,
    "always buy my": 1575,
    "buy my own": 1576,
    "my own tickets": 1577,
    "own tickets in": 1578,
    "tickets in any": 1579,
    "in any case": 1580,
    "any case thanks": 1581,
    "case thanks ever": 1582,
    "thanks ever so": 1583,
    "ever so much": 1584,
    "enjoyed": 1585,
    "no thanks": 1586,
    "service i": 1587,
    "i enjoyed": 1588,
    "no thanks for": 1589,
    "for your service": 1590,
    "your service i": 1591,
    "service i enjoyed": 1592,
    "09:15": 1593,
    "to broxbourne": 1594,
    "broxbourne leaving": 1595,
    "after 09:15": 1596,
    "train to broxbourne": 1597,
    "to broxbourne leaving": 1598,
    "broxbourne leaving after": 1599,
    "leaving after 09:15": 1600,
    "to depart": 1601,
    "like to depart": 1602,
    "to depart from": 1603,
    "from cambridge on": 1604,
    "cambridge on friday": 1605,
    "will i": 1606,
    "i arrive": 1607,
    "time will i": 1608,
    "will i arrive": 1609,
    "ride": 1610,
    "train ride": 1611,
    "is the train": 1612,
    "the train ride": 1613,
    "train departing cambridge": 1614,
    "g": 1615,
    "to g": 1616,
    "g to": 1617,
    "need to g": 1618,
    "to g to": 1619,
    "g to london": 1620,
    "street on saturday": 1621,
    "no i": 1622,
    "by 15:00": 1623,
    "no i just": 1624,
    "arrive by 15:00": 1625,
    "perfect what": 1626,
    "yes that will": 1627,
    "be perfect what": 1628,
    "perfect what is": 1629,
    "is the travel": 1630,
    "train leaving from": 1631,
    "leaving from norwich": 1632,
    "09:45": 1633,
    "after 09:45": 1634,
    "leave after 09:45": 1635,
    "cambridge on tuesday": 1636,
    "leaves": 1637,
    "11:16": 1638,
    "provide": 1639,
    "ok do": 1640,
    "do you": 1641,
    "have 1": 1642,
    "1 that": 1643,
    "that leaves": 1644,
    "leaves at": 1645,
    "at 11:16": 1646,
    "11:16 can": 1647,
    "you provide": 1648,
    "provide me": 1649,
    "id for": 1650,
    "ok do you": 1651,
    "do you have": 1652,
    "you have 1": 1653,
    "have 1 that": 1654,
    "1 that leaves": 1655,
    "that leaves at": 1656,
    "leaves at 11:16": 1657,
    "at 11:16 can": 1658,
    "11:16 can you": 1659,
    "can you provide": 1660,
    "you provide me": 1661,
    "provide me with": 1662,
    "with the train": 1663,
    "train id for": 1664,
    "id for that": 1665,
    "very much for": 1666,
    "saturday and": 1667,
    "it should leave": 1668,
    "on saturday and": 1669,
    "saturday and should": 1670,
    "huntingdon": 1671,
    "9:00": 1672,
    "pm": 1673,
    "from huntingdon": 1674,
    "huntingdon and": 1675,
    "get to": 1676,
    "by 9:00": 1677,
    "9:00 pm": 1678,
    "leave from huntingdon": 1679,
    "from huntingdon and": 1680,
    "huntingdon and get": 1681,
    "and get to": 1682,
    "get to cambridge": 1683,
    "to cambridge by": 1684,
    "cambridge by 9:00": 1685,
    "by 9:00 pm": 1686,
    "correct": 1687,
    "is correct": 1688,
    "that is correct": 1689,
    "all of": 1690,
    "of your": 1691,
    "help have": 1692,
    "a great": 1693,
    "great day": 1694,
    "you for all": 1695,
    "for all of": 1696,
    "all of your": 1697,
    "of your help": 1698,
    "your help have": 1699,
    "help have a": 1700,
    "have a great": 1701,
    "a great day": 1702,
    "anything": 1703,
    "need anything": 1704,
    "no i do": 1705,
    "not need anything": 1706,
    "need help": 1707,
    "help booking": 1708,
    "booking a": 1709,
    "train please": 1710,
    "please i": 1711,
    "i need help": 1712,
    "need help booking": 1713,
    "help booking a": 1714,
    "booking a train": 1715,
    "a train please": 1716,
    "train please i": 1717,
    "please i would": 1718,
    "cambridge on monday": 1719,
    "kings": 1720,
    "cross": 1721,
    "19:00": 1722,
    "be departing": 1723,
    "london kings": 1724,
    "kings cross": 1725,
    "cross after": 1726,
    "after 19:00": 1727,
    "will be departing": 1728,
    "be departing from": 1729,
    "departing from london": 1730,
    "from london kings": 1731,
    "london kings cross": 1732,
    "kings cross after": 1733,
    "cross after 19:00": 1734,
    "close": 1735,
    "eatery": 1736,
    "near": 1737,
    "where": 1738,
    "we": 1739,
    "yes can": 1740,
    "a close": 1741,
    "close by": 1742,
    "by eatery": 1743,
    "eatery near": 1744,
    "near where": 1745,
    "where we": 1746,
    "we arrive": 1747,
    "yes can you": 1748,
    "you find a": 1749,
    "find a close": 1750,
    "a close by": 1751,
    "close by eatery": 1752,
    "by eatery near": 1753,
    "eatery near where": 1754,
    "near where we": 1755,
    "where we arrive": 1756,
    "we arrive at": 1757,
    "center": 1758,
    "how about": 1759,
    "the center": 1760,
    "how about the": 1761,
    "about the center": 1762,
    "need it": 1763,
    "i need it": 1764,
    "need it for": 1765,
    "it for 6": 1766,
    "help this": 1767,
    "your help this": 1768,
    "help this is": 1769,
    "this is all": 1770,
    "set": 1771,
    "bye": 1772,
    "am sure": 1773,
    "am all": 1774,
    "all set": 1775,
    "set thanks": 1776,
    "thanks so": 1777,
    "much bye": 1778,
    "i am sure": 1779,
    "am sure i": 1780,
    "sure i am": 1781,
    "i am all": 1782,
    "am all set": 1783,
    "all set thanks": 1784,
    "set thanks so": 1785,
    "thanks so much": 1786,
    "so much bye": 1787,
    "stansted": 1788,
    "airport": 1789,
    "sunday and": 1790,
    "to stansted": 1791,
    "stansted airport": 1792,
    "on sunday and": 1793,
    "sunday and should": 1794,
    "go to stansted": 1795,
    "to stansted airport": 1796,
    "but": 1797,
    "noon": 1798,
    "morning": 1799,
    "person": 1800,
    ":": 1801,
    "time does": 1802,
    "matter so": 1803,
    "much but": 1804,
    "but i": 1805,
    "after noon": 1806,
    "noon not": 1807,
    "not a": 1808,
    "a morning": 1809,
    "morning person": 1810,
    "person :": 1811,
    "arrival time does": 1812,
    "time does not": 1813,
    "not matter so": 1814,
    "matter so much": 1815,
    "so much but": 1816,
    "much but i": 1817,
    "but i want": 1818,
    "want to leave": 1819,
    "leave after noon": 1820,
    "after noon not": 1821,
    "noon not a": 1822,
    "not a morning": 1823,
    "a morning person": 1824,
    "morning person :": 1825,
    "and should depart": 1826,
    "make that": 1827,
    "that tuesday": 1828,
    "tuesday and": 1829,
    "make that tuesday": 1830,
    "that tuesday and": 1831,
    "tuesday and i": 1832,
    "19:30": 1833,
    "by 19:30": 1834,
    "19:30 please": 1835,
    "arrive by 19:30": 1836,
    "by 19:30 please": 1837,
    "thanks that": 1838,
    "is actually": 1839,
    "actually all": 1840,
    "needed from": 1841,
    "from you": 1842,
    "you today": 1843,
    "no thanks that": 1844,
    "thanks that is": 1845,
    "that is actually": 1846,
    "is actually all": 1847,
    "actually all the": 1848,
    "i needed from": 1849,
    "needed from you": 1850,
    "from you today": 1851,
    "you today thank": 1852,
    "16:00": 1853,
    "actually in": 1854,
    "in need": 1855,
    "need of": 1856,
    "of a": 1857,
    "leaving thursday": 1858,
    "thursday after": 1859,
    "after 16:00": 1860,
    "16:00 from": 1861,
    "cross can": 1862,
    "me 1": 1863,
    "am actually in": 1864,
    "actually in need": 1865,
    "in need of": 1866,
    "need of a": 1867,
    "of a train": 1868,
    "train leaving thursday": 1869,
    "leaving thursday after": 1870,
    "thursday after 16:00": 1871,
    "after 16:00 from": 1872,
    "16:00 from cambridge": 1873,
    "from cambridge to": 1874,
    "to london kings": 1875,
    "kings cross can": 1876,
    "cross can you": 1877,
    "find me 1": 1878,
    "please give": 1879,
    "you please give": 1880,
    "please give me": 1881,
    "to norwich": 1882,
    "train from cambridge": 1883,
    "cambridge to norwich": 1884,
    "saturday after": 1885,
    "after 20:30": 1886,
    "sorry i want": 1887,
    "on saturday after": 1888,
    "saturday after 20:30": 1889,
    "works": 1890,
    "that works": 1891,
    "works great": 1892,
    "i book": 1893,
    "people please": 1894,
    "yes that works": 1895,
    "that works great": 1896,
    "works great can": 1897,
    "great can i": 1898,
    "can i book": 1899,
    "i book that": 1900,
    "that for 5": 1901,
    "5 people please": 1902,
    "nice": 1903,
    "need have": 1904,
    "a nice": 1905,
    "nice day": 1906,
    "i need have": 1907,
    "need have a": 1908,
    "have a nice": 1909,
    "a nice day": 1910,
    "to take": 1911,
    "me from": 1912,
    "train to take": 1913,
    "to take me": 1914,
    "take me from": 1915,
    "me from cambridge": 1916,
    "cambridge to broxbourne": 1917,
    "know": 1918,
    "08:15": 1919,
    "though": 1920,
    "not know": 1921,
    "know i": 1922,
    "there at": 1923,
    "at 08:15": 1924,
    "08:15 though": 1925,
    "do not know": 1926,
    "not know i": 1927,
    "know i want": 1928,
    "get there at": 1929,
    "there at 08:15": 1930,
    "at 08:15 though": 1931,
    "travelling": 1932,
    "be travelling": 1933,
    "travelling on": 1934,
    "will be travelling": 1935,
    "be travelling on": 1936,
    "travelling on monday": 1937,
    "cost": 1938,
    "be fine": 1939,
    "fine thank": 1940,
    "me how": 1941,
    "long the": 1942,
    "journey will": 1943,
    "be and": 1944,
    "much it": 1945,
    "it will": 1946,
    "will cost": 1947,
    "cost and": 1948,
    "and when": 1949,
    "train leaves": 1950,
    "will be fine": 1951,
    "be fine thank": 1952,
    "fine thank you": 1953,
    "thank you can": 1954,
    "you can you": 1955,
    "tell me how": 1956,
    "me how long": 1957,
    "how long the": 1958,
    "long the journey": 1959,
    "the journey will": 1960,
    "journey will be": 1961,
    "will be and": 1962,
    "be and how": 1963,
    "how much it": 1964,
    "much it will": 1965,
    "it will cost": 1966,
    "will cost and": 1967,
    "cost and when": 1968,
    "and when the": 1969,
    "when the train": 1970,
    "the train leaves": 1971,
    "exact": 1972,
    "the exact": 1973,
    "exact departure": 1974,
    "is the exact": 1975,
    "the exact departure": 1976,
    "exact departure time": 1977,
    "departure time please": 1978,
    "seat on": 1979,
    "on the": 1980,
    "you book me": 1981,
    "me a seat": 1982,
    "a seat on": 1983,
    "seat on the": 1984,
    "on the train": 1985,
    "the train please": 1986,
    "ready": 1987,
    "quite": 1988,
    "actually i": 1989,
    "am not": 1990,
    "not ready": 1991,
    "ready to": 1992,
    "book quite": 1993,
    "quite yet": 1994,
    "yet thank": 1995,
    "day bye": 1996,
    "actually i am": 1997,
    "i am not": 1998,
    "am not ready": 1999,
    "not ready to": 2000,
    "ready to book": 2001,
    "to book quite": 2002,
    "book quite yet": 2003,
    "quite yet thank": 2004,
    "yet thank you": 2005,
    "nice day bye": 2006,
    "going from": 2007,
    "ely to": 2008,
    "cambridge please": 2009,
    "train going from": 2010,
    "going from ely": 2011,
    "from ely to": 2012,
    "ely to cambridge": 2013,
    "to cambridge please": 2014,
    "14:45": 2015,
    "friday and": 2016,
    "by 14:45": 2017,
    "on friday and": 2018,
    "friday and arrive": 2019,
    "and arrive by": 2020,
    "arrive by 14:45": 2021,
    "particular": 2022,
    "reserve": 2023,
    "no time": 2024,
    "time in": 2025,
    "in particular": 2026,
    "particular please": 2027,
    "please reserve": 2028,
    "reserve any": 2029,
    "any 1": 2030,
    "1 of": 2031,
    "them for": 2032,
    "no time in": 2033,
    "time in particular": 2034,
    "in particular please": 2035,
    "particular please reserve": 2036,
    "please reserve any": 2037,
    "reserve any 1": 2038,
    "any 1 of": 2039,
