{
  "2": {
    "<pad>": 0,
    "<s>": 1,
    "</s>": 2,
    "<unk>": 3,
    "can you": 4,
    "you please": 5,
    "please help": 6,
    "help me": 7,
    "me find": 8,
    "find a": 9,
    "a place": 10,
    "place to": 11,
    "to go": 12,
    "go ?": 13,
    "i would": 14,
    "would like": 15,
    "like a": 16,
    "a sports": 17,
    "sports place": 18,
    "place in": 19,
    "in the": 20,
    "the centre": 21,
    "centre please": 22,
    "please .": 23,
    "okay ,": 24,
    ", are": 25,
    "are there": 26,
    "there any": 27,
    "any cinemas": 28,
    "cinemas in": 29,
    "centre ?": 30,
    "okay that": 31,
    "that will": 32,
    "will work": 33,
    "work .": 34,
    ". can": 35,
    "please tell": 36,
    "tell me": 37,
    "me their": 38,
    "their phone": 39,
    "phone number": 40,
    "number ,": 41,
    ", postcode": 42,
    "postcode and": 43,
    "and the": 44,
    "the entrance": 45,
    "entrance fee": 46,
    "fee ?": 47,
    "no worries": 48,
    "worries ,": 49,
    ", i": 50,
    "i 'll": 51,
    "'ll give": 52,
    "give them": 53,
    "them a": 54,
    "a call": 55,
    "call and": 56,
    "and find": 57,
    "find out": 58,
    "out .": 59,
    ". thanks": 60,
    "thanks so": 61,
    "so much": 62,
    "much for": 63,
    "for all": 64,
    "all your": 65,
    "your help": 66,
    "help ,": 67,
    ", goodbye": 68,
    "goodbye .": 69,
    "someone told": 70,
    "told me": 71,
    "me about": 72,
    "about a": 73,
    "place called": 74,
    "called old": 75,
    "old schools": 76,
    "schools .": 77,
    ". it": 78,
    "it s": 79,
    "s supposed": 80,
    "supposed to": 81,
    "to be": 82,
    "be some": 83,
    "some kind": 84,
    "kind of": 85,
    "of attraction": 86,
    "attraction .": 87,
    "you tell": 88,
    "me anything": 89,
    "anything about": 90,
    "about it": 91,
    "it ?": 92,
    "yes ,": 93,
    ", please": 94,
    ". that": 95,
    "that would": 96,
    "would be": 97,
    "be great": 98,
    "great .": 99,
    "no ,": 100,
    ", that": 101,
    "that is": 102,
    "is all": 103,
    "all for": 104,
    "for today": 105,
    "today .": 106,
    "much !": 107,
    "hello ,": 108,
    "i am": 109,
    "am looking": 110,
    "looking for": 111,
    "for the": 112,
    "the museum": 113,
    "museum of": 114,
    "of classical": 115,
    "classical archaeology": 116,
    "archaeology ,": 117,
    ", could": 118,
    "could you": 119,
    "me more": 120,
    "more about": 121,
    "like that": 122,
    "that .": 123,
    ". thank": 124,
    "thank you": 125,
    "you so": 126,
    ", you": 127,
    "you 've": 128,
    "'ve been": 129,
    "been very": 130,
    "very helpful": 131,
    "helpful .": 132,
    "you .": 133,
    ". bye": 134,
    "bye .": 135,
    "for a": 136,
    "centre of": 137,
    "of town": 138,
    "town that": 139,
    "is a": 140,
    "a nightclub": 141,
    "nightclub .": 142,
    "that sounds": 143,
    "sounds like": 144,
    "like it": 145,
    "it will": 146,
    "can i": 147,
    "i get": 148,
    "get their": 149,
    "their address": 150,
    "address and": 151,
    "and postcode": 152,
    "postcode ?": 153,
    "that s": 154,
    "s all": 155,
    "all i": 156,
    "i need": 157,
    "need today": 158,
    "you for": 159,
    "for your": 160,
    "help !": 161,
    "like information": 162,
    "information on": 163,
    "on club": 164,
    "club salsa": 165,
    "you let": 166,
    "let me": 167,
    "me have": 168,
    "have their": 169,
    "their postcode": 170,
    "all .": 171,
    "about the": 172,
    "the cambridge": 173,
    "cambridge university": 174,
    "university botanic": 175,
    "botanic gardens": 176,
    "gardens .": 177,
    "you found": 178,
    "found me": 179,
    "me a": 180,
    "a swimming": 181,
    "swimming pool": 182,
    "pool in": 183,
    "the south": 184,
    "south part": 185,
    "part of": 186,
    "town ?": 187,
    "what about": 188,
    "a type": 189,
    "type of": 190,
    "of park": 191,
    "park ?": 192,
    "wandlebury country": 193,
    "country park": 194,
    "park is": 195,
    "is fine": 196,
    "fine .": 197,
    "get the": 198,
    "thanks for": 199,
    "the info": 200,
    "info .": 201,
    ". i": 202,
    "i will": 203,
    "will give": 204,
    "call .": 205,
    "you !": 206,
    "pool to": 207,
    "go to": 208,
    "to in": 209,
    "the north": 210,
    "north .": 211,
    "great can": 212,
    "number ?": 213,
    ", thank": 214,
    "give me": 215,
    "me information": 216,
    "information about": 217,
    "about museums": 218,
    "museums in": 219,
    "the west": 220,
    "west side": 221,
    "side of": 222,
    "town .": 223,
    "what is": 224,
    "is the": 225,
    "the full": 226,
    "full address": 227,
    "and zipcode": 228,
    "zipcode of": 229,
    "of cafe": 230,
    "cafe jello": 231,
    "jello gallery": 232,
    "gallery ?": 233,
    "no that": 234,
    "that 'll": 235,
    "'ll be": 236,
    "be all": 237,
    "go in": 238,
    "in town": 239,
    "town to": 240,
    "to have": 241,
    "have fun": 242,
    "fun .": 243,
    ". are": 244,
    "any nightclubs": 245,
    "nightclubs in": 246,
    "west ?": 247,
    "how about": 248,
    "a college": 249,
    "college in": 250,
    "what s": 251,
    "s the": 252,
    "the address": 253,
    "address of": 254,
    "of that": 255,
    "that college": 256,
    "college ?": 257,
    "be it": 258,
    "it .": 259,
    "thanks .": 260,
    "need to": 261,
    "to find": 262,
    "go for": 263,
    "for entertainment": 264,
    "entertainment .": 265,
    "it in": 266,
    "centre ,": 267,
    "any museums": 268,
    "am only": 269,
    "only looking": 270,
    "entertainment or": 271,
    "or museums": 272,
    "you look": 273,
    "look again": 274,
    "again ?": 275,
    "i appreciate": 276,
    "appreciate your": 277,
    "help .": 278,
    "hi !": 279,
    "! i": 280,
    "for somewhere": 281,
    "somewhere to": 282,
    "centre area": 283,
    "area .": 284,
    "would love": 285,
    "love to": 286,
    "to maybe": 287,
    "maybe tour": 288,
    "tour a": 289,
    "college if": 290,
    "if i": 291,
    "i can": 292,
    "can .": 293,
    ", and": 294,
    "and do": 295,
    "do you": 296,
    "you have": 297,
    "have the": 298,
    "and phone": 299,
    "no thank": 300,
    ". you": 301,
    "have been": 302,
    ". have": 303,
    "have a": 304,
    "a great": 305,
    "great day": 306,
    "day .": 307,
    "need information": 308,
    "on the": 309,
    "the fitzwilliam": 310,
    "fitzwilliam museum": 311,
    "the phone": 312,
    ", address": 313,
    "address ,": 314,
    "and area": 315,
    "area it": 316,
    "it is": 317,
    "is located": 318,
    "located in": 319,
    "in ?": 320,
    "you ,": 321,
    "need .": 322,
    "a museum": 323,
    "museum to": 324,
    "to visit": 325,
    "visit in": 326,
    "the anthropology": 327,
    "anthropology museum": 328,
    "museum please": 329,
    "is their": 330,
    "much .": 331,
    "for attractions": 332,
    "attractions in": 333,
    "the town": 334,
    "town centre": 335,
    "need for": 336,
    "am trying": 337,
    "trying to": 338,
    "find the": 339,
    "the parkside": 340,
    "parkside pools": 341,
    "pools .": 342,
    "you give": 343,
    "me the": 344,
    "of parkside": 345,
    "pools as": 346,
    "as well": 347,
    "well as": 348,
    "as the": 349,
    "the zip": 350,
    "zip code": 351,
    "code ?": 352,
    "for now": 353,
    "now .": 354,
    "thanks a": 355,
    "a bunch": 356,
    "bunch !": 357,
    "hello .": 358,
    ", just": 359,
    "just architecture": 360,
    "architecture .": 361,
    "would also": 362,
    "also like": 363,
    "like the": 364,
    "number and": 365,
    "postcode please": 366,
    "sounds great": 367,
    "great !": 368,
    "! can": 369,
    "number as": 370,
    "well ?": 371,
    "thanks ,": 372,
    "i needed": 373,
    "needed today": 374,
    ". goodbye": 375,
    "goodbye !": 376,
    "i want": 377,
    "want to": 378,
    "visit a": 379,
    "great ,": 380,
    ", can": 381,
    "please give": 382,
    "will be": 383,
    "like to": 384,
    "town ,": 385,
    "that include": 386,
    "include -s": 387,
    "-s multiple": 388,
    "multiple sports": 389,
    "there museums": 390,
    "museums instead": 391,
    "instead ?": 392,
    "be perfect": 393,
    "perfect .": 394,
    "a good": 395,
    "good night": 396,
    "night .": 397,
    "for information": 398,
    "a particular": 399,
    "particular attraction": 400,
    "s called": 401,
    "called the": 402,
    "the man": 403,
    "man on": 404,
    "the moon": 405,
    "moon .": 406,
    "not right": 407,
    "right now": 408,
    "me it": 409,
    "s postcode": 410,
    "and entrance": 411,
    "a multiple": 412,
    "sports attraction": 413,
    "attraction in": 414,
    "sure ,": 415,
    ", is": 416,
    "is there": 417,
    "there a": 418,
    "nightclub in": 419,
    "in that": 420,
    "that part": 421,
    "would you": 422,
    "you mind": 423,
    "mind double": 424,
    "double checking": 425,
    "checking .": 426,
    "i thought": 427,
    "thought i": 428,
    "i visited": 429,
    "visited a": 430,
    "town before": 431,
    "before .": 432,
    "fee and": 433,
    "number for": 434,
    "for club": 435,
    "salsa ?": 436,
    "for answering": 437,
    "answering all": 438,
    "all my": 439,
    "my questions": 440,
    "questions .": 441,
    "a cinema": 442,
    "cinema of": 443,
    "of the": 444,
    "side .": 445,
    "museum then": 446,
    "then ?": 447,
    "would prefer": 448,
    "prefer a": 449,
    "museum .": 450,
    ". 1": 451,
    "1 with": 452,
    "with free": 453,
    "free entry": 454,
    "entry if": 455,
    "if possible": 456,
    "possible .": 457,
    ". book": 458,
    "book me": 459,
    "a ticket": 460,
    "ticket and": 461,
    "and get": 462,
    "get me": 463,
    "a reference": 464,
    "reference number": 465,
    "number .": 466,
    "all ,": 467,
    "have information": 468,
    "about nightclubs": 469,
    "nightclubs ?": 470,
    "for any": 471,
    "any 1": 472,
    "1 you": 473,
    "you would": 474,
    "would recommend": 475,
    "recommend ,": 476,
    "i just": 477,
    "just need": 478,
    "need the": 479,
    ", entrance": 480,
    "fee ,": 481,
    "postcode .": 482,
    "needed .": 483,
    "the kings": 484,
    "kings college": 485,
    "college attraction": 486,
    "the postcode": 487,
    "today ,": 488,
    ", thanks": 489,
    "thanks !": 490,
    "museum in": 491,
    "centre .": 492,
    "sounds perfect": 493,
    ". what": 494,
    "all thank": 495,
    "me ?": 496,
    "? i": 497,
    "on great": 498,
    "great saint": 499,
    "saint mary": 500,
    "mary s": 501,
    "s church": 502,
    "church .": 503,
    "thanks very": 504,
    "very much": 505,
    "much ,": 506,
    ", hello": 507,
    "attraction called": 508,
    "called downing": 509,
    "downing college": 510,
    "college .": 511,
    "that was": 512,
    "was all": 513,
    "to get": 514,
    "get some": 515,
    "some suggestions": 516,
    "suggestions on": 517,
    "on where": 518,
    "where i": 519,
    "can take": 520,
    "take my": 521,
    "my wife": 522,
    "wife for": 523,
    "for our": 524,
    "our anniversary": 525,
    "anniversary .": 526,
    ". we": 527,
    "we want": 528,
    "to try": 529,
    "try to": 530,
    "find something": 531,
    "something fun": 532,
    "fun to": 533,
    "to do": 534,
    "do .": 535,
    "sounds interesting": 536,
    "interesting .": 537,
    "postcode info": 538,
    "info ?": 539,
    "well ,": 540,
    "i guess": 541,
    "guess i": 542,
    "i forgot": 543,
    "forgot to": 544,
    "to specify": 545,
    "specify that": 546,
    "that i": 547,
    "need something": 548,
    "something on": 549,
    "south end": 550,
    "end of": 551,
    "any attractions": 552,
    "attractions at": 553,
    "at all": 554,
    "all on": 555,
    "south side": 556,
    "the city": 557,
    "city ?": 558,
    "info !": 559,
    "any multiple": 560,
    "sports in": 561,
    ", how": 562,
    "a theatre": 563,
    "theatre then": 564,
    "am not": 565,
    "not sure": 566,
    "sure yet": 567,
    "yet .": 568,
    ". which": 569,
    "which 1": 570,
    "1 do": 571,
    "you recommend": 572,
    "recommend ?": 573,
    "no thanks": 574,
    "all the": 575,
    "the information": 576,
    "information i": 577,
    "your time": 578,
    "time .": 579,
    "any place": 580,
    "place -s": 581,
    "-s to": 582,
    "not especially": 583,
    "especially ,": 584,
    "just kicking": 585,
    "kicking around": 586,
    "around the": 587,
    "centre for": 588,
    "a few": 589,
    "few hour": 590,
    "hour -s": 591,
    "-s and": 592,
    "and looking": 593,
    "for something": 594,
    "something to": 595,
    "just want": 596,
    "want something": 597,
    "do in": 598,
    "me what": 599,
    "what sort": 600,
    "sort of": 601,
    "of place": 602,
    "-s there": 603,
    "there are": 604,
    "are ?": 605,
    "recommend a": 606,
    "nightclub ?": 607,
    "yes please": 608,
    "s its": 609,
    "its entrance": 610,
    ", contact": 611,
    "contact number": 612,
    "is it": 613,
    "it ,": 614,
    ", adios": 615,
    "adios .": 616,
    "on museums": 617,
    "which is": 618,
    "is your": 619,
    "your favorite": 620,
    "favorite ?": 621,
    "? get": 622,
    "and i": 623,
    "'ll check": 624,
    "check them": 625,
    "them out": 626,
    "maybe you": 627,
    "you could": 628,
    "could give": 629,
    "me 1": 630,
    "1 other": 631,
    "other option": 632,
    "option ?": 633,
    "have any": 634,
    "any suggestions": 635,
    "suggestions ?": 636,
    "would just": 637,
    "and let": 638,
    "me know": 639,
    "know what": 640,
    "what kind": 641,
    "attraction you": 642,
    "you suggest": 643,
    "suggest .": 644,
    "will check": 645,
    "check it": 646,
    "it out": 647,
    "hi ,": 648,
    "i do": 649,
    "do not": 650,
    "not mind": 651,
    "mind but": 652,
    "but i": 653,
    "prefer something": 654,
    "something in": 655,
    "the east": 656,
    "a favorite": 657,
    "favorite place": 658,
    "no particular": 659,
    "attraction but": 660,
    "do need": 661,
    "need it": 662,
    "it to": 663,
    "be in": 664,
    ". how": 665,
    "how much": 666,
    "much do": 667,
    "do they": 668,
    "they charge": 669,
    "charge for": 670,
    "for entrance": 671,
    "entrance ?": 672,
    "visit some": 673,
    "some of": 674,
    "the architecture": 675,
    "architecture here": 676,
    "here in": 677,
    "you help": 678,
    "me with": 679,
    "with this": 680,
    "this ?": 681,
    "on a": 682,
    "a free": 683,
    "free 1": 684,
    "1 and": 685,
    "would need": 686,
    "to know": 687,
    "what area": 688,
    "area of": 689,
    "town it": 690,
    "is in": 691,
    "in please": 692,
    "you very": 693,
    "find some": 694,
    "some water": 695,
    "water and": 696,
    "and go": 697,
    "go boating": 698,
    "boating somewhere": 699,
    "somewhere around": 700,
    "around town": 701,
    "what do": 702,
    "have listed": 703,
    "listed ?": 704,
    "i think": 705,
    "think maybe": 706,
    "maybe the": 707,
    "north for": 708,
    "for this": 709,
    "this trip": 710,
    "trip .": 711,
    "need ,": 712,
    "am a": 713,
    "a tourist": 714,
    "tourist from": 715,
    "from out": 716,
    "out of": 717,
    ". but": 718,
    "but ,": 719,
    "i was": 720,
    "was trying": 721,
    "do near": 722,
    "near my": 723,
    "my hotel": 724,
    "hotel .": 725,
    ". could": 726,
    "place ?": 727,
    "really anything": 728,
    "anything will": 729,
    "will do": 730,
    "i have": 731,
    "have to": 732,
    "to kill": 733,
    "kill some": 734,
    "some time": 735,
    "time in": 736,
    "in between": 737,
    "between appointments": 738,
    "appointments .": 739,
    "recommend something": 740,
    "something and": 741,
    "and send": 742,
    "send me": 743,
    "address please": 744,
    "please ?": 745,
    "do !": 746,
    "! thank": 747,
    "nope ,": 748,
    "what attractions": 749,
    "attractions are": 750,
    "are in": 751,
    "what different": 752,
    "different attraction": 753,
    "attraction types": 754,
    "types are": 755,
    "there in": 756,
    "what museum": 757,
    "museum would": 758,
    "s very": 759,
    "could i": 760,
    "postcode as": 761,
    "am all": 762,
    "all set": 763,
    "set .": 764,
    "for nearby": 765,
    "nearby museums": 766,
    "particular area": 767,
    ". may": 768,
    "may i": 769,
    "number of": 770,
    "of 1": 771,
    "sounds good": 772,
    "good ,": 773,
    ", what": 774,
    "it thank": 775,
    "theatre to": 776,
    "visit .": 777,
    ". would": 778,
    "the 1": 779,
    "1 on": 780,
    "side ,": 781,
    "and if": 782,
    "if it": 783,
    "it has": 784,
    "has an": 785,
    "an entry": 786,
    "entry fee": 787,
    "unlisted !": 788,
    "! what": 789,
    "what a": 790,
    "a pain": 791,
    "pain .": 792,
    ". okay": 793,
    "i suppose": 794,
    "suppose give": 795,
    "museums on": 796,
    "which type": 797,
    "of museums": 798,
    "museums are": 799,
    "are available": 800,
    "available ?": 801,
    "to a": 802,
    "me your": 803,
    "? and": 804,
    "if you": 805,
    "number that": 806,
    "be really": 807,
    "really great": 808,
    ". no": 809,
    "like info": 810,
    "info on": 811,
    "on milton": 812,
    "milton country": 813,
    "help today": 814,
    "for things": 815,
    "things to": 816,
    "in cambridge": 817,
    "cambridge .": 818,
    "me if": 819,
    "if there": 820,
    "are any": 821,
    "much is": 822,
    "get in": 823,
    "in to": 824,
    "to ballare": 825,
    "ballare ?": 826,
    "and which": 827,
    "which area": 828,
    "area is": 829,
    "s it": 830,
    "! bye": 831,
    "bye !": 832,
    "for sports": 833,
    "sports facilities": 834,
    "facilities in": 835,
    "about colleges": 836,
    "colleges ?": 837,
    "1 of": 838,
    "the free": 839,
    "free ones": 840,
    "ones ,": 841,
    "ok ,": 842,
    ", great": 843,
    "'ll look": 844,
    "look that": 845,
    "that up": 846,
    "up .": 847,
    "and bye": 848,
    "need help": 849,
    "help finding": 850,
    "finding a": 851,
    "the area": 852,
    "area does": 853,
    "does not": 854,
    "not matter": 855,
    "matter but": 856,
    "pool .": 857,
    "well at": 858,
    "at the": 859,
    "for an": 860,
    "an entertainment": 861,
    "entertainment spot": 862,
    "spot in": 863,
    "just tell": 864,
    "you think": 865,
    "think is": 866,
    "is nice": 867,
    "nice .": 868,
    "i also": 869,
    "also get": 870,
    "postcode ,": 871,
    ", the": 872,
    "a really": 873,
    "really neat": 874,
    "neat museum": 875,
    "you be": 876,
    "be able": 877,
    "able to": 878,
    "to tell": 879,
    "me whats": 880,
    "whats available": 881,
    "available out": 882,
    "out there": 883,
    "there ?": 884,
    "any of": 885,
    "of them": 886,
    "them in": 887,
    ", not": 888,
    "not today": 889,
    "museum ?": 890,
    "you choose": 891,
    "choose the": 892,
    "you like": 893,
    "the best": 894,
    "best and": 895,
    "and tell": 896,
    ", phone": 897,
    "and address": 898,
    "address ?": 899,
    "hello i": 900,
    "college ,": 901,
    "any in": 902,
    "sure !": 903,
    "! which": 904,
    "postcode for": 905,
    "for that": 906,
    "that 1": 907,
    "1 ?": 908,
    "the complete": 909,
    "complete address": 910,
    "have helped": 911,
    "helped me": 912,
    "me .": 913,
    "visit !": 914,
    "not care": 915,
    "care which": 916,
    "which part": 917,
    "s in": 918,
    "in .": 919,
    "mind doing": 920,
    "doing some": 921,
    "some walking": 922,
    "walking .": 923,
    "interesting !": 924,
    "the post": 925,
    "post code": 926,
    "for some": 927,
    "some entertainment": 928,
    "nothing in": 929,
    "in particular": 930,
    "particular .": 931,
    "awesome ,": 932,
    "think that": 933,
    "it for": 934,
    "there place": 935,
    "-s in": 936,
    "of architectural": 937,
    "architectural interest": 938,
    "interest ?": 939,
    "surprise me": 940,
    "what are": 941,
    "are the": 942,
    "entrance fees": 943,
    "fees ?": 944,
    "nightclub please": 945,
    "information .": 946,
    "any area": 947,
    "area would": 948,
    "be fine": 949,
    "recommend 1": 950,
    "1 for": 951,
    "for me": 952,
    "oh yes": 953,
    "sounds wonderful": 954,
    "wonderful .": 955,
    "you get": 956,
    "what the": 957,
    "fee is": 958,
    "is ?": 959,
    "s great": 960,
    "kings hedges": 961,
    "hedges learner": 962,
    "learner pool": 963,
    "their contact": 964,
    "contact info": 965,
    "town is": 966,
    "is that": 967,
    "that exactly": 968,
    "exactly ?": 969,
    "find an": 970,
    "an attraction": 971,
    "attraction to": 972,
    "the attraction": 973,
    "attraction type": 974,
    "type ,": 975,
    "been a": 976,
    "great help": 977,
    "a nice": 978,
    "nice day": 979,
    "no specific": 980,
    "specific area": 981,
    ", give": 982,
    "number please": 983,
    "! that": 984,
    "day !": 985,
    "hi i": 986,
    "looking to": 987,
    "town please": 988,
    "not really": 989,
    "really .": 990,
    "you just": 991,
    "favorite and": 992,
    "know how": 993,
    "how it": 994,
    "be for": 995,
    "me to": 996,
    "? oh": 997,
    "oh ,": 998,
    ", for": 999,
    "for my": 1000,
    "my gps": 1001,
    "gps .": 1002,
    "want a": 1003,
    "museum ,": 1004,
    "? please": 1005,
    "please include": 1006,
    "include address": 1007,
    ". looking": 1008,
    "for modern": 1009,
    "modern art": 1010,
    "art and": 1011,
    "the museums": 1012,
    "museums phone": 1013,
    "on kambar": 1014,
    "kambar .": 1015,
    "you know": 1016,
    "know about": 1017,
    "about that": 1018,
    "that attraction": 1019,
    "attraction ?": 1020,
    "alright ,": 1021,
    "i really": 1022,
    "really needed": 1023,
    "needed to": 1024,
    "know .": 1025,
    "thanks again": 1026,
    "again !": 1027,
    "you too": 1028,
    "too !": 1029,
    "find information": 1030,
    "about adc": 1031,
    "adc theatre": 1032,
    "theatre ,": 1033,
    ", actually": 1034,
    "actually that": 1035,
    "that takes": 1036,
    "takes care": 1037,
    "care of": 1038,
    "of everything": 1039,
    "everything i": 1040,
    "day now": 1041,
    "now !": 1042,
    "hey there": 1043,
    "there .": 1044,
    "am hoping": 1045,
    "hoping you": 1046,
    "you might": 1047,
    "might be": 1048,
    "of entertainment": 1049,
    "entertainment is": 1050,
    "is happening": 1051,
    "happening tonight": 1052,
    "tonight in": 1053,
    "town near": 1054,
    "near where": 1055,
    "am staying": 1056,
    "staying .": 1057,
    "am in": 1058,
    "the northern": 1059,
    "northern part": 1060,
    "you happen": 1061,
    "happen to": 1062,
    "know if": 1063,
    "there is": 1064,
    "north ?": 1065,
    "please !": 1066,
    "for jesus": 1067,
    "jesus green": 1068,
    "green outdoor": 1069,
    "outdoor pool": 1070,
    "you also": 1071,
    "also give": 1072,
    "fee for": 1073,
    "the jesus": 1074,
    "green pool": 1075,
    "pool ?": 1076,
    "you that": 1077,
    ", bye": 1078,
    "pick 1": 1079,
    "and attraction": 1080,
    "type .": 1081,
    "'ll have": 1082,
    "to check": 1083,
    "check that": 1084,
    "that out": 1085,
    "info i": 1086,
    "my brother": 1087,
    "brother told": 1088,
    "about this": 1089,
    "this attraction": 1090,
    "attraction place": 1091,
    "called abbey": 1092,
    "abbey pool": 1093,
    "pool and": 1094,
    "and astroturf": 1095,
    "astroturf pitch": 1096,
    "pitch .": 1097,
    "me where": 1098,
    "where it": 1099,
    "that ?": 1100,
    "will take": 1101,
    "take care": 1102,
    "of it": 1103,
    "night !": 1104,
    "west section": 1105,
    "section of": 1106,
    "to an": 1107,
    "an architecture": 1108,
    "architecture attraction": 1109,
    "of college": 1110,
    "the churchill": 1111,
    "churchill college": 1112,
    "college is": 1113,
    "yes .": 1114,
    "for churchill": 1115,
    "go see": 1116,
    "see a": 1117,
    "college while": 1118,
    "while in": 1119,
    "about any": 1120,
    "them ?": 1121,
    "area where": 1122,
    "where your": 1123,
    "favorite is": 1124,
    "located ,": 1125,
    "out !": 1126,
    "am familiar": 1127,
    "familiar with": 1128,
    "with the": 1129,
    "a park": 1130,
    "park in": 1131,
    "the center": 1132,
    "center of": 1133,
    "any details": 1134,
    "details for": 1135,
    "need more": 1136,
    "more information": 1137,
    "about nusha": 1138,
    "nusha .": 1139,
    "i know": 1140,
    "know that": 1141,
    "that nusha": 1142,
    "nusha is": 1143,
    "south ,": 1144,
    ", but": 1145,
    "the name": 1146,
    "name of": 1147,
    ", it": 1148,
    "it does": 1149,
    "does .": 1150,
    "the saint": 1151,
    "saint barnabas": 1152,
    "barnabas press": 1153,
    "press gallery": 1154,
    "needed ,": 1155,
    ", hi": 1156,
    "hi .": 1157,
    "me locate": 1158,
    "locate a": 1159,
    "cinema .": 1160,
    "south section": 1161,
    "town the": 1162,
    "the has": 1163,
    "has to": 1164,
    "do with": 1165,
    "with multiple": 1166,
    "sports ?": 1167,
    "have in": 1168,
    "in attractions": 1169,
    "in a": 1170,
    "south ?": 1171,
    "sounds nice": 1172,
    "needed right": 1173,
    "now ,": 1174,
    "good morning": 1175,
    "morning ,": 1176,
    "to on": 1177,
    "east side": 1178,
    "side that": 1179,
    "that has": 1180,
    "has entertainment": 1181,
    "for boating": 1182,
    "boating activities": 1183,
    "activities in": 1184,
    "not have": 1185,
    "a preference": 1186,
    "preference .": 1187,
    "the riverboat": 1188,
    "riverboat georgina": 1189,
    "georgina ,": 1190,
    "'ll do": 1191,
    "do it": 1192,
    "go .": 1193,
    ", type": 1194,
    "and fee": 1195,
    "anything that": 1196,
    "is good": 1197,
    "just recommend": 1198,
    "recommend any": 1199,
    "much that": 1200,
    "will and": 1201,
    "and thank": 1202,
    "your assistance": 1203,
    "assistance .": 1204,
    "what can": 1205,
    "the price": 1206,
    "price is": 1207,
    "is great": 1208,
    "there postcode": 1209,
    "fee of": 1210,
    "the first": 1211,
    "first 1": 1212,
    "the list": 1213,
    "list that": 1214,
    "'ll work": 1215,
    "information that": 1216,
    "sports facility": 1217,
    "facility in": 1218,
    "museum instead": 1219,
    "good .": 1220,
    "s their": 1221,
    "and how": 1222,
    "best college": 1223,
    "centre and": 1224,
    "how can": 1225,
    "i contact": 1226,
    "contact them": 1227,
    "them by": 1228,
    "by phone": 1229,
    "phone ?": 1230,
    "please recommend": 1231,
    "1 in": 1232,
    "i please": 1233,
    "please get": 1234,
    "a swimmingpool": 1235,
    "swimmingpool ?": 1236,
    "north ,": 1237,
    "want the": 1238,
    "fee to": 1239,
    "to both": 1240,
    "both please": 1241,
    "okay thank": 1242,
    "was wondering": 1243,
    "wondering if": 1244,
    "the scott": 1245,
    "scott polar": 1246,
    "polar museum": 1247,
    "the type": 1248,
    "for it": 1249,
    "it please": 1250,
    "! thanks": 1251,
    "on boats": 1252,
    "boats in": 1253,
    ", any": 1254,
    "any is": 1255,
    "area 1": 1256,
    "them is": 1257,
    "in and": 1258,
    "and also": 1259,
    "also the": 1260,
    "okay .": 1261,
    "south .": 1262,
    "have no": 1263,
    "no preference": 1264,
    "west part": 1265,
    "it sould": 1266,
    "sould involve": 1267,
    "involve multiple": 1268,
    "sports .": 1269,
    "hm ,": 1270,
    "about what": 1271,
    "what entertainment": 1272,
    "entertainment venue": 1273,
    "venue -s": 1274,
    "-s might": 1275,
    "be on": 1276,
    "town instead": 1277,
    "get an": 1278,
    "an address": 1279,
    "and postal": 1280,
    "postal code": 1281,
    "code .": 1282,
    ". is": 1283,
    "there an": 1284,
    "an entrance": 1285,
    "fee that": 1286,
    "be charged": 1287,
    "charged .": 1288,
    "need a": 1289,
    "a recommendation": 1290,
    "recommendation for": 1291,
    "entertainment in": 1292,
    "city .": 1293,
    "have anything": 1294,
    "anything else": 1295,
    "else closer": 1296,
    "closer to": 1297,
    "to the": 1298,
    "? or": 1299,
    "or perhaps": 1300,
    "perhaps a": 1301,
    "a theater": 1302,
    "theater ?": 1303,
    "please ,": 1304,
    "fee .": 1305,
    "assistance !": 1306,
    "postcode of": 1307,
    "north please": 1308,
    "that should": 1309,
    "should do": 1310,
    "address for": 1311,
    "for wandlebury": 1312,
    "wandlebury ?": 1313,
    "? may": 1314,
    ", too": 1315,
    "too ?": 1316,
    "'ve answered": 1317,
    "answered all": 1318,
    "all of": 1319,
    "of my": 1320,
    "good afternoon": 1321,
    "afternoon .": 1322,
    "s such": 1323,
    "such a": 1324,
    "a beautiful": 1325,
    "beautiful day": 1326,
    "day out": 1327,
    "out and": 1328,
    "am visiting": 1329,
    "visiting here": 1330,
    "here .": 1331,
    "park nearby": 1332,
    "nearby to": 1333,
    "to where": 1334,
    "am ?": 1335,
    "just give": 1336,
    "s everything": 1337,
    "everything .": 1338,
    ", attraction": 1339,
    "area please": 1340,
    "been great": 1341,
    "for helping": 1342,
    "helping .": 1343,
    "any good": 1344,
    "good museums": 1345,
    "museums there": 1346,
    "on trinity": 1347,
    "trinity college": 1348,
    "know the": 1349,
    "type and": 1350,
    "address .": 1351,
    "! goodbye": 1352,
    "hey ,": 1353,
    "good cinemas": 1354,
    "cambridge ?": 1355,
    "either 1": 1356,
    "1 is": 1357,
    "! could": 1358,
    "sure .": 1359,
    "you find": 1360,
    "location does": 1361,
    "really matter": 1362,
    "matter .": 1363,
    "salsa sounds": 1364,
    "sounds right": 1365,
    "right up": 1366,
    "up my": 1367,
    "my alley": 1368,
    "alley .": 1369,
    "called cambridge": 1370,
    "cambridge artworks": 1371,
    "artworks .": 1372,
    ". do": 1373,
    "any information": 1374,
    "on it": 1375,
    "help and": 1376,
    "and have": 1377,
    "to help": 1378,
    "with a": 1379,
    "type for": 1380,
    "for people": 1381,
    "people s": 1382,
    "s portraits": 1383,
    "portraits exhibition": 1384,
    "exhibition at": 1385,
    "at girton": 1386,
    "girton college": 1387,
    "area ?": 1388,
    "what theaters": 1389,
    "theaters are": 1390,
    "are on": 1391,
    ", well": 1392,
    "well lets": 1393,
    "lets try": 1394,
    "try maybe": 1395,
    "maybe for": 1396,
    "pool instead": 1397,
    "instead .": 1398,
    "no but": 1399,
    "the number": 1400,
    "the abbey": 1401,
    ", do": 1402,
    "pool postcode": 1403,
    "cambridge museum": 1404,
    "of technology": 1405,
    "technology ?": 1406,
    "not at": 1407,
    "at this": 1408,
    "this moment": 1409,
    "moment .": 1410,
    "museum s": 1411,
    ", though": 1412,
    "though .": 1413,
    ". and": 1414,
    "and it": 1415,
    "is an": 1416,
    "an actual": 1417,
    "actual museum": 1418,
    ", correct": 1419,
    "correct ?": 1420,
    "will cover": 1421,
    "cover it": 1422,
    "like help": 1423,
    "help locating": 1424,
    "locating an": 1425,
    "for castle": 1426,
    "castle galleries": 1427,
    "galleries .": 1428,
    "the recommendation": 1429,
    "recommendation .": 1430,
    "the help": 1431,
    "help i": 1432,
    "place with": 1433,
    "that a": 1434,
    "? how": 1435,
    "much does": 1436,
    "does it": 1437,
    "it cost": 1438,
    "cost ?": 1439,
    "to definitely": 1440,
    "definitely see": 1441,
    "see something": 1442,
    "? can": 1443,
    "nice 1": 1444,
    "excellent ,": 1445,
    "and post": 1446,
    "code please": 1447,
    "all thanks": 1448,
    "go visit": 1449,
    "east part": 1450,
    "about an": 1451,
    "attraction that": 1452,
    "entertainment ?": 1453,
    "sounds awesome": 1454,
    "awesome !": 1455,
    "! is": 1456,
    "just the": 1457,
    "number will": 1458,
    "thanks and": 1459,
    "get its": 1460,
    "its address": 1461,
    "visit ?": 1462,
    "recommend me": 1463,
    "number there": 1464,
    "find me": 1465,
    "theatre in": 1466,
    "are their": 1467,
    "their entrance": 1468,
    "something interesting": 1469,
    "interesting ?": 1470,
    "any theatres": 1471,
    "theatres in": 1472,
    ", which": 1473,
    "best ?": 1474,
    "will not": 1475,
    "not be": 1476,
    "be necessary": 1477,
    "necessary .": 1478,
    "some architecture": 1479,
    "architecture to": 1480,
    "are my": 1481,
    "my options": 1482,
    "options ?": 1483,
    "about all": 1484,
    "all saints": 1485,
    "saints ?": 1486,
    "and could": 1487,
    "a postcode": 1488,
    "should be": 1489,
    "all !": 1490,
    "any colleges": 1491,
    "colleges i": 1492,
    "i could": 1493,
    "could visit": 1494,
    "no .": 1495,
    "are no": 1496,
    "no colleges": 1497,
    "colleges in": 1498,
    "in all": 1499,
    "of cambridge": 1500,
    "not believe": 1501,
    "believe that": 1502,
    "is true": 1503,
    "go ,": 1504,
    "what attraction": 1505,
    "types do": 1506,
    "1 to": 1507,
    "to me": 1508,
    "me and": 1509,
    "and give": 1510,
    "and type": 1511,
    "type ?": 1512,
    "of your": 1513,
    "helped with": 1514,
    "with what": 1515,
    "what i": 1516,
    "what colleges": 1517,
    "colleges are": 1518,
    "phone numbers": 1519,
    "numbers for": 1520,
    "for these": 1521,
    "these colleges": 1522,
    "theatre .": 1523,
    ". please": 1524,
    "please choose": 1525,
    "choose your": 1526,
    "area and": 1527,
    "address if": 1528,
    "you thats": 1529,
    "thats all": 1530,
    "north area": 1531,
    "town and": 1532,
    "and need": 1533,
    "get a": 1534,
    "a room": 1535,
    "room to": 1536,
    "to stay": 1537,
    "stay in": 1538,
    "sorry .": 1539,
    "am actually": 1540,
    "actually looking": 1541,
    "some type": 1542,
    "attraction i": 1543,
    "can go": 1544,
    "to up": 1545,
    "up in": 1546,
    ". any": 1547,
    "about your": 1548,
    "? what": 1549,
    "what type": 1550,
    "type is": 1551,
    "attraction is": 1552,
    "is this": 1553,
    "? also": 1554,
    "also ,": 1555,
    "am hanging": 1556,
    "hanging around": 1557,
    "town tomorrow": 1558,
    "tomorrow due": 1559,
    "due to": 1560,
    "an appointment": 1561,
    "appointment and": 1562,
    "and want": 1563,
    "do something": 1564,
    "fun while": 1565,
    "while i": 1566,
    "am there": 1567,
    "centre most": 1568,
    "most of": 1569,
    "the day": 1570,
    "either or": 1571,
    "or would": 1572,
    "fine !": 1573,
    "am open": 1574,
    "open to": 1575,
    "to anything": 1576,
    "anything .": 1577,
    "just pick": 1578,
    "pick a": 1579,
    "a church": 1580,
    "church and": 1581,
    "a entertainment": 1582,
    "entertainment attraction": 1583,
    "any recommendations": 1584,
    "recommendations ?": 1585,
    "area doe": 1586,
    "doe not": 1587,
    "matter ,": 1588,
    "just some": 1589,
    "also need": 1590,
    "need their": 1591,
    "suggest ?": 1592,
    "no preferences": 1593,
    "preferences for": 1594,
    "for area": 1595,
    "area ,": 1596,
    "just suggest": 1597,
    "suggest a": 1598,
    "a couple": 1599,
    "couple ?": 1600,
    "an east": 1601,
    "east based": 1602,
    "based place": 1603,
    "is for": 1604,
    "for those": 1605,
    "those ?": 1606,
    "for funky": 1607,
    "funky fun": 1608,
    "fun house": 1609,
    "house ,": 1610,
    "nightclub to": 1611,
    "just get": 1612,
    "for ballare": 1613,
    "ballare ,": 1614,
    ", no": 1615,
    "that answered": 1616,
    "pool here": 1617,
    "really ,": 1618,
    "area will": 1619,
    "and provide": 1620,
    "provide me": 1621,
    "no actually": 1622,
    "actually ,": 1623,
    "is just": 1624,
    "good day": 1625,
    "am getting": 1626,
    "getting ready": 1627,
    "ready to": 1628,
    "go off": 1629,
    "off to": 1630,
    "to college": 1631,
    "thought while": 1632,
    "was in": 1633,
    "town maybe": 1634,
    "maybe i": 1635,
    "visit 1": 1636,
    "1 .": 1637,
    "think i": 1638,
    "visit the": 1639,
    "good museum": 1640,
    "to any": 1641,
    "any side": 1642,
    "town !": 1643,
    "am sure": 1644,
    "sure my": 1645,
    "my visit": 1646,
    "visit will": 1647,
    "be fun": 1648,
    "need suggetions": 1649,
    "suggetions on": 1650,
    "on things": 1651,
    "to see": 1652,
    "see .": 1653,
    "nothing particular": 1654,
    "favorite attraction": 1655,
    "sounds fun": 1656,
    "all today": 1657,
    "some place": 1658,
    "go on": 1659,
    "prefer just": 1660,
    "just anything": 1661,
    "anything in": 1662,
    "east ,": 1663,
    "place for": 1664,
    "? something": 1665,
    ", then": 1666,
    "then that": 1667,
    "called williams": 1668,
    "williams art": 1669,
    "and antiques": 1670,
    "antiques .": 1671,
    ". just": 1672,
    "some info": 1673,
    "on an": 1674,
    "called kettle": 1675,
    "kettle s": 1676,
    "s yard": 1677,
    "yard .": 1678,
    "great thank": 1679,
    "all that": 1680,
    "go !": 1681,
    "i like": 1682,
    "like looking": 1683,
    "looking at": 1684,
    "architecture of": 1685,
    "of old": 1686,
    "old buildings": 1687,
    "buildings .": 1688,
    "think it": 1689,
    "it says": 1690,
    "says a": 1691,
    "a lot": 1692,
    "lot about": 1693,
    "about how": 1694,
    "how we": 1695,
    "we used": 1696,
    "used to": 1697,
    "to live": 1698,
    "live .": 1699,
    "what would": 1700,
    "the holy": 1701,
    "holy trinity": 1702,
    "trinity church": 1703,
    "church sounds": 1704,
    "sounds lovely": 1705,
    "lovely .": 1706,
    "a boat": 1707,
    "boat to": 1708,
    "visit on": 1709,
    "north side": 1710,
    "side ?": 1711,
    "you see": 1712,
    "see if": 1713,
    "any entertainment": 1714,
    "entertainment attractions": 1715,
    "work great": 1716,
    "to .": 1717,
    "a concert": 1718,
    "concert hall": 1719,
    "hall in": 1720,
    "attraction instead": 1721,
    "yes and": 1722,
    "and can": 1723,
    "there anything": 1724,
    "anything located": 1725,
    "was thinking": 1726,
    "thinking of": 1727,
    "of something": 1728,
    "whale of": 1729,
    "of a": 1730,
    "a time": 1731,
    "time sounds": 1732,
    "a whale": 1733,
    "time !": 1734,
    "! yes": 1735,
    "hoping to": 1736,
    "number is": 1737,
    "the soul": 1738,
    "soul tree": 1739,
    "tree ?": 1740,
    "know where": 1741,
    "can find": 1742,
    "church ?": 1743,
    "great what": 1744,
    "attraction are": 1745,
    "are they": 1746,
    "they ?": 1747,
    "for 1": 1748,
    "museums ?": 1749,
    "that covers": 1750,
    "covers everything": 1751,
    "attractions do": 1752,
    ", preferably": 1753,
    "preferably near": 1754,
    "near the": 1755,
    "and what": 1756,
    "is its": 1757,
    "may have": 1758,
    "have i": 1759,
    "have phone": 1760,
    "visit both": 1761,
    "both churchill": 1762,
    "churchill and": 1763,
    "and magdalene": 1764,
    "magdalene colleges": 1765,
    "colleges .": 1766,
    "their telephone": 1767,
    "telephone numbers": 1768,
    "numbers please": 1769,
    ". good": 1770,
    "cambridge corn": 1771,
    "corn exchange": 1772,
    "your recommended": 1773,
    "recommended 1": 1774,
    "? you": 1775,
    "choose .": 1776,
    "cinema in": 1777,
    "to ?": 1778,
    "either area": 1779,
    "you pick": 1780,
    "know their": 1781,
    "so that": 1782,
    "theatre ?": 1783,
    "need right": 1784,
    "entertainment spots": 1785,
    "spots in": 1786,
    "is .": 1787,
    "again .": 1788,
    "love the": 1789,
    "to tour": 1790,
    "s available": 1791,
    "is not": 1792,
    "not an": 1793,
    "an issue": 1794,
    "issue .": 1795,
    "been injured": 1796,
    "injured and": 1797,
    "a hospital": 1798,
    "hospital nearby": 1799,
    "nearby .": 1800,
    "the general": 1801,
    "general phone": 1802,
    "looking in": 1803,
    "town for": 1804,
    "hospital with": 1805,
    "a paediatric": 1806,
    "paediatric clinic": 1807,
    "where s": 1808,
    "the closest": 1809,
    "closest hospital": 1810,
    "paediatric intensive": 1811,
    "intensive care": 1812,
    "care unit": 1813,
    "unit ?": 1814,
    "need medical": 1815,
    "medical treatment": 1816,
    "treatment .": 1817,
    "me how": 1818,
    "how to": 1819,
    "get to": 1820,
    "to addenbrookes": 1821,
    "addenbrookes hospital": 1822,
    "hospital ?": 1823,
    "the hospital": 1824,
    "hospital and": 1825,
    "the transplant": 1826,
    "transplant high": 1827,
    "high dependency": 1828,
    "dependency unit": 1829,
    "unit department": 1830,
    "department ,": 1831,
    "great that": 1832,
    "the addenbrookes": 1833,
    "but do": 1834,
    "the postal": 1835,
    "code by": 1836,
    "by any": 1837,
    "any chance": 1838,
    "chance ?": 1839,
    "hospital in": 1840,
    "they have": 1841,
    "a transitional": 1842,
    "transitional care": 1843,
    "care department": 1844,
    "department ?": 1845,
    "'ll just": 1846,
    "just head": 1847,
    "head down": 1848,
    "down ,": 1849,
    ", so": 1850,
    "so i": 1851,
    "not need": 1852,
    "need anything": 1853,
    "else at": 1854,
    "the moment": 1855,
    ". later": 1856,
    "later !": 1857,
    "where the": 1858,
    "hospital is": 1859,
    "is please": 1860,
    "specific department": 1861,
    "department .": 1862,
    "will call": 1863,
    "call addenbrrokes": 1864,
    "addenbrrokes hospital": 1865,
    "hospital ,": 1866,
    ", cb20qq": 1867,
    "cb20qq at": 1868,
    "at phone": 1869,
    "number 01223245151": 1870,
    "01223245151 .": 1871,
    "! have": 1872,
    "i seem": 1873,
    "seem to": 1874,
    "have injured": 1875,
    "injured myself": 1876,
    "myself and": 1877,
    "a nearby": 1878,
    "nearby hospital": 1879,
    "hospital .": 1880,
    "suppose i": 1881,
    "i should": 1882,
    "should grab": 1883,
    "grab the": 1884,
    "code to": 1885,
    "to so": 1886,
    "not get": 1887,
    "get lost": 1888,
    "lost on": 1889,
    "the way": 1890,
    "way there": 1891,
    "was everything": 1892,
    "have info": 1893,
    "injured .": 1894,
    ". where": 1895,
    "their post": 1896,
    "code and": 1897,
    "a haematology": 1898,
    "haematology day": 1899,
    "day unit": 1900,
    "unit .": 1901,
    "think you": 1902,
    "have given": 1903,
    "given me": 1904,
    "me all": 1905,
    "hospital close": 1906,
    "close by": 1907,
    "by ?": 1908,
    "for addenbrookes": 1909,
    "the nearest": 1910,
    "nearest hospital": 1911,
    "hospital please": 1912,
    "i got": 1913,
    "got injured": 1914,
    ". the": 1915,
    "hospital should": 1916,
    "should have": 1917,
    "the acute": 1918,
    "acute medical": 1919,
    "medical assessment": 1920,
    "assessment unit": 1921,
    "alright .": 1922,
    "and that": 1923,
    "am injured": 1924,
    "and are": 1925,
    "are looking": 1926,
    "nearby it": 1927,
    "it should": 1928,
    "the neurology": 1929,
    "neurology neurosurgery": 1930,
    "neurosurgery department": 1931,
    "on addenbrookes": 1932,
    "you provide": 1933,
    "provide the": 1934,
    "? thanks": 1935,
    ", postal": 1936,
    "code ,": 1937,
    "you requre": 1938,
    "requre furthuer": 1939,
    "furthuer assistance": 1940,
    "assistance ?": 1941,
    "does the": 1942,
    "address not": 1943,
    "a street": 1944,
    "street number": 1945,
    "not .": 1946,
    "in need": 1947,
    "need of": 1948,
    "a local": 1949,
    "local hospital": 1950,
    "it must": 1951,
    "must have": 1952,
    "a oral": 1953,
    "oral and": 1954,
    "and maxillofacial": 1955,
    "maxillofacial surgery": 1956,
    "surgery and": 1957,
    "and ent": 1958,
    "ent department": 1959,
    "department !": 1960,
    ", where": 1961,
    "where can": 1962,
    "i find": 1963,
    "find addenbrookes": 1964,
    "the infectious": 1965,
    "infectious diseases": 1966,
    "diseases department": 1967,
    "to book": 1968,
    "book an": 1969,
    "appointment .": 1970,
    "no i": 1971,
    "a intermediate": 1972,
    "intermediate dependancy": 1973,
    "dependancy area": 1974,
    "area department": 1975,
    "cambridge that": 1976,
    "has a": 1977,
    "a plastic": 1978,
    "plastic and": 1979,
    "and vascular": 1980,
    "vascular surgery": 1981,
    "surgery department": 1982,
    "you send": 1983,
    "send their": 1984,
    ", this": 1985,
    "this will": 1986,
    "do for": 1987,
    "helping me": 1988,
    "me !": 1989,
    "town with": 1990,
    "a cardiology": 1991,
    "cardiology and": 1992,
    "and coronary": 1993,
    "coronary care": 1994,
    "also have": 1995,
    "you goodbye": 1996,
    "for hospital": 1997,
    "please with": 1998,
    "a infusion": 1999,
    "infusion service": 2000,
    "service department": 2001,
    "been hurt": 2002,
    "hurt in": 2003,
    "in an": 2004,
    "an accident": 2005,
    "accident ,": 2006,
    "i better": 2007,
    "better get": 2008,
    "get going": 2009,
    "going .": 2010,
    "address so": 2011,
    "hospital have": 2012,
    "a transplant": 2013,
    "have answered": 2014,
    "hospital that": 2015,
    "is close": 2016,
    "close to": 2017,
    "to this": 2018,
    "this location": 2019,
    "location .": 2020,
    "not know": 2021,
    "know it": 2022,
    "the hospitals": 2023,
    "hospitals phone": 2024,
    "where is": 2025,
    "that please": 2026,
    "injured pretty": 2027,
    "pretty severely": 2028,
    "severely and": 2029,
    "a john": 2030,
    "john farman": 2031,
    "farman intensive": 2032,
    "great thanks": 2033,
    "will head": 2034,
    "head over": 2035,
    "over there": 2036,
    ". got": 2037,
    "got ta": 2038,
    "ta go": 2039,
    ". my": 2040,
    "my son": 2041,
    "son is": 2042,
    "is driving": 2043,
    "driving me": 2044,
    ". on": 2045,
    "on our": 2046,
    "our way": 2047,
    "way now": 2048,
    "for you": 2049,
    "need !": 2050,
    "but can": 2051,
    "hospital here": 2052,
    "does may": 2053,
    "please have": 2054,
    "general info": 2055,
    "info is": 2056,
    "hurt and": 2057,
    "hospital !": 2058,
    "! where": 2059,
    "there 1": 2060,
    "1 close": 2061,
    "got what": 2062,
    "injured i": 2063,
    "has the": 2064,
    "cambridge eye": 2065,
    "eye unit": 2066,
    "address as": 2067,
    "my records": 2068,
    "records ,": 2069,
    "hospital as": 2070,
    "how would": 2071,
    "would i": 2072,
    "find tr6247": 2073,
    "tr6247 in": 2074,
    "a phone": 2075,
    "hospital near": 2076,
    "near by": 2077,
    "by .": 2078,
    "injured ,": 2079,
    "me today": 2080,
    "today !": 2081,
    "of all": 2082,
    "my needs": 2083,
    "needs now": 2084,
    "too .": 2085,
    "please find": 2086,
    "find for": 2087,
    "the location": 2088,
    "location of": 2089,
    "of addenbrookes": 2090,
    "with acute": 2091,
    "telephone number": 2092,
    "particular department": 2093,
    "but may": 2094,
    "! you": 2095,
    ". your": 2096,
    "your business": 2097,
    "business provides": 2098,
    "provides a": 2099,
    "great service": 2100,
    "service .": 2101,
    "is here": 2102,
    "please book": 2103,
    "book a": 2104,
    "a taxi": 2105,
    "taxi to": 2106,
    "to take": 2107,
    "take me": 2108,
    "me there": 2109,
    "all quite": 2110,
    "quite confusing": 2111,
    "confusing .": 2112,
    "will find": 2113,
    "find help": 2114,
    "help nearby": 2115,
    "the emergency": 2116,
    "emergency department": 2117,
    "no not": 2118,
    "this time": 2119,
    "you and": 2120,
    "like its": 2121,
    "its general": 2122,
    "ok thank": 2123,
    "a neurology": 2124,
    "neurology department": 2125,
    "please call": 2126,
    "call a": 2127,
    "i actually": 2128,
    "actually do": 2129,
    "taxi .": 2130,
    "i sure": 2131,
    "sure hope": 2132,
    "hope so": 2133,
    "so .": 2134,
    "a child": 2135,
    "child -s": 2136,
    "-s s": 2137,
    "s oncology": 2138,
    "oncology and": 2139,
    "and haematology": 2140,
    "haematology department": 2141,
    "am heading": 2142,
    "heading there": 2143,
    "there now": 2144,
    "me get": 2145,
    "get postcode": 2146,
    "enjoyed your": 2147,
    "your services": 2148,
    "services .": 2149,
    ". keep": 2150,
    "keep that": 2151,
    "day yourself": 2152,
    "yourself .": 2153,
    "for addengrookes": 2154,
    "addengrookes hospital": 2155,
    "is addensbrookes": 2156,
    "addensbrookes hospital": 2157,
    "anything further": 2158,
    "further for": 2159,
    "you today": 2160,
    "have had": 2161,
    "had an": 2162,
    "an injury": 2163,
    "injury !": 2164,
    "where do": 2165,
    "do i": 2166,
    "set for": 2167,
    "yes the": 2168,
    "number also": 2169,
    "also .": 2170,
    "hospital it": 2171,
    "the respiratory": 2172,
    "respiratory medicine": 2173,
    "medicine department": 2174,
    "yes i": 2175,
    "if they": 2176,
    "a gastroenterology": 2177,
    "gastroenterology department": 2178,
    "appreciate it": 2179,
    "the hepatobillary": 2180,
    "hepatobillary and": 2181,
    "and gastrointestinal": 2182,
    "gastrointestinal surgery": 2183,
    "surgery regional": 2184,
    "regional referral": 2185,
    "referral centre": 2186,
    "centre department": 2187,
    "the addensbrookes": 2188,
